pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// bl602_demo_at_text_0003.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 23030760: Register Eq_2 lld_pdu_tx_flush(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out Eq_143438 s0Out, Register out (ptr32 Eq_143439) s1Out, Register out (ptr32 Eq_143440) a0Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      lld_evt_init
//      lld_evt_elt_delete
//      hci_flush_cmd_handler
Eq_2 lld_pdu_tx_flush(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, union Eq_143438 & s0Out, struct Eq_143439 & s1Out, struct Eq_143440 & a0Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	Eq_2 s2_17 = __csrrs(mstatus, 0x00);
	struct Eq_15 * a5_18 = __csrrc(mstatus, 0x08);
	Eq_2 s3_19 = a0 + 24;
	while (true)
	{
		Eq_2 s1_22 = a5_18->t0018;
		if (a5_18 == null)
			break;
		Eq_2 a0_27;
		Eq_2 s0_49;
		Eq_2 s1_50;
		Eq_2 s2_51;
		Eq_2 s3_52;
		Eq_2 s4_53;
		Eq_2 s5_54;
		word32 s0_252;
		word32 a1_253;
		word32 a5_254;
		word32 s8_255;
		word32 tp_256;
		word32 a0_257;
		word32 a1_258;
		word32 a2_259;
		word32 a3_260;
		word32 a4_261;
		word32 a5_262;
		word32 a6_263;
		word32 s8_264;
		word32 mstatus_265;
		word32 tp_266;
		word32 s1_267;
		word32 a0_268;
		word32 a1_269;
		word32 a2_270;
		word32 a3_271;
		word32 a4_272;
		word32 a6_273;
		word32 s8_274;
		ra = ble_ke_free(ble_ke_free(ble_co_list_pop_front(ra, s0, s3_19, out s0_252, out a0_27, out a1_253, out a5_254, out s8_255), a0_27, s1_22, *((word32) a0_27 + 8), s2_17, s3_19, s4, s5, out tp_256, out s0_49, out s1_50, out a0_257, out a1_258, out a2_259, out a3_260, out a4_261, out a5_262, out a6_263, out s2_51, out s3_52, out s4_53, out s5_54, out s8_264, out mstatus_265), s0_49, s1_50, s0_49, s2_51, s3_52, s4_53, s5_54, out tp_266, out s0, out s1_267, out a0_268, out a1_269, out a2_270, out a3_271, out a4_272, out a5_18, out a6_273, out s2_17, out s3_19, out s4, out s5, out s8_274, out mstatus);
	}
	__csrrw(mstatus, 0x00);
	word32 s1_86;
	word32 s1_101;
	word32 a0_109;
	ui32 s0_115;
	struct Eq_143439 * s1_116;
	Eq_2 s2_117;
	Eq_2 s3_118;
	word32 s0_275;
	word32 a0_276;
	word32 s2_277;
	word32 s3_278;
	word32 s0_279;
	word32 a0_280;
	word32 s2_281;
	word32 s3_282;
	Eq_2 ra_114 = lld_pdu_tx_flush_list(lld_pdu_tx_flush_list(lld_pdu_tx_flush_list(ra, (word32) s1_22 + 32, s5, mstatus, out s0_275, out s1_86, out a0_276, out s2_277, out s3_278), s1_86 + 8, s5, mstatus, out s0_279, out s1_101, out a0_280, out s2_281, out s3_282), s1_101 + 16, s5, mstatus, out s0_115, out s1_116, out a0_109, out s2_117, out s3_118);
	struct Eq_143440 * a0_123 = a0_109 + (s0_115 & 0x00FF);
	if ((a0_123 & 0x00FF) == 0x00)
	{
		s0Out = s0_115 & 0x00FF;
		s1Out = s1_116;
		a0Out = a0_123;
		s2Out = s2_117;
		s3Out = s3_118;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		return ra_114;
	}
	else
	{
		Eq_2 a0_133 = (word32) s1_116->w004C;
		struct Eq_143440 * a0_139;
		Eq_143438 s0_149;
		struct Eq_143439 * s1_150;
		Eq_2 s2_153;
		Eq_2 s3_154;
		ptr32 s4_155;
		Eq_2 s5_156;
		ptr32 s6_157;
		ptr32 s7_158;
		word32 a3_283;
		word32 a4_284;
		word32 mstatus_285;
		Eq_2 ra_148 = llc_common_nb_of_pkt_comp_evt_send(ra_114, s0_115 & 0x00FF, a0_133, a0_123 & 0x00FF, s2_117, s3_118, s5, dwArg10, dwArg14, dwArg38, dwArg0118, out s0_149, out s1_150, out a0_139, out a3_283, out a4_284, out s2_153, out s3_154, out s4_155, out s5_156, out s6_157, out s7_158, out mstatus_285);
		s0Out = s0_149;
		s1Out = s1_150;
		a0Out = a0_139;
		s2Out = s2_153;
		s3Out = s3_154;
		s4Out = s4_155;
		s5Out = s5_156;
		s6Out = s6_157;
		s7Out = s7_158;
		return ra_148;
	}
}

// 230307E2: Register Eq_2 lld_pdu_adv_pack(Register Eq_2 ra, Register Eq_148264 a1, Register (ptr32 Eq_148265) a2, Stack ptr32 dwArg0198, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      lld_con_start
Eq_2 lld_pdu_adv_pack(Eq_2 ra, Eq_148264 a1, struct Eq_148265 * a2, ptr32 dwArg0198, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	if (a2 == null)
	{
		s0Out = s0;
		s1Out = s1;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	else
	{
		ptr32 s0_20;
		ptr32 s10_21;
		ptr32 s2_22;
		ptr32 s3_23;
		ptr32 s4_24;
		ptr32 s5_25;
		ptr32 s6_26;
		ptr32 s7_27;
		ptr32 s9_28;
		ptr32 s1_33;
		ptr32 s11_34;
		word32 a0_87;
		Eq_2 ra_37 = lld_pdu_pack(ra, a1, a2, a2, dwArg0198, out s0_20, out s1_33, out a0_87, out s2_22, out s3_23, out s4_24, out s5_25, out s6_26, out s7_27, out s9_28, out s10_21, out s11_34);
		s0Out = s0_20;
		s1Out = s1_33;
		s2Out = s2_22;
		s3Out = s3_23;
		s4Out = s4_24;
		s5Out = s5_25;
		s6Out = s6_26;
		s7Out = s7_27;
		s9Out = s9_28;
		s10Out = s10_21;
		s11Out = s11_34;
		return ra_37;
	}
}

// 23030804: Register Eq_2 lld_pdu_rx_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register uint32 a1, Register Eq_2 s10, Stack Eq_2 dwArg74, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg010C, Register out ptr32 s0Out, Register out Eq_146912 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out)
// Called from:
//      lld_evt_end_isr
//      lld_evt_rx_isr
//      lld_evt_afs_isr
Eq_2 lld_pdu_rx_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, uint32 a1, Eq_2 s10, Eq_2 dwArg74, Eq_2 dwArgD8, Eq_2 dwArg010C, ptr32 & s0Out, union Eq_146912 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s9Out, union Eq_2 & s10Out)
{
	Eq_2 s2_190 = (word32) g_b42026424;
	Eq_2 s3_191 = a0;
	uint32 s4_192 = a1;
	struct Eq_150352 * s6_273 = &g_dw420262C8;
	word32 s5_279 = 0x28008000;
	struct Eq_150593 * s7_147[] = &g_t42026428;
	struct Eq_150358 * s11_264 = &g_t4200F000;
	s10_289 = s10;
	while (true)
	{
		Eq_2 s10_289;
		ui32 s4_45 = s4_192 + ~0x00;
		s4_192 = s4_45 & 0x00FF;
		if ((s4_45 & 0x00FF) == 0x00FF)
			break;
		if (((word32) *((word32) s3_191 + 86) & 0x10) == 0x00)
		{
			Eq_2 a0_61;
			word32 s0_703;
			word32 mstatus_709;
			word32 a3_704;
			word32 a4_705;
			word32 a5_706;
			word32 a6_707;
			word32 s8_708;
			Eq_2 s1_141;
			Eq_2 ra_212 = ble_ke_malloc(ra, s0, s1, 0x10, 0x00, out s0_703, out s1_141, out a0_61, out a3_704, out a4_705, out a5_706, out a6_707, out s4_192, out s8_708, out mstatus_709);
			struct Eq_150405 * a5_78 = (word32) s2_190 + 0x0E;
			word32 a4_85 = (word32) a5_78->w280083D2;
			*((word32) a0_61 + 4) = (byte) s2_190;
			*((word32) a0_61 + 6) = (word16) (word32) *((word32) s3_191 + 76);
			ui32 a4_96 = (word32) (word16) (word32) a5_78[(s5_279 + 976) / 0x280083D4];
			((word32) a0_61 + 8)->u2 = (word16) a4_96;
			word32 a5_98 = (word32) a5_78[(s5_279 + 980) / 0x280083D4];
			((word32) a0_61 + 5)->u0 = 0x00;
			Eq_150447 a5_101 = (word32) (word16) a5_98;
			*((word32) a0_61 + 0x0D) = (byte) (a5_101 >> 0x0F);
			*((word32) a0_61 + 11) = (byte) (a5_101 >> 0x08 & 63);
			*((word32) a0_61 + 0x0C) = (byte) a5_101;
			s0 = a0_61;
			uint32 a3_89 = (word32) (word16) a4_85;
			ui32 a5_108 = (word32) *((word32) s3_191 + 86);
			if ((a5_108 & 1) != 0x00 && (a4_96 & 64) == 0x00)
				*((word32) s3_191 + 86) = (byte) (a5_108 & ~0x01);
			if ((word32) (word16) ((word32) *((word32) a0_61 + 6) + ~0x01) > 0x01)
			{
				*((word32) a0_61 + 0x0A) = (byte) (a3_89 >> 0x08);
				ui32 a5_124 = (word32) *((word32) s3_191 + 86);
				if ((a5_124 & 2) != 0x00)
				{
					ui32 a4_126 = (word32) *((word32) a0_61 + 8);
					if ((a4_126 & 0x01) == 0x00)
					{
						*((word32) s3_191 + 86) = (byte) (a5_124 & ~0x02);
						(a4_126 & 0x01)->w005C = (word16) ((word32) (a4_126 & 0x01)->w005C | 0x0100);
					}
				}
				if (((word32) *((word32) a0_61 + 8) & 319) == 0x00)
				{
					word32 a5_140 = (word32) *((word32) a0_61 + 0x0A);
					if (a5_140 == 0x00)
						goto l230309FE;
					s1_141 = (word32) *((word32) a0_61 + 6);
					if (((word32) s7_147[s1_141]->b00A5 & 0x02) != 0x00)
						*((word32) a0_61 + 0x0A) = (byte) (a5_140 + ~0x03);
					if ((a3_89 & 3) == 0x00)
						goto l230309FE;
					if ((a3_89 & 3) > 0x02)
					{
						if ((a3_89 & 3) != 0x03)
							goto l230309FE;
						word32 a5_345;
						Eq_2 s1_223 = (word32) (word16) (s1_141 << 8 | 1);
						word32 a0_229;
						struct Eq_150714 * s0_239;
						word32 s1_240;
						word32 s2_241;
						word32 s3_242;
						word32 s4_243;
						word32 s8_244;
						word32 mstatus_733;
						word32 a7_732;
						word32 a4_730;
						word32 a6_731;
						word32 a1_727;
						word32 a2_728;
						word32 a3_729;
						Eq_2 ra_238 = ble_ke_msg_alloc(ra_212, a0_61, s1_223, 266, s1_223, s1_223, 0x1C, s2_190, s3_191, dwArgD8, out s0_239, out s1_240, out a0_229, out a1_727, out a2_728, out a3_729, out a4_730, out a6_731, out a7_732, out s2_241, out s3_242, out s4_243, out s8_244, out mstatus_733);
						Eq_146912 a4_267 = (word32) (word16) (word32) ((word32) s0_239->b0004 + 0x0E + (s5_279 + 982));
						<anonymous> * a5_265 = s11_264->ptr03D0;
						word32 s4_278;
						up32 s8_281;
						word32 s2_287;
						word32 a6_295;
						word32 a4_298;
						word32 a7_299;
						word32 mstatus_300;
						word32 t1_301;
						Eq_2 s1_286;
						Eq_2 ra_284;
						struct Eq_150774 * sp_275;
						a5_265();
						dwLoc4C = a4_267;
						up32 a5_302 = (word32) *((word32) s9 + 2);
						word32 s0_304 = sp_275->dw00C4;
						if (a5_302 > 0x15)
						{
							a5_345 = 0x19;
							goto l230309E6;
						}
						struct Eq_150786 * a5_308 = a5_302 + 0x0C + s8_281;
						word32 a1_309 = (word32) a5_308->b0000;
						if (a1_309 != a6_295)
						{
							a5_345 = 0x1E;
l230309E6:
							*s9 = (byte) a5_345;
						}
						else
						{
							<anonymous> * a5_311 = a5_308->ptr0008;
							*s9 = 0x00;
							word32 a4_341;
							word32 a7_342;
							word32 mstatus_343;
							word32 t1_344;
							a5_311();
						}
						Eq_2 s0_370;
						Eq_2 s1_371;
						word32 tp_734;
						word32 t1_735;
						word32 mstatus_741;
						word32 a4_739;
						word32 a5_740;
						word32 a0_736;
						word32 a2_737;
						word32 a3_738;
						ra_212 = ble_ke_msg_send(llc_llcp_recv_handler(ra_284, s1_286, (word32) *s9, s10_289, 0x01, sp_275->dw0000, sp_275->t0004, sp_275->dw0028, sp_275->dw0044, out s0_370, out s1_371, out s2_190, out s4_192), s0_370, s1_371, s9, sp_275->t0010, out tp_734, out t1_735, out s0, out s1_141, out a0_736, out a2_737, out a3_738, out a4_739, out a5_740, out mstatus_741);
						goto l230309FE;
					}
					Eq_2 a2_160 = (word32) (word16) (s1_141 << 0x08 | 1);
					Eq_2 a0_178;
					word32 a4_182;
					struct Eq_150624 * s0_188;
					Eq_2 s1_189;
					word32 a6_715;
					word32 a7_716;
					word32 s8_717;
					word32 mstatus_718;
					word32 a1_712;
					word32 a2_713;
					word32 a3_714;
					Eq_2 ra_187 = ble_ke_msg_alloc(ra_212, a0_61, s1_141, 0x0100, a2_160, a2_160, 0x08, s2_190, s3_191, dwArgD8, out s0_188, out s1_189, out a0_178, out a1_712, out a2_713, out a3_714, out a4_182, out a6_715, out a7_716, out s2_190, out s3_191, out s4_192, out s8_717, out mstatus_718);
					*a0_178 = (word16) (word32) s0_188->w0006;
					word32 a3_200 = (word32) *((word32) dwArg74 + 0x0A);
					*((word32) a0_178 + 2) = (byte) a4_182;
					*((word32) a0_178 + 4) = (word16) a3_200;
					*((word32) a0_178 + 6) = (byte) (word32) *((word32) dwArg74 + 4);
					dwLoc4C = a3_89 & 3;
					word32 a4_724;
					word32 a5_725;
					word32 mstatus_726;
					word32 a3_723;
					word32 a0_721;
					word32 a2_722;
					word32 tp_719;
					word32 t1_720;
					ra_212 = ble_ke_msg_send(ra_187, dwArg74, s1_189, a0_178, s10, out tp_719, out t1_720, out s0, out s1_141, out a0_721, out a2_722, out a3_723, out a4_724, out a5_725, out mstatus_726);
				}
				else
				{
l230309FE:
					em_buf_rx_free((word32) *((word32) s0 + 4));
					((word32) s0 + 5)->u0 = 0x01;
				}
			}
			word32 a0_710;
			word32 a5_711;
			ra = ble_co_list_push_back(ra_212, s0, s1_141, 0x42026448, s0, out s1, out a0_710, out a5_711);
		}
		else
			em_buf_rx_free(s2_190);
		s2_190 = (word32) s2_190 + 1 & 7;
	}
	s6_273->b015C = (byte) s2_190;
	0x00 = (int8) dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	s2Out = s2_190;
	s3Out = s3_191;
	s9Out = s9;
	s10Out = s10_289;
	return dwLoc08;
}

// 23030A96: Register word32 lld_sleep_init(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 s2, Register word32 s3, Register out ptr32 s0Out, Register out ptr32 s1Out)
// Called from:
//      lld_init
word32 lld_sleep_init(word32 ra, word32 s0, word32 s1, word32 s2, word32 s3, ptr32 & s0Out, ptr32 & s1Out)
{
	<anonymous> * a5_5 = g_ptr4200F3D4;
	word32 ra_25;
	struct Eq_150887 * s3_29;
	a5_5();
	((word32) (word16) rwip_us_2_lpcycles(625) | rwip_us_2_lpcycles(0x01000388) << 21 | rwip_us_2_lpcycles(0x01000388) << 0x0A & 0x03FFFC00)->dw003C = 0x28000000;
	struct Eq_150912 * a5_61 = rwip_wakeup_delay_set(0x01000388);
	ptr32 s0_62 = a5_61->ptr0030;
	((ptr32[]) 48)[(word32) (word31) a5_61 / 4] = s0_62;
	s3_29->dw0004 = 0x00;
	s3_29->w0008 = 0x00;
	s0Out = s0_62;
	s1Out = 0x01000000;
	return ra_25;
}

// 23030B1E: Register (ptr32 Eq_131195) lld_sleep_wakeup(Register (ptr32 Eq_131195) a0, Register (ptr32 Eq_131193) a5, Register out (ptr32 Eq_131209) a3Out, Register out Eq_2 a4Out)
// Called from:
//      rwip_wakeup
struct Eq_131195 * lld_sleep_wakeup(struct Eq_131195 * a0, struct Eq_131193 * a5, struct Eq_131209 & a3Out, union Eq_2 & a4Out)
{
	word32 a4_5 = a5->dw0030;
	((word32[]) 48)[(word32) (word31) a5 / 4] = a4_5;
	struct Eq_131293 * a5_10 = &g_ptr420131B8;
	struct Eq_131209 * a3_11 = (word32) g_b420131C1;
	if (a3_11 == null)
	{
		struct Eq_150952 * a4_17 = (word32) g_b420131C0;
		if (a4_17 != null)
		{
			a5_10 = a4_17->ptr0004;
			a5_10->b0008 = 0x00;
			a0 -= a4_17;
		}
		else
			a0->ptr0004 = (struct Eq_131293 *) &g_ptr420131B8;
		uint32 a0_34 = rwip_sleep_lpcycles_2_us(a0, a5_10) + (word32) g_b4202645A;
		uint32 a0_40 = (a0_34 >> 625) + 625 - a0_34 + 624 << 16;
		struct Eq_151007 * a4_35 = a0_34 >> 625;
		struct Eq_131195 * a0_41 = a0_40 >> 16;
		word32 a5_42 = 0x00;
		if (a0_40 >> 16 == 0x00)
		{
			a4_35 = (a0_34 >> 625) + 0x01;
			a5_42 = 0x01;
			a0_41 = (struct Eq_131195 *) 624;
		}
		g_b4202645A = (byte) a5_42;
		a4_35->dw0044 = 0x28000000;
		a0_41->dw0040 = 0x28000000;
		(a4_35 | 8)->dw0030 = a4_35->dw0030;
		((union Eq_2 *) 0x19)->u0 = 0x28000000;
		((union Eq_2 *) 0x0D)->u0 = 0x28000000;
		a3Out = (struct Eq_131209 *) &g_t42026430;
		a4Out.u0 = <invalid>;
		return a0_41;
	}
	else
	{
		struct Eq_150958 * a5_65 = a3_11->ptr000C;
		a5_65->w0008 = 0x00;
		a3_11->dw0044 = a4_5;
		struct Eq_150969 * a5_68 = a5_65->ptr0010;
		a5_68->dw0040 = a4_5;
		(a5_68 | 8)->dw0030 = a5_68->dw0030;
		((union Eq_2 *) 0x19)->u0 = 0x28000000;
		((union Eq_2 *) 0x0D)->u0 = 0x28000000;
		a3Out = a3_11;
		a4Out.u0 = <invalid>;
		return a0;
	}
}

