pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23030BD2: void lld_sleep_wakeup_end()
// Called from:
//      rwip_wakeup_end
void lld_sleep_wakeup_end()
{
	g_ptr420131B8->dw000C = 0x28000000;
}

// 23030BE2: Register (ptr32 Eq_151067) lld_util_instant_get(Register (ptr32 Eq_151067) a0, Register word32 a1)
// Called from:
//      llc_llcp_ch_map_update_pdu_send
struct Eq_151067 * lld_util_instant_get(struct Eq_151067 * a0, word32 a1)
{
	word32 a5_5 = (word32) a0->w0036;
	a0->b0045 = (byte) a1;
	struct Eq_151067 * a5_13 = (word32) (word16) (a5_5 + 0x06 + (word32) a0->w0038);
	a0->w0034 = (word16) a5_13;
	return a5_13;
}

// 23030C02: void lld_util_set_bd_address(Register (ptr32 Eq_151092) a0, Register ui32 a1, Register (ptr32 Eq_151094) a2)
// Called from:
//      llm_util_apply_bd_addr
void lld_util_set_bd_address(struct Eq_151092 * a0, ui32 a1, struct Eq_151094 * a2)
{
	(((word32) a0->b0003 << 8 | (word32) a0->b0002) << 16 | ((word32) a0->b0001 << 8 | (word32) a0->b0000))->dw0024 = 0x28000000;
	struct Eq_151124 * a5_27 = (word32) a0->b0005 << 8 | (word32) a0->b0004 | a2 & 0xF0000000;
	a5_27->dw0028 = a2->dw0028;
	(a5_27 & ~0x10000000 | a1 << 16)->dw0028 = a5_27->dw0028;
}

// 23030C48: Register Eq_151156 lld_util_freq2chnl(Register Eq_151156 a0)
// Called from:
//      lld_test_mode_tx
//      lld_test_mode_rx
Eq_151156 lld_util_freq2chnl(Eq_151156 a0)
{
	if (a0 == 0x0C)
		return 38;
	if (a0 == 39)
		return a0;
	if (a0 == 0x00)
	{
		a0.u0 = 37;
		return a0;
	}
	else
	{
		Eq_151165 a0_10;
		if (a0 <= 11)
			a0_10 = (word32) a0.u0 - 1;
		else
			a0_10 = (word32) a0.u0 - 2;
		return a0_10 & 0x00FF;
	}
}

// 23030C76: void lld_util_get_local_offset()
// Called from:
//      lld_con_update_after_param_req
//      lld_con_param_rsp
void lld_util_get_local_offset()
{
}

// 23030C82: Register word32 lld_util_get_peer_offset(Register word32 a0, Register uint32 a1, Register (ptr32 Eq_146217) a2)
// Called from:
//      lld_evt_move_to_slave
//      lld_con_update_after_param_req
//      lld_con_param_rsp
//      lld_con_param_req
word32 lld_util_get_peer_offset(word32 a0, uint32 a1, struct Eq_146217 * a2)
{
	return (word32) (word16) (a0 + a1 - (a2 & a1) | a1);
}

// 23030C94: Register Eq_2 lld_util_connection_param_set(Register Eq_2 a0, Register (ptr32 uint16) a1, Register (ptr32 Eq_145650) a3)
// Called from:
//      lld_evt_update_create
//      lld_scan_start
//      lld_con_start
Eq_2 lld_util_connection_param_set(Eq_2 a0, uint16 * a1, struct Eq_145650 * a3)
{
	uint32 a5_29 = (word32) *a1;
	Eq_2 a1_9 = a3->t0004;
	struct Eq_145650 * a4_10 = a5_29 - (word32) (*((word32) a0 + 25));
	if (a4_10 < a3)
		a4_10->t0004 = a1_9;
	Eq_2 a1_14 = a4_10->t0004;
	if (a4_10 == null)
	{
		*(union Eq_2 *) 0x06 = a1_14;
		a4_10 = (struct Eq_145650 *) 0x02;
	}
	Eq_2 a1_19 = a4_10->t0004;
	struct Eq_151209 * a4_21 = (char *) &a4_10->t0004 + 621;
	uint32 a3_22 = (word32) *((word32) a1_19 + 8);
	a4_21->t0004 = a1_19;
	Eq_2 a0_24 = a4_21->t0008;
	uint32 a4_27 = a4_21 & a5_29;
	if (a3_22 >= a4_27)
	{
		if (a4_27 != 0x00 || a3_22 != 0x00)
			a5_29 = a3_22 - a4_27;
	}
	else
		a5_29 = a5_29 + a3_22 - a4_27;
	((word32) a1_19 + 8)->u2 = (word16) a5_29;
	return a0_24;
}

// 23030CE0: void lld_util_dle_set_cs_fields(Register (ptr32 Eq_142756) a0)
// Called from:
//      lld_evt_schedule
void lld_util_dle_set_cs_fields(struct Eq_142756 * a0)
{
	struct Eq_151241 * a4_16 = (word32) g_t42026470;
	a0->w2800810C = (word16) ((word32) (word16) (word32) a0->w2800810C & -0x0100 | a4_16);
	a0->w2800810E = (word16) (word32) a4_16->w0050;
}

// 23030D28: Register Eq_2 lld_util_anchor_point_move(Register Eq_2 ra, Register (ptr32 Eq_151266) a0, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArgE8, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_util_bw_mgt
Eq_2 lld_util_anchor_point_move(Eq_2 ra, struct Eq_151266 * a0, Eq_2 s2, Eq_2 s3, Eq_2 dwArgE8, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	word16 wLoc34_139 = (word16) (word32) a0->w0078;
	word32 a0_32;
	Eq_2 s1_47;
	word32 a2_175;
	word32 a3_176;
	word32 a5_177;
	Eq_2 s0_39 = ea_offset_req(fp + -40, fp + -52, out s1_47, out a0_32, out a2_175, out a3_176, out a5_177);
	if (a0_32 == 0x00)
	{
		Eq_2 a0_59;
		struct Eq_151301 * a2_61;
		struct Eq_151302 * s0_69;
		Eq_2 s1_70;
		word32 a1_178;
		word32 a3_179;
		word32 a4_180;
		word32 a6_181;
		word32 a7_182;
		word32 s8_183;
		word32 mstatus_184;
		Eq_2 ra_68 = ble_ke_msg_alloc(ra, s0_39, s1_47, 265, (word32) (word16) ((word32) *((word32) s0_39 + 116) << 8 | 1), 0x02, 0x0022, s2, s3, dwArgE8, out s0_69, out s1_70, out a0_59, out a1_178, out a2_61, out a3_179, out a4_180, out a6_181, out a7_182, out s2, out s3, out s4, out s8_183, out mstatus_184);
		*a0_59 = 0x01;
		uint32 a3_80 = (word32) wLoc34_139;
		*((word32) a0_59 + 2) = (word16) (a3_80 >> 0x01);
		*((word32) a0_59 + 4) = (word16) (a3_80 >> 0x01);
		*((word32) a0_59 + 0x0E) = (word16) (a3_80 >> 0x01);
		*((word32) a0_59 + 16) = (word16) (a3_80 >> 0x01);
		word32 a4_86 = (word32) s0_69->w005E;
		*((word32) a0_59 + 18) = 0x00;
		*((word32) a0_59 + 6) = (word16) (a4_86 + ~0x00);
		*((word32) a0_59 + 8) = 64440;
		word32 a4_93 = (word32) s0_69->w0060;
		*((word32) a0_59 + 20) = (word16) a4_93;
		*((word32) a0_59 + 0x0A) = (word16) a4_93;
		*((word32) a0_59 + 0x0C) = (word16) (word32) s0_69->w0060;
		Eq_2 s0_98 = a2_61->t0008;
		*((word32) a0_59 + 22) = (word16) ((word32) (word16) (a3_80 - (a2_61 & a3_80) | a3_80) >> 1);
		*((word32) a0_59 + 24) = ~0x00;
		((word32) a0_59 + 26)->u0 = ~0x00;
		*((word32) a0_59 + 28) = ~0x00;
		((word32) a0_59 + 30)->u2 = ~0x00;
		((word32) a0_59 + 32)->u0 = ~0x00;
		word32 tp_185;
		word32 t1_186;
		word32 s0_187;
		word32 s1_188;
		word32 a0_189;
		word32 a2_190;
		word32 a3_191;
		word32 a4_192;
		word32 a5_193;
		ra = ble_ke_msg_send(ra_68, s0_98, s1_70, a0_59, dwLoc30, out tp_185, out t1_186, out s0_187, out s1_188, out a0_189, out a2_190, out a3_191, out a4_192, out a5_193, out mstatus);
	}
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	mstatusOut = mstatus;
	return ra;
}

// 23030E2A: Register Eq_2 lld_util_flush_list(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5)
// Called from:
//      lld_evt_init
//      llm_set_scan_en
//      llm_init
Eq_2 lld_util_flush_list(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5)
{
	Eq_2 s0_10 = a0;
	while (true)
	{
		Eq_2 a0_13;
		Eq_2 s0_18;
		word32 a1_79;
		word32 a5_80;
		word32 s8_81;
		Eq_2 ra_17 = ble_co_list_pop_front(ra, s0_10, s0_10, out s0_18, out a0_13, out a1_79, out a5_80, out s8_81);
		if (a0_13 == 0x00)
			break;
		word32 tp_69;
		word32 a0_70;
		word32 a1_71;
		word32 a2_72;
		word32 a3_73;
		word32 a4_74;
		word32 a5_75;
		word32 a6_76;
		word32 s8_77;
		word32 mstatus_78;
		ra = ble_ke_free(ra_17, s0_18, s1, a0_13, s2, s3, s4, s5, out tp_69, out s0_10, out s1, out a0_70, out a1_71, out a2_72, out a3_73, out a4_74, out a5_75, out a6_76, out s2, out s3, out s4, out s5, out s8_77, out mstatus_78);
	}
	return ra_17;
}

