pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23030E48: Register Eq_2 lld_util_instant_ongoing(Register Eq_2 a0)
// Called from:
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
Eq_2 lld_util_instant_ongoing(Eq_2 a0)
{
	return (word32) ((word32) *((word32) a0 + 0x006D) != 0x00);
}

// 23030E52: Register uint32 lld_util_compute_ce_max(Register Eq_2 a0, Register Eq_151521 a1)
// Called from:
//      lld_move_to_master
//      lld_con_update_after_param_req
//      lld_move_to_slave
//      llc_llcp_start_enc_rsp_pdu_send
//      llcp_length_rsp_handler
//      llcp_length_req_handler
uint32 lld_util_compute_ce_max(Eq_2 a0, Eq_151521 a1)
{
	Eq_151522 a4_31;
	int32 a4_26;
	struct Eq_151524 * a3_7 = (word32) *((word32) a0 + 116);
	word32 a5_9 = (word32) *((word32) a0 + 0x0078) - (word32) (*((word32) a0 + 25));
	ui32 a6_21 = (word32) (word16) (word32) a3_7->w280080EE;
	if ((word32) *((word32) a0 + 0x007B) == 0x03)
		a4_26 = *(uint32 *) 0x28000000 >> 4 & 0x0F;
	else
	{
		a4_26 = (word32) (word16) (word32) a3_7->w280080FE;
		if ((int32) (word16) a4_26 < 0x00)
		{
			a4_31 = (a4_26 << 0x0011 >> 18) + 625;
l23030EBE:
			uint32 a5_44 = a5_9 + 0x0270 - a4_31;
			Eq_151572 a4_48 = (word32) a1 + 348;
			if ((a6_21 & 0x0200) != 0x00)
				a4_48 = (word32) a1 + 380;
			uint32 a5_56 = (word32) a4_48 + (a5_44 >> a4_48) - (a4_48 >> 0x01);
			uint32 a5_58 = a5_56 >> 625;
			if ((word32) (a5_56 >> 625) + ((word32) a4_48 - 625) > 0x0096)
				a5_58 = (a5_56 >> 625) + ~0x00;
			uint32 a1_65 = a5_58 << 0x10;
			a3_7->w28008104 = (word16) (a1_65 >> 16);
			struct Eq_151613 * a4_77 = (word32) *((word32) a0 + 116);
			uint32 a3_82 = (word32) a4_77->w28008102;
			if (a5_58 < a3_82)
				a4_77->w28008102 = (word16) (a1_65 >> 16);
			return a3_82;
		}
	}
	a4_31 = a4_26 >> 1;
	goto l23030EBE;
}

// 23030F2A: Register Eq_2 lld_util_priority_set(Register Eq_2 a0, Register up32 a1)
// Called from:
//      lld_evt_scan_create
//      lld_evt_move_to_master
//      lld_evt_move_to_slave
//      lld_evt_adv_create
//      lld_con_start
Eq_2 lld_util_priority_set(Eq_2 a0, up32 a1)
{
	if (a1 > 0x06)
	{
		word32 a5_8 = (word32) g_b230B4F0A;
		*((word32) a0 + 22) = (byte) a5_8;
		*((word32) a0 + 0x007D) = (byte) a5_8;
		return a0;
	}
	else
	{
		Eq_2 a0_20;
		g_t230B59FC();
		return a0_20;
	}
}

// 23030F88: Register (ptr32 Eq_151647) lld_util_get_tx_pkt_cnt(Register (ptr32 Eq_151647) a0)
// Called from:
//      llcp_pause_enc_req_handler
//      llcp_enc_req_handler
//      llc_pdu_acl_tx_ack_defer
//      hci_le_start_enc_cmd_handler
struct Eq_151647 * lld_util_get_tx_pkt_cnt(struct Eq_151647 * a0)
{
	return (word32) a0->b0070;
}

// 23030F8E: void lld_util_eff_tx_time_set(Register Eq_2 a0, Register Eq_151653 a1, Register uint32 a2)
// Called from:
//      lld_move_to_master
//      lld_move_to_slave
//      llcp_length_rsp_handler
//      llcp_length_req_handler
void lld_util_eff_tx_time_set(Eq_2 a0, Eq_151653 a1, uint32 a2)
{
	*((word32) a0 + 0x0068) = (word16) a1;
	*((word32) a0 + 0x006A) = (word16) a2;
}

// 23030F98: Register Eq_2 lld_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 (ptr32 Eq_151671)) a4, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg88, Stack Eq_2 dwArgD8, Register out (ptr32 Eq_128021) s0Out, Register out ptr32 s1Out)
// Called from:
//      rwble_init
//      rwble_reset
Eq_2 lld_init(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_151671 ** a4, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArg88, Eq_2 dwArgD8, struct Eq_128021 & s0Out, ptr32 & s1Out)
{
	byte bLoc13_349 = SLICE(s0, byte, 8);
	byte bLoc14_352 = (byte) s0;
	Eq_2 s1_11 = a0;
	if (a0 == 0x00)
	{
		word32 a0_383;
		word32 a3_384;
		word32 mstatus_385;
		word32 s0_382;
		ra = ble_ke_task_create(ra, s0, a0, 0x02, 0x230B5A18, out s0_382, out s1_11, out a0_383, out a3_384, out a4, out mstatus_385);
	}
	<anonymous> * a5_69;
	struct Eq_151671 * a5_31 = *a4;
	*(a4 & -0x00F1 | 224) = (struct Eq_151671 **) a5_31;
	a5_31->dw00F0 = a5_31->dw00F0 & -0x0200 | 0x00D2;
	a5_31->dw00F0 = a5_31->dw00F0 & ~0x03FF0000 | 0x01B80000;
	*(struct Eq_151671 **) 0x10000346 = a5_31;
	*(word32 *) 0x1000033A = *(word32 *) 0x1000033A;
	*(word32 *) 0x1000033A = *(word32 *) 0x1000033A;
	word32 a4_66;
	word32 a3_380;
	word32 a5_381;
	word32 a2_379;
	if (co_bdaddr_compare(0x230CB978, 0x4200F3E4, out a2_379, out a3_380, out a4_66, out a5_381) == 0x00)
		a5_69 = g_ptr4200F3D0;
	else
		a5_69 = g_ptr4200F3D4;
	Eq_2 ra_88;
	struct Eq_64398 * a2_95;
	ptr32 mstatus_99;
	a5_69();
	Eq_2 s4_112;
	Eq_2 s1_110 = ecc_gen_new_secret_key(0x42026513, 0x00, a2_95, dwArg18, out s4_112);
	(((word32) bLoc15 << 8 | (word32) bLoc16) << 16 | ((word32) bLoc17 << 8 | (word32) bLoc18))->dw0024 = 0x28000000;
	struct Eq_151929 * a5_133 = (word32) bLoc13_349 << 8 | (word32) bLoc14_352;
	a5_133->dw0028 = 0x28000000;
	struct Eq_151939 * a4_135 = a5_133->ptr0000;
	*(a5_133 | 0x0200) = (struct Eq_151939 **) a4_135;
	a4_135->dw0090 = 0x07;
	a4_135->dw00B0 = 510;
	a4_135->dw00B4 = 534;
	a4_135->dw00B8 = 0x0404;
	a4_135->dw0120 = 558;
	a4_135->dw0124 = 0x03;
	*(word16 *) 0x2800814C = ~0x0129;
	*(word16 *) 671121742 = 65161;
	*(word16 *) 0x28008150 = 0x0555;
	*(word16 *) 0x28008152 = 0x55;
	*(word16 *) 671121762 = 0x00;
	*(word16 *) 671121764 = 0x00;
	*(word16 *) 671121766 = 0x00;
	*(word16 *) 0x280081A8 = ~0x0129;
	*(word16 *) 0x280081AA = 65161;
	*(word16 *) 0x280081AC = 0x0555;
	*(word16 *) 0x280081AE = 0x55;
	*(word16 *) 0x280081BE = 0x00;
	*(word16 *) 0x280081C0 = 0x00;
	*(word16 *) 0x280081C2 = 0x00;
	*(word16 *) 0x28008168 = 0x00;
	*(word16 *) 671121770 = 0x00;
	*(word16 *) 0x280081C4 = 0x00;
	*(word16 *) 671121862 = 0x00;
	*(struct Eq_151939 **) 1018 = a4_135;
	*(uint16 *) 0x28008158 = (word16) (word32) g_b42025758;
	*(uint16 *) 0x2800814A = (word16) ((word32) *(uint16 *) 0x2800814A & 0x00FFFFFF | 0x02000000);
	*(uint16 *) 671121822 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 671121822 & -0x0081);
	*(uint16 *) 0x28008154 = 0x00;
	*(word16 *) 0x280081B4 = (word16) (word32) g_b42025758;
	*(uint16 *) 0x280081A6 = (word16) ((word32) *(uint16 *) 0x280081A6 & 0x00FFFFFF | 0x02000000);
	*(uint16 *) 671121914 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 671121914 & -0x0081);
	*(word16 *) 0x280081B0 = 0x00;
	*(uint16 *) 671121812 = 0x00;
	*(word16 *) 671121814 = 0x00;
	*(uint16 *) 671121816 = 0x00;
	*(word16 *) 671121818 = 0x00;
	*(word16 *) 0x2800819C = 0x00;
	*(word16 *) 0x280081F0 = 0x00;
	*(word16 *) 0x280081F2 = 0x00;
	*(word16 *) 0x280081F4 = 0x00;
	*(word16 *) 671121910 = 0x00;
	*(word16 *) 671121912 = 0x00;
	struct Eq_151758 * a5_152 = (struct Eq_151758 *) 0x28008000;
	do
	{
		a5_152->w0000 = 0x00;
		a5_152->w0002 = 0x00;
		++a5_152;
	} while (a5_152 != (struct Eq_151758 *) 0x28008040);
	word32 s0_243;
	word32 s1_244;
	word32 s2_245;
	word32 s3_246;
	struct Eq_128021 * s0_257;
	ptr32 s1_258;
	Eq_2 ra_256 = lld_sleep_init(lld_evt_init(ra_88, 0x28008000, s1_110, s1_110, s4_112, s5, mstatus_99, dwLoc08, dwArg88, dwArgD8, out s0_243, out s1_244, out s2_245, out s3_246), s0_243, s1_244, s2_245, s3_246, out s0_257, out s1_258);
	s0_257->w0146 = (word16) (word32) (word16) ((word32) (word16) (word32) s0_257->w0146 & -0x0101);
	s0_257->w0146 = (word16) (word32) (word16) ((word32) (word16) (word32) s0_257->w0146 & -0x0401);
	s0_257->w0146 = (word16) (word32) (word16) ((word32) (word16) (word32) s0_257->w0146 & -513);
	s0_257->w01A2 = (word16) (word32) (word16) ((word32) (word16) (word32) s0_257->w01A2 & -0x0101);
	s0_257->w01A2 = (word16) (word32) (word16) ((word32) (word16) (word32) s0_257->w01A2 & -0x0401);
	s0_257->w01A2 = (word16) (word32) (word16) ((word32) (word16) (word32) s0_257->w01A2 & -513);
	lld_wlcoex_set(0x01, (struct Eq_126631 *) 0x28008040);
	int32 a4_311 = *(int32 *) 0x280000E0;
	*(int32 *) 0x280000E0 = a4_311 & ~0x01000000;
	*(a4_311 & ~0x01000000 | 0x0100) = *(a4_311 & ~0x01000000);
	s0Out = s0_257;
	s1Out = s1_258;
	return ra_256;
}

