pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303126A: Register (ptr32 word32) lld_core_reset(Register (ptr32 word32) a4)
// Called from:
//      rwble_reset
word32 * lld_core_reset(word32 * a4)
{
	*(a4 & -0x0101) = *a4;
	word32 * a5_11 = *(a4 & -0x0101);
	*(a4 & -0x0101 | 0x80000000) = a5_11;
	do
		;
	while (a5_11 < null);
	word32 * a5_23 = a5_11 & ~0x40000000 | 0x40000000;
	*a5_23 = *a5_11;
	do
		;
	while (a5_23 << 0x01 < 0x00);
	struct Eq_152157 * a4_30 = (struct Eq_152157 *) 0x28008000;
	do
	{
		a4_30->w0000 = 0x00;
		a4_30->w0002 = 0x00;
		++a4_30;
	} while (a4_30 != (struct Eq_152157 *) 0x28008040);
	*(uint16 *) 0x28008146 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 0x28008146 & -0x0101);
	*(uint16 *) 0x28008146 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 0x28008146 & -0x0401);
	*(uint16 *) 0x28008146 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 0x28008146 & -513);
	*(uint16 *) 0x280081A2 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 0x280081A2 & -0x0101);
	*(uint16 *) 0x280081A2 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 0x280081A2 & -0x0401);
	uint32 a4_79 = ((word32) (word16) (word32) *(uint16 *) 0x280081A2 & -513) << 16;
	*(uint16 *) 0x280081A2 = (word16) (a4_79 >> 16);
	lld_wlcoex_set(0x01, a4_79 >> 16);
	*(word32 *) 0x2800000C = 0x00;
	((union Eq_2 *) 0x17)->u0 = 0x28000000;
	return (word32 *) ~0x00;
}

// 23031358: Register Eq_2 lld_adv_start(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_152259) a0, Register word32 a1, Register ptr32 a2, Register Eq_2 s7, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out (ptr32 Eq_152265) s1Out, Register out (ptr32 Eq_152265) a0Out, Register out (ptr32 Eq_152259) s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      llm_set_adv_en
Eq_2 lld_adv_start(Eq_2 ra, Eq_2 s0, struct Eq_152259 * a0, word32 a1, ptr32 a2, Eq_2 s7, word32 dwArg0128, ptr32 & s0Out, struct Eq_152265 & s1Out, struct Eq_152265 & a0Out, struct Eq_152259 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	int32 s7_130;
	struct Eq_152259 * s2_237 = a0;
	ptr32 s3_238 = a2;
	if ((word32) a0->b001C == 0x01)
	{
		s7_130 = 1500;
		if ((word32) a0->b0021 == 0x00)
		{
			a0->w0018 = 0xF800;
			s7_130 = 0x04E2;
		}
	}
	else
		s7_130 = 1500;
	struct Eq_152265 * a0_48;
	word32 s4_59;
	word32 mstatus_362;
	word32 s1_361;
	Eq_2 ra_232 = lld_evt_adv_create(ra, s0, 0x02, (word32) a0->w0018, s7, out s1_361, out a0_48, out s4_59, out mstatus_362);
	struct Eq_152265 * s1_249 = a0_48;
	if (a0_48 != null)
	{
		*(uint16 *) 0x2800814A = (word16) ((word32) (word16) (word32) *(uint16 *) 0x2800814A & ~0x1F | 2);
		uint32 a4_75 = (word32) g_b230CB972;
		ui32 a2_80 = a4_75 >> 0x01 & 1;
		ui32 a4_81 = a4_75 >> 2 & 0x01;
		ui32 a3_82 = 0x04;
		if ((word32) a0->b001C == 0x01)
			a3_82 = (word32) ((word32) a0->b0021 < 1) + 0x04;
		*(uint16 *) 0x28008146 = (word16) ((a4_75 & 1) << 0x0A | a3_82 | a2_80 << 0x09 | a4_81 << 8 | 0x0F000000);
		*(uint16 *) 0x28008154 = (word16) ((word32) a0->b001B << 8);
		*(uint16 *) 671121822 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 671121822 & -0x0081);
		*(uint16 *) 671121812 = 0x00;
		*(word16 *) 671121814 = 0x00;
		*(uint16 *) 671121816 = 0x00;
		*(word16 *) 671121818 = 0x00;
		*(word16 *) 0x2800819C = 0x00;
		<anonymous> * a5_120 = g_ptr4200F3D0;
		word32 s9_283;
		word32 t0_284;
		word32 s11_282;
		word32 s10_281;
		struct Eq_152408 * sp_132;
		struct Eq_152409 * s2_133;
		Eq_2 s3_134;
		word32 s4_135;
		Eq_2 s6_136;
		Eq_2 ra_137;
		struct Eq_152414 * s0_138;
		Eq_2 s1_139;
		word32 s7_141;
		ptr32 mstatus_152;
		a5_120();
		s0_138->w0172 = (word16) (word32) s2_133->b0020;
		s0_138->w0156 = 0x27;
		s0_138->w0152 = 0x55;
		s0_138->w015A = 0x00;
		s0_138->w0158 = (word16) (word32) (word16) s4_135;
		s0_138->w014A = (word16) ((word32) (word12) (word32) s0_138->w014A | 0x02000000);
		s0_138->w0148 = 0x00;
		s0_138->w0168 = 0x00;
		s0_138->w016A = 0x00;
		s0_138->w0160 = 0x08;
		*(word32 *) 0x28000090 = (word32) s2_133->b001A;
		*(word32 *) 0x280000A0 = s7_141;
		*((word32) s1_139 + 0x007C) = (byte) s4_135;
		word32 a3_363;
		Eq_2 s1_191;
		Eq_2 ra_190 = lld_pdu_tx_push(ra_137, s1_139, s1_139, s6_136, mstatus_152, out s1_191, out a3_363);
		if (s3_134 != 0x00)
		{
			word32 a3_375;
			ra_190 = lld_pdu_tx_push(ra_190, s1_191, s1_191, s3_134, mstatus_152, out s1_191, out a3_375);
		}
		Eq_128173 a3_212 = lld_pdu_tx_loop(mstatus_152);
		__csrrs(mstatus_152, 0x00);
		__csrrc(mstatus_152, 0x08);
		struct Eq_152513 * a5_228;
		ptr32 mstatus_231;
		word32 s7_371;
		word32 s10_374;
		word32 s8_372;
		word32 s9_373;
		word32 a3_367;
		word32 s6_370;
		word32 a4_368;
		word32 s4_369;
		word32 a0_366;
		word32 s0_364;
		word32 s1_365;
		ra_232 = lld_evt_elt_insert(ra_190, s1_191, a3_212, mstatus_152, sp_132->t0004, sp_132->t0010, sp_132->t0018, sp_132->t0058, sp_132->t0078, sp_132->t0098, sp_132->t009C, sp_132->t00C4, sp_132->t00E0, sp_132->t00E4, sp_132->t00EC, sp_132->t0108, out s0_364, out s1_365, out a0_366, out a3_367, out a4_368, out a5_228, out s2_237, out s3_238, out s4_369, out s5, out s6_370, out s7_371, out s8_372, out s9_373, out s10_374, out mstatus_231);
		s1_249 = a5_228->ptr0008;
		a5_228->ptr0058 = s1_249;
		((struct Eq_152265 *[]) 92)[(word32) (word27) ((char *) &a5_228->ptr0058 + 0x00FFF7A8) / 4] = s1_249;
		s1_249->w0060 = 0x00;
		__csrrw(mstatus_231, 0x00);
	}
	0x00 = dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_249;
	a0Out = s1_249;
	s2Out = s2_237;
	s3Out = s3_238;
	s5Out = s5;
	return ra_232;
}

// 23031514: Register Eq_2 lld_adv_stop(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      llm_set_adv_en
Eq_2 lld_adv_stop(Eq_2 ra, Eq_2 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	word32 a0_14;
	struct Eq_152616 * s0_24;
	ptr32 s1_25;
	ptr32 s2_28;
	ptr32 s3_29;
	ptr32 s5_31;
	word32 mstatus_95;
	word32 s8_94;
	word32 s7_93;
	word32 s6_92;
	word32 s4_91;
	word32 a3_90;
	Eq_2 ra_23 = lld_evt_elt_delete(ra, a0, a0, 0x01, 0x01, s2, mstatus, dwLoc08, dwArgD8, dwArg0118, out s0_24, out s1_25, out a0_14, out a3_90, out s2_28, out s3_29, out s4_91, out s5_31, out s6_92, out s7_93, out s8_94, out mstatus_95);
	if (a0_14 == 0x00)
	{
		ui32 a5_41 = (word32) s0_24->b007E;
		s0_24->b007E = (byte) (a5_41 | 16);
		*(a5_41 | 16 | 0x02000000) = *(a5_41 | 16);
	}
	s1Out = s1_25;
	s2Out = s2_28;
	s3Out = s3_29;
	s5Out = s5_31;
	return ra_23;
}

