pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23031548: Register Eq_2 lld_scan_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_152259) a0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Register out (ptr32 Eq_152679) s0Out, Register out (ptr32 Eq_152679) a0Out, Register out (ptr32 Eq_152259) s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      llm_set_scan_en
Eq_2 lld_scan_start(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_152259 * a0, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, struct Eq_152679 & s0Out, struct Eq_152679 & a0Out, struct Eq_152259 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	struct Eq_152259 * s2_11 = a0;
	ptr32 mstatus_28;
	Eq_2 ra_165 = lld_evt_scan_create(ra, s0, 0x03, out mstatus_28);
	struct Eq_152679 * s0_214 = (struct Eq_152679 *) 0x03;
	if (true)
	{
		word32 a5_38 = (word32) a0->w0004;
		ea_interval_duration_req(fp + -40, fp + -52, (struct Eq_130351 *) 0x00FF0003);
		word16 wLoc26_238 = (word16) a5_38;
		word16 wLoc28_239 = (word16) a5_38;
		word32 a0_62;
		struct Eq_145650 * a3_75;
		Eq_2 s1_77;
		word32 a2_329;
		word32 a5_330;
		Eq_2 s0_69 = ea_offset_req(fp + -40, fp + -52, out s1_77, out a0_62, out a2_329, out a3_75, out a5_330);
		if (a0_62 == 0x00)
		{
			*((word32) s0_69 + 0x0078) = (word16) (word32) wLoc26_238;
			lld_util_connection_param_set(s0_69, fp + -52, a3_75);
			*(uint16 *) 0x280081A6 = (word16) ((word32) (word16) (word32) *(uint16 *) 0x280081A6 & ~0x1F | 3);
			ui32 a3_120 = (word32) g_b230CB973;
			*(uint16 *) 0x280081A2 = (word16) (word32) (word16) ((a3_120 & 1) << 0x0A | (word32) (s1_77 != 0x00) + 0x08 | a3_120 << 0x08 & 0x0200 | a3_120 << 6 & 0x0100 | 0xFF000000);
			*(word16 *) 0x280081B2 = 0x27;
			*(word16 *) 0x280081AE = 0x55;
			*(union Eq_2 *) 0xA9 = s0_69;
			*(word16 *) 0x280081C4 = 0x00;
			*(word16 *) 671121862 = 0x00;
			*(word16 *) 671121828 = 0x00;
			*(uint16 *) 671121914 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 671121914 & -0x0081);
			*(word16 *) 0x280081F0 = 0x00;
			*(word16 *) 0x280081F2 = 0x00;
			*(word16 *) 0x280081F4 = 0x00;
			*(word16 *) 671121910 = 0x00;
			*(word16 *) 671121912 = 0x00;
			Eq_128173 a3_130 = 0xFF000000;
			Eq_2 dwLoc28_266 = SEQ(wLoc26_238, wLoc28_239);
			if (s1_77 != 0x00)
			{
				word32 s1_351;
				word32 a3_352;
				ra_165 = lld_pdu_tx_push(ra_165, s1_77, s0_69, s1_77, mstatus_28, out s1_351, out a3_352);
				a3_130 = lld_pdu_tx_loop(mstatus_28);
			}
			__csrrs(mstatus_28, 0x00);
			__csrrc(mstatus_28, 0x08);
			struct Eq_152867 * a4_190;
			uint32 a5_191;
			ptr32 mstatus_194;
			word32 s0_341;
			word32 s1_342;
			word32 a0_343;
			word32 a3_344;
			word32 s4_345;
			word32 s6_346;
			word32 s7_347;
			word32 s8_348;
			word32 s9_349;
			word32 s10_350;
			ra_165 = lld_evt_elt_insert(ra_165, s0_69, a3_130, mstatus_28, dwLoc3C, dwLoc30, dwLoc28_266, dwArg18, dwArg38, s1, ra, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_341, out s1_342, out a0_343, out a3_344, out a4_190, out a5_191, out s2_11, out s3, out s4_345, out s5, out s6_346, out s7_347, out s8_348, out s9_349, out s10_350, out mstatus_194);
			s0_214 = a4_190->ptr0008;
			s0_214->w0060 = 0x00;
			a4_190->ptr0058 = s0_214;
			((struct Eq_152679 *[]) 92)[(word32) (word27) (a4_190 + (a5_191 >> 625) / 92) / 4] = s0_214;
			__csrrw(mstatus_194, 0x00);
		}
		else
		{
			word32 s0_331;
			word32 s1_332;
			word32 a0_333;
			word32 a1_334;
			word32 a2_335;
			word32 a3_336;
			word32 a4_337;
			word32 s4_338;
			word32 s8_339;
			word32 mstatus_340;
			ra_165 = lld_evt_delete_elt_push(ra_165, s0_69, s0_69, 0x01, 0x00, mstatus_28, dwLoc30, out s0_331, out s1_332, out a0_333, out a1_334, out a2_335, out a3_336, out a4_337, out s4_338, out s8_339, out mstatus_340);
			s0_214 = null;
		}
	}
	s0Out = s0_214;
	a0Out = s0_214;
	s2Out = s2_11;
	s3Out = s3;
	s5Out = s5;
	return ra_165;
}

// 230316C0: Register Eq_2 lld_scan_stop(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out (ptr32 byte) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_move_to_master
//      llm_set_scan_en
//      hci_le_create_con_cancel_cmd_handler
Eq_2 lld_scan_stop(Eq_2 ra, Eq_2 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, byte & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	ptr32 a0_14;
	ptr32 mstatus_22;
	struct Eq_152930 * s0_24;
	ptr32 s1_25;
	byte * s2_28;
	ptr32 s3_29;
	ptr32 s4_30;
	ptr32 s5_31;
	ptr32 s6_32;
	ptr32 s7_33;
	ptr32 s8_34;
	ptr32 a3_17;
	Eq_2 ra_23 = lld_evt_elt_delete(ra, a0, a0, 0x01, 0x01, s2, mstatus, dwLoc08, dwArgD8, dwArg0118, out s0_24, out s1_25, out a0_14, out a3_17, out s2_28, out s3_29, out s4_30, out s5_31, out s6_32, out s7_33, out s8_34, out mstatus_22);
	if (a0_14 == 0x00)
	{
		ui32 a5_41 = (word32) s0_24->b007E;
		s0_24->b007E = (byte) (a5_41 | 16);
		*(a5_41 | 16 | 0x01000000) = *(a5_41 | 16);
		a3_17 = 0x01000000;
	}
	s1Out = s1_25;
	a0Out = a0_14;
	a3Out = a3_17;
	s2Out = s2_28;
	s3Out = s3_29;
	s4Out = s4_30;
	s5Out = s5_31;
	s6Out = s6_32;
	s7Out = s7_33;
	s8Out = s8_34;
	mstatusOut = mstatus_22;
	return ra_23;
}

// 230316F4: Register Eq_2 lld_con_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_152986) a1, Register Eq_2 a2, Register Eq_2 s3, Stack ptr32 dwArg0118, Register out ptr32 s1Out, Register out (ptr32 Eq_152991) a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      llm_create_con
Eq_2 lld_con_start(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, struct Eq_152986 * a1, Eq_2 a2, Eq_2 s3, ptr32 dwArg0118, ptr32 & s1Out, struct Eq_152991 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	ptr32 s3_240;
	ptr32 s2_239;
	struct Eq_152991 * s0_246;
	Eq_2 s2_212 = a0;
	Eq_2 s5_18 = a2;
	Eq_2 s1_47;
	Eq_2 a0_52;
	Eq_128173 a3_57;
	ptr32 mstatus_62;
	Eq_2 a0_70;
	word32 s8_959;
	word32 s8_963;
	word32 mstatus_960;
	word32 a4_961;
	word32 a6_962;
	word32 s0_954;
	word32 s4_958;
	word32 a3_955;
	word32 a4_956;
	word32 a6_957;
	Eq_2 s0_210;
	Eq_2 s1_211;
	Eq_2 s4_214;
	Eq_2 ra_209 = ea_elt_create(ea_elt_create(ra, s0, s1, 88, out s0_954, out s1_47, out a0_52, out a3_955, out a4_956, out a6_957, out s4_958, out s8_959, out mstatus_960), a0_52, s1_47, 88, out s0_210, out s1_211, out a0_70, out a3_57, out a4_961, out a6_962, out s4_214, out s8_963, out mstatus_62);
	if (s0_210 == 0x00)
	{
		word32 s5_974;
		word32 s8_975;
		word32 mstatus_976;
		word32 a3_969;
		word32 s4_973;
		word32 a4_970;
		word32 a5_971;
		word32 a6_972;
		word32 tp_964;
		word32 a2_968;
		word32 s1_965;
		word32 a0_966;
		word32 a1_967;
		ble_ke_free(ra_209, s0_210, s1_211, a0_70, a0, s3, s4_214, a2, out tp_964, out s0_246, out s1_965, out a0_966, out a1_967, out a2_968, out a3_969, out a4_970, out a5_971, out a6_972, out s2_239, out s3_240, out s4_973, out s5_974, out s8_975, out mstatus_976);
		goto l23031CD8;
	}
	Eq_2 a0_219;
	Eq_2 s3_213 = a0_70;
	if (a0_70 != 0x00)
	{
		*((word32) s0_210 + 24) = 0x0200;
		*((word32) s0_210 + 23) = 0x00;
		*((word32) s0_210 + 18) = ~0x063B;
		*((word32) a0_70 + 24) = 0x0200;
		*((word32) a0_70 + 23) = 0x00;
		((Eq_2[]) 709)[(word32) *((word32) a0 + 2) / 4] = s0_210;
		word32 s1_118;
		word32 a1_978;
		word32 tp_977;
		Eq_2 ra_117 = lld_evt_init_evt(ra_209, (word32) s0_210 + 40, mstatus_62, out tp_977, out s1_118, out a1_978);
		*((word32) s0_210 + 116) = (word16) s1_118;
		*((word32) s0_210 + 0x007B) = 0x01;
		*((word32) s0_210 + 0x0078) = (word16) (word32) *a0;
		((word32) s0_210 + 118)->u2 = 0x01A2;
		Eq_2 a0_130 = lld_util_priority_set(s0_210, 0x01);
		g_t2302DC32 = s0_210;
		g_t2302EB3A = s0_210;
		g_t2302DB0E = s0_210;
		*((word32) s0_210 + 16) = 0x00;
		word32 a5_979;
		(ea_time_get_halfslot_rounded(a0_130, a3_57, out a5_979) + ((word32) (*((word32) s0_210 + 25)) + 0x03) / 0x0C & 0x07FFFFFE)->t0008 = s0_210;
		ea_interval_duration_req(fp + -88, fp + -0x007C, (word32) *((word32) a0 + 24));
		uint32 s4_158 = (word32) a2 + 0x00EA << 16;
		Eq_2 a0_180;
		struct Eq_64398 * a2_185;
		Eq_2 s1_195;
		word32 a3_980;
		word32 a5_981;
		Eq_2 s0_187 = ea_offset_req(fp + -88, fp + -0x007C, out s1_195, out a0_180, out a2_185, out a3_980, out a5_981);
		if (a0_180 != 0x01)
		{
			Eq_2 a0_247;
			struct Eq_64398 * a2_248;
			word32 a3_993;
			word32 s8_997;
			word32 a4_994;
			word32 a5_995;
			word32 s4_996;
			word32 a1_992;
			bl_rand(a0_180, a2_185, out a0_247, out a1_992, out a2_248, out a3_993, out a4_994, out a5_995, out s4_996, out s8_997);
			((word16[]) 0x280082D6)[(word32) a1->w0004 / 2] = (word16) (((word32) *((word32) a0 + 5) & 0x01) << 7 | 0x02000225);
			word32 s8_283;
			word32 a5_1003;
			word32 s4_1004;
			word32 a0_998;
			word32 a4_1002;
			word32 a1_999;
			word32 a2_1000;
			word32 a3_1001;
			ui32 s1_311 = (word32) g_b420264A1 + 0x01 | bl_rand(a0_247, a2_248, out a0_998, out a1_999, out a2_1000, out a3_1001, out a4_1002, out a5_1003, out s4_1004, out s8_283);
			g_b420264A0 = (byte) ((word32) g_b420264A0 + 0x01);
			g_b420264A1 = (byte) s1_311;
			llm_util_get_channel_map();
			word32 s0_361;
			word32 s1_362;
			word32 s10_363;
			word32 s11_364;
			word32 s2_365;
			word32 s3_366;
			word32 s4_367;
			word32 s5_368;
			word32 s6_369;
			word32 s7_370;
			word32 s9_371;
			word32 ra_360 = lld_pdu_adv_pack(ra_117, fp + -112, fp + -0x007D, dwArg0118, out s0_361, out s1_362, out s2_365, out s3_366, out s4_367, out s5_368, out s6_369, out s7_370, out s9_371, out s10_363, out s11_364);
			<anonymous> * a5_376 = g_ptr4200F3D0;
			struct Eq_153344 * sp_381;
			struct Eq_153345 * s2_382;
			Eq_2 ra_384;
			Eq_2 s0_385;
			struct Eq_153348 * s5_386;
			Eq_2 s9_387;
			struct Eq_151094 * a2_388;
			Eq_2 s1_390;
			struct Eq_153352 * s3_391;
			word32 s4_392;
			word32 s6_393;
			word32 s7_394;
			word32 s8_395;
			ptr32 mstatus_404;
			word32 t5_409;
			word32 t6_410;
			word32 t2_411;
			a5_376();
			llm_util_apply_bd_addr((word32) s2_382->b000C, a2_388);
			*((word32) s0_385 + 4) = s3_391;
			struct Eq_145650 * a3_425;
			struct Eq_153374 * s1_429;
			Eq_2 ra_428 = lld_pdu_tx_push(ra_384, s1_390, s0_385, s9_387, mstatus_404, out s1_429, out a3_425);
			lld_util_connection_param_set(s0_385, &sp_381->t0004, a3_425);
			s1_429->w01A6 = (word16) ((word32) (word16) (word32) s1_429->w01A6 & ~0x1F | 3);
			ui32 a4_446 = (word32) g_b230CB974;
			s1_429->w01A2 = (word16) (word32) (word16) (a4_446 << 0x08 & 0x0200 | a4_446 << 0x06 & 0x0100 | (a4_446 & 0x01) << 0x0A | 0xFF00000F);
			s1_429->w01B0 = (word16) ((word32) s2_382->b000C << 1 & 0x04 | (word32) s2_382->b0004 << 8);
			s1_429->w01B2 = 0x27;
			s1_429->w01FA = (word16) (word32) (word16) ((word32) (word16) (word32) s1_429->w01FA & -0x0081);
			s1_429->w01F0 = 0x00;
			s1_429->w01F2 = 0x00;
			s1_429->w01F4 = 0x00;
			s1_429->w01F6 = 0x00;
			s1_429->w01F8 = 0x00;
			s1_429->w01A4 = 0x00;
			s1_429->w01C8 = (word16) ((word32) s2_382->b0007 << 8 | (word32) s2_382->b0006);
			s1_429->w01CA = (word16) ((word32) s2_382->b0009 << 8 | (word32) s2_382->b0008);
			s1_429->w01CC = (word16) ((word32) s2_382->b000B << 8 | (word32) s2_382->b000A);
			s1_429->w01CE = (word16) ((word32) s2_382->b0005 & 0x01);
			s1_429->w01AE = 0x55;
			up32 a5_505 = (word32) sp_381->w000C;
			if (a5_505 <= 0x05)
				sp_381->w000C = (word16) (a5_505 + ((word32) sp_381->w001A << 1));
			s5_386->w28008102 = (word16) (word32) (word16) (((word32) sp_381->w000C >> 1) + ~0x00);
			*(word16 *) 0x280081BE = (word16) ((word32) sp_381->t0004 >> 1);
			struct Eq_153576 * s1_536;
			word32 tp_1005;
			word32 a1_1006;
			Eq_2 ra_535 = lld_evt_init_evt(ra_428, &s3_391->dw0024 + 1, mstatus_404, out tp_1005, out s1_536, out a1_1006);
			word32 a4_538 = (word32) sp_381->w001C;
			ui32 a5_539 = (word32) sp_381->w001A;
			s3_391->w0074 = (word16) s5_386;
			s3_391->w005E = (word16) (a4_538 + 0x01);
			s3_391->b007B = 0x03;
			uint32 a5_548 = a5_539 << 0x0011 >> 16;
			struct Eq_153616 * a4_549 = (word32) sp_381->w000C & a5_548;
			s3_391->w0078 = (word16) a5_548;
			s3_391->w0076 = (word16) s4_392;
			Eq_2 s0_554 = a4_549->t0008;
			s3_391->dw0008 = (word32) (word27) (a4_549 - (a5_548 - a4_549));
			word32 a5_560 = (word32) s2_382->w0016;
			int32 a4_561 = 0x04E2;
			if (a5_560 != 0x00)
				a4_561 = (word32) (word16) (a5_560 + 625);
			word32 a5_568 = (word32) g_b230B4F06;
			s3_391->w0012 = (word16) a4_561;
			s3_391->b0016 = (byte) a5_568;
			s3_391->dw001C = s8_395;
			s3_391->dw0024 = s7_394;
			s3_391->dw0020 = s6_393;
			s1_536->w2800808E = 0x02;
			s1_536->w28008090 = 0x00;
			s1_536->w28008092 = (word16) (word32) (word16) ((word32) (word16) (word32) s1_536->w28008092 & -0x0101);
			s1_536->w28008092 = (word16) (word32) (word16) ((word32) (word16) (word32) s1_536->w28008092 & -513);
			s1_536->w28008092 = (word16) ((word32) (word12) (word32) s1_536->w28008092 | 0x02000000);
			s1_536->w28008094 = (word16) ((word32) sp_381->b0011 << 8 | (word32) sp_381->t0010);
			s1_536->w28008096 = (word16) ((word32) sp_381->b0013 << 8 | (word32) sp_381->b0012);
			s1_536->w28008098 = (word16) ((word32) sp_381->b0015 << 8 | (word32) sp_381->b0014);
			s1_536->w2800809A = (word16) (word32) sp_381->b0016;
			s1_536->w2800809E = (word16) ((word32) sp_381->b0025 << 8 & 0x01FFFF00 | 0x0C000000);
			s1_536->w280080A0 = (word16) (word32) g_b42025758;
			s1_536->w280080A8 = (word16) (word32) (word16) ((word32) s3_391->w0078 - (word32) s3_391->b0019);
			s1_536->w28008092 = (word16) ((word32) (word16) (word32) s1_536->w28008092 & ~0x1F | s5_386 & 31);
			s1_536->w280080B0 = 0x00;
			s1_536->w280080B2 = 0x00;
			s1_536->w280080E6 = (word16) (word32) (word16) ((word32) (word16) (word32) s1_536->w280080E6 & -0x0081);
			s1_536->w280080DC = 0x00;
			s1_536->w280080DE = 0x00;
			s1_536->w280080E0 = 0x00;
			s1_536->w280080E2 = 0x00;
			word32 a4_700 = (word32) sp_381->w0020;
			s1_536->w280080E4 = 0x00;
			s1_536->w280080AA = (word16) a4_700;
			s1_536->w280080AC = (word16) (word32) sp_381->w0022;
			Eq_128173 a3_712;
			s1_536->w280080AE = (word16) (word32) (word16) (llm_util_check_map_validity(&sp_381->w0020, 0x05, out a3_712) << 8 | (word32) sp_381->b0024);
			__csrrs(mstatus_404, 0x00);
			__csrrc(mstatus_404, 0x08);
			struct Eq_153911 * a4_737;
			uint32 a5_738;
			ptr32 mstatus_741;
			word32 a3_1010;
			word32 s4_1011;
			word32 s5_1012;
			word32 a0_1009;
			word32 s1_1008;
			word32 s0_1007;
			word32 s6_1013;
			word32 s7_1014;
			word32 s8_1015;
			word32 s9_1016;
			word32 s10_1017;
			lld_evt_elt_insert(ra_535, s0_554, a3_712, mstatus_404, sp_381->t0004, sp_381->t0010, sp_381->t0018, sp_381->t0058, sp_381->t0078, sp_381->t0098, sp_381->t009C, sp_381->t00C4, sp_381->t00E0, sp_381->t00E4, sp_381->t00EC, sp_381->t0108, out s0_1007, out s1_1008, out a0_1009, out a3_1010, out a4_737, out a5_738, out s2_239, out s3_240, out s4_1011, out s5_1012, out s6_1013, out s7_1014, out s8_1015, out s9_1016, out s10_1017, out mstatus_741);
			s0_246 = a4_737->ptr0008;
			a4_737->ptr0058 = s0_246;
			((struct Eq_152991 *[]) 92)[(word32) (word27) (a4_737 + (a5_738 >> 625) / 92) / 4] = s0_246;
			s0_246->w0060 = 0x01;
			s0_246->w0012 = 0x04E2;
			__csrrw(mstatus_741, 0x00);
l23031CD8:
			s1Out = dwArg0118;
			a0Out = s0_246;
			s2Out = s2_239;
			s3Out = s3_240;
			s5Out = s8;
			return dwArg0158;
		}
		word32 a5_988;
		word32 a6_989;
		word32 s8_990;
		word32 mstatus_991;
		word32 a1_984;
		word32 a4_987;
		word32 a2_985;
		word32 a3_986;
		word32 a0_983;
		word32 tp_982;
		ra_209 = ble_ke_free(ra_117, s0_187, s1_195, s0_187, a0, a0_70, s4_158 >> 0x10, a2, out tp_982, out s0_210, out s1_211, out a0_983, out a1_984, out a2_985, out a3_986, out a4_987, out a5_988, out a6_989, out s2_212, out s3_213, out s4_214, out s5_18, out s8_990, out mstatus_991);
		a0_219 = s3_213;
	}
	else
		a0_219 = s0_210;
	word32 tp_1018;
	word32 s0_1019;
	word32 s1_1020;
	word32 a0_1021;
	word32 a1_1022;
	word32 a2_1023;
	word32 a3_1024;
	word32 a4_1025;
	word32 a5_1026;
	word32 a6_1027;
	word32 s4_1028;
	word32 s5_1029;
	word32 s8_1030;
	word32 mstatus_1031;
	ble_ke_free(ra_209, s0_210, s1_211, a0_219, s2_212, s3_213, s4_214, s5_18, out tp_1018, out s0_1019, out s1_1020, out a0_1021, out a1_1022, out a2_1023, out a3_1024, out a4_1025, out a5_1026, out a6_1027, out s2_239, out s3_240, out s4_1028, out s5_1029, out s8_1030, out mstatus_1031);
	s0_246 = null;
	goto l23031CD8;
}

// 23031D12: Register Eq_2 lld_move_to_master(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Stack word32 dwArg0178, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_2 s8Out, Register out ptr32 s10Out)
// Called from:
//      llm_con_req_tx_cfm
Eq_2 lld_move_to_master(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArgA4, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, word32 dwArg0178, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_2 & s8Out, ptr32 & s10Out)
{
	Eq_2 a0_19;
	ptr32 mstatus_27;
	struct Eq_154067 * s0_29;
	struct Eq_154068 * s3_34;
	Eq_2 ra_28 = lld_evt_move_to_master(ra, s1, a0, s2, dwArg78, dwArgB8, dwArg0178, out s0_29, out a0_19, out s3_34, out mstatus_27);
	s3_34->w280080FA = (word16) (((word32) s0_29->w280083E0 >> 5 & 0x01) << 0x0E | (word32) s3_34->w280080FA & ~0x04000000);
	lld_util_eff_tx_time_set(a0_19, 328, 0x1B);
	lld_util_compute_ce_max(a0_19, 328);
	s3_34->w28008102 = (word16) (word32) (word16) (word32) s3_34->w28008104;
	s3_34->w280082D4 = (word16) ((word32) (word15) (word32) s3_34->w280082D4 | 0x08000000);
	s3_34->w280080EE = (word16) (word32) (word16) ((word32) (word16) (word32) s3_34->w280080EE & -0x0101);
	s3_34->w280080EE = (word16) (word32) (word16) ((word32) (word16) (word32) s3_34->w280080EE & -513);
	s3_34->w280080EE = (word16) (word32) (word16) ((word32) (word16) (word32) s3_34->w280080EE & -0x0401);
	s3_34->w280080F8 = 0x00;
	s3_34->w28008128 = 0x00;
	s3_34->w2800812A = 0x00;
	s3_34->w2800812C = 0x00;
	s3_34->w2800812E = 0x00;
	s3_34->w28008130 = 0x00;
	s3_34->w28008132 = 0x00;
	s3_34->w28008134 = 0x00;
	s3_34->w28008100 = 0x00;
	Eq_128173 a3_148 = (word32) s3_34->w280080EE;
	s3_34->w280080EE = (word16) (a3_148 & ~0x00FFF800);
	ptr32 a5_158;
	ptr32 s0_163;
	ptr32 s10_165;
	ptr32 s2_167;
	ptr32 s3_168;
	ptr32 s5_170;
	word32 s1_218;
	word32 a0_219;
	word32 a3_220;
	word32 a4_221;
	word32 s4_222;
	word32 s6_223;
	word32 s7_224;
	word32 s8_225;
	word32 s9_226;
	word32 mstatus_227;
	Eq_2 ra_162 = lld_evt_elt_insert(ra_28, a0_19, a3_148, mstatus_27, dwLoc1C, dwLoc10, dwLoc08, dwArg38, dwArg58, dwArg78, dwArg7C, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_163, out s1_218, out a0_219, out a3_220, out a4_221, out a5_158, out s2_167, out s3_168, out s4_222, out s5_170, out s6_223, out s7_224, out s8_225, out s9_226, out s10_165, out mstatus_227);
	s0Out = s0_163;
	a0Out = s2_167;
	a5Out = a5_158;
	s2Out = s2_167;
	s3Out = s3_168;
	s4Out = dwArg04;
	s5Out = s5_170;
	s8Out = dwLoc1C;
	s10Out = s10_165;
	return ra_162;
}

// 23031E70: void lld_con_update_req(Register Eq_2 ra, Register word32 s0, Register word32 a0, Register Eq_2 a1)
void lld_con_update_req(Eq_2 ra, word32 s0, word32 a0, Eq_2 a1)
{
	byte bLoc14_96 = (byte) s0;
	word32 a5_15 = (word32) *((word32) a1 + 18);
	word32 a4_17 = (word32) *((word32) a1 + 6);
	uint32 a3_26 = (word32) *((word32) a1 + 16) << 0x0011 >> 16;
	uint32 a2_27 = (word32) *((word32) a1 + 0x0E) << 0x0011 >> 16;
	((word32) *((word32) a1 + 0x0A) + 0x01 & ~0x01) >= 0x02;
	struct Eq_154292 * s1_52;
	struct Eq_154293 * a0_65;
	struct Eq_154294 * s0_51 = lld_evt_update_create(ra, a1, a0, a2_27, a3_26, a4_17, a5_15, fp + ~0x17, out s1_52, out a0_65);
	s1_52->w0008 = (word16) (word32) s0_51->w0008;
	s1_52->w0004 = (word16) ((word32) a0_65->w0078 >> 1);
	s1_52->w0006 = (word16) (word32) s0_51->w0006;
	s1_52->b0001 = (byte) (word32) bLoc14_96;
	s1_52->w0002 = (word16) (word32) wLoc18;
	s1_52->w000A = (word16) (word32) wLoc16;
}

