pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23031EF0: void lld_con_update_after_param_req(Register Eq_2 ra, Register word32 a0, Register (ptr32 Eq_154348) a1, Register Eq_2 a2, Register word32 a3, Register Eq_2 a4, Register word32 s6)
void lld_con_update_after_param_req(Eq_2 ra, word32 a0, struct Eq_154348 * a1, Eq_2 a2, word32 a3, Eq_2 a4, word32 s6)
{
	byte bLoc3A_380 = (byte) (word32) ((word32) *((word32) a2 + 22) != 0xF0000001);
	ea_interval_duration_req(fp + -72, fp + -84, a0 + 0x00EA);
	Eq_2 s0_108 = a4;
	Eq_2 s1_116 = a2;
	if ((word32) *((word32) a2 + 22) != 0x0FFFFFFF)
	{
		(word32) *((word32) a2 + 20) >= (word32) a1->w0060;
		lld_util_get_local_offset();
	}
	if ((word32) bLoc3A_380 == 0x01)
	{
		word32 a0_101;
		word32 a2_534;
		word32 a3_535;
		word32 a5_536;
		s0_108 = ea_offset_req(fp + -72, fp + -84, out s1_116, out a0_101, out a2_534, out a3_535, out a5_536);
		if (a0_101 != 0x00)
		{
			word32 a0_121;
			word32 a2_538;
			word32 a3_539;
			word32 a5_540;
			s0_108 = ea_offset_req(fp + -72, fp + -84, out s1_116, out a0_121, out a2_538, out a3_539, out a5_540);
			if (a0_121 != 0x00)
			{
				if (s0_108 == 0x00)
					return;
l23031FC0:
				word32 a3_155;
				word32 a4_156;
				word32 s0_162;
				word32 s1_163;
				word32 s4_164;
				word32 s8_165;
				word32 a0_168;
				word32 a6_541;
				word32 mstatus_542;
				Eq_2 ra_161 = ea_elt_create(ra, s0_108, s1_116, 88, out s0_162, out s1_163, out a0_168, out a3_155, out a4_156, out a6_541, out s4_164, out s8_165, out mstatus_542);
				if (a0_168 != 0x00)
				{
					up32 a5_241;
					<anonymous> * a5_173 = g_ptr4200F3D0;
					struct Eq_154409 * sp_194;
					struct Eq_154410 * s2_197;
					ui32 s3_198;
					struct Eq_154412 * s5_199;
					Eq_2 ra_200;
					Eq_2 s7_203;
					word32 t5_218;
					word32 t6_219;
					word32 t2_221;
					ptr32 mstatus_222;
					a5_173();
					struct Eq_154419 * s1_229;
					word32 tp_230;
					word32 a1_537;
					lld_evt_init_evt(ra_200, (word32) s7_203 + 40, mstatus_222, out tp_230, out s1_229, out a1_537);
					uint32 a1_232 = (word32) sp_194->w000C;
					*((word32) s7_203 + 94) = (word16) ((word32) s1_229->w0006 + 0x01);
					*((word32) s7_203 + 0x007B) = 0x03;
					*((word32) s7_203 + 0x0078) = (word16) a1_232;
					ui32 a0_238 = (word32) s1_229->w0016;
					if (a0_238 == 0x0FFFFFFF)
					{
						uint32 a0_244 = lld_util_get_peer_offset((word32) sp_194->w0014, a1_232, s5_199->ptr0008);
						a5_241 = (word32) s5_199->w0060;
						a0_238 = (word32) (word16) (a0_244 >> 1);
					}
					else
						a5_241 = (word32) s1_229->w0014;
					ui32 s0_278;
					uint32 a4_261 = (word32) s5_199->w005E + 0x07 << 16;
					word32 s0_256 = (word32) s5_199->w0078;
					word32 s6_263 = (word32) s5_199->w0060 + ~0x00 + (a4_261 >> 16);
					ui32 a0_260 = a0_238 << 1;
					uint32 a4_268 = s5_199->ptr0008 + (((a4_261 >> 16) + ~0x00) + s0_256) / 0x0C;
					ui32 a3_272 = (word32) *((word32) s7_203 + 0x0078);
					if ((word32) (word16) s6_263 < a5_241)
						s0_278 = a5_241 - (word32) ((word16) s6_263) + s0_256 + a0_260;
					else
						s0_278 = a3_272 - ((((word32) ((word16) s6_263) - a5_241) + s0_256) - a0_260 | a3_272);
					uint32 s0_289 = (word32) (word16) (s0_278 | a3_272);
					*((word32) s7_203 + 8) = (word32) (word27) (s0_289 + (word32) ((word27) a4_268));
					s5_199->t0004 = s7_203;
					struct Eq_154517 * a5_303 = *((char *) &g_t42026428 + s3_198 * 0x04);
					s5_199->w005C = (word16) (word32) (word16) s6_263;
					s5_199->b006D = 0x01;
					lld_util_compute_ce_max(s7_203, (word32) a5_303->w004E);
					struct Eq_154538 * a5_318 = (word32) s5_199->w0074;
					a5_318->w28008102 = (word16) (word32) (word16) (word32) a5_318->w28008104;
					s2_197->w0008 = (word16) (word32) s1_229->w0008;
					s2_197->w0004 = (word16) ((word32) *((word32) s7_203 + 0x0078) >> 1);
					word32 a5_339 = (word32) s1_229->w0006;
					s2_197->b0001 = 0x01;
					s2_197->w0002 = (word16) (s0_289 >> 1);
					s2_197->w0006 = (word16) a5_339;
					s2_197->w000A = (word16) (word32) (word16) s6_263;
				}
				return;
			}
		}
	}
	goto l23031FC0;
}

// 23032162: Register Eq_2 lld_con_param_rsp(Register Eq_2 a2, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      llcp_con_param_req_handler
//      hci_le_rem_con_param_req_reply_cmd_handler
Eq_2 lld_con_param_rsp(Eq_2 a2, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ea_interval_duration_req(fp + -40, fp + -52, (struct Eq_130351 *) 92);
	struct Eq_154696 * s1_52 = *((word32) a2 + 8);
	if ((word32) *((word32) a2 + 22) != 0x0FFFFFFF)
	{
		(word32) *((word32) a2 + 20) >= (word32) s1_52->w0060;
		lld_util_get_local_offset();
	}
	ptr32 a0_82;
	struct Eq_146217 * a2_87;
	word32 a5_214;
	word32 a3_213;
	Eq_2 s1_109;
	Eq_2 s0_89 = ea_offset_req(fp + -40, fp + -52, out s1_109, out a0_82, out a2_87, out a3_213, out a5_214);
	ptr32 s2_100 = a0_82;
	if (a0_82 == 0x00)
	{
		word32 a4_102 = (word32) *((word32) s0_89 + 22);
		*((word32) s0_89 + 18) = 0x00;
		uint32 a1_101 = (word32) wLoc34;
		*((word32) s0_89 + 0x0E) = (word16) (a1_101 >> 0x01);
		*((word32) s0_89 + 16) = (word16) (a1_101 >> 0x01);
		if (a4_102 == 0x0FFFFFFF)
		{
			s1_109 = a2_87->t0008;
			((word32) s0_89 + 22)->u2 = (word16) (lld_util_get_peer_offset((word32) wLoc2C, a1_101, a2_87) >> 1);
			*((word32) s0_89 + 20) = (word16) (word32) *((word32) s1_109 + 96);
		}
		*((word32) s0_89 + 24) = ~0x00;
		((word32) s0_89 + 26)->u0 = ~0x00;
		*((word32) s0_89 + 28) = ~0x00;
		((word32) s0_89 + 30)->u2 = ~0x00;
		((word32) s0_89 + 32)->u0 = ~0x00;
	}
	else
		s2_100 = 0x1F;
	s1Out = s1_109;
	a0Out = s2_100;
	s2Out = s2_100;
	s4Out = dwArgF4;
	s8Out = dwArgD4;
	return s0_89;
}

// 23032290: void lld_con_param_req(Register (ptr32 Eq_154806) a2)
void lld_con_param_req(struct Eq_154806 * a2)
{
	word16 wLoc26_109 = (word16) ((word32) a2->w0004 << 1);
	(word32) a2->w000A != 0x00;
	uint32 a1_75;
	word16 wLoc1C_119 = (word16) (ea_interval_duration_req(fp + -40, fp + -52, (struct Eq_130351 *) 92) & (word32) wLoc34);
	word32 a0_57;
	struct Eq_146217 * a2_62;
	word32 a5_143;
	word32 a3_142;
	word32 s1_141;
	Eq_2 s0_64 = ea_offset_req(fp + -40, fp + -52, out s1_141, out a0_57, out a2_62, out a3_142, out a5_143);
	word32 a5_74 = (word32) wLoc1C_119;
	if (a0_57 == 0x00)
		a1_75 = (word32) wLoc34;
	else
		a1_75 = (word32) wLoc26_109;
	uint32 a4_78 = a1_75 >> 0x01;
	*((word32) s0_64 + 0x0E) = (word16) a4_78;
	*((word32) s0_64 + 16) = (word16) a4_78;
	Eq_2 s1_83 = a2_62->t0008;
	*((word32) s0_64 + 22) = (word16) (lld_util_get_peer_offset(a5_74, a1_75, a2_62) >> 1);
	*((word32) s0_64 + 18) = 0x00;
	*((word32) s0_64 + 20) = (word16) ((word32) *((word32) s1_83 + 96) + 0x02);
	*((word32) s0_64 + 24) = ~0x00;
	((word32) s0_64 + 26)->u0 = ~0x00;
	*((word32) s0_64 + 28) = ~0x00;
	((word32) s0_64 + 30)->u2 = ~0x00;
	((word32) s0_64 + 32)->u0 = ~0x00;
}

// 2303236A: Register Eq_2 lld_con_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg10, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_util_dicon_procedure
Eq_2 lld_con_stop(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg10, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	ptr32 a4_14;
	ptr32 mstatus_17;
	ptr32 s1_20;
	ptr32 s4_21;
	word32 s0_30;
	word32 a0_31;
	word32 a1_32;
	word32 a2_33;
	word32 a3_34;
	word32 s8_35;
	Eq_2 ra_18 = lld_evt_delete_elt_push(ra, s0, a0, 0x01, 0x01, mstatus, dwArg10, out s0_30, out s1_20, out a0_31, out a1_32, out a2_33, out a3_34, out a4_14, out s4_21, out s8_35, out mstatus_17);
	s1Out = s1_20;
	a4Out = a4_14;
	s4Out = s4_21;
	mstatusOut = mstatus_17;
	return ra_18;
}

// 23032372: Register Eq_2 lld_get_mode(Register Eq_2 a0)
// Called from:
//      llc_le_con_cmp_evt_send
//      llc_con_update_finished
//      llc_map_update_finished
//      llcp_terminate_ind_handler
//      llc_llcp_reject_ind
//      llcp_pause_enc_req_handler
//      llcp_enc_req_handler
//      llcp_unknown_rsp_handler
//      llcp_start_enc_rsp_handler
//      llcp_con_param_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
//      llcp_con_param_req_handler
//      llc_llcp_feats_req_pdu_send
//      llcp_slave_feature_req_handler
//      llm_enc_ind_handler
//      llc_enc_mgt_ind_handler
//      llc_end_evt_defer
//      hci_le_rem_con_param_req_reply_cmd_handler
//      hci_le_start_enc_cmd_handler
//      hci_le_con_update_cmd_handler
Eq_2 lld_get_mode(Eq_2 a0)
{
	Eq_2 a0_12;
	struct Eq_154950 * a5_13;
	if (a0 == 0x02)
		a5_13 = g_ptr420264A8;
	else if (a0 == 0x03)
		a5_13 = g_ptr420264B4;
	else
	{
		struct Eq_154961 * a5_11 = *((char *) &g_t42026428 + a0 * 0x04);
		a0_12.u0 = 0x08;
		if (a5_11 == null)
			return a0_12;
		a5_13 = a5_11->ptr0010;
	}
	a0_12.u0 = 0x08;
	if (a5_13 != null)
		a0_12 = (word32) a5_13->b007B;
	return a0_12;
}

