pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230323B0: Register Eq_2 lld_move_to_slave(Register Eq_2 ra, Register (ptr32 Eq_145805) a0, Register (ptr32 Eq_154979) a1, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_154982) a4, Register Eq_2 s2, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out, Register out ptr32 s10Out)
// Called from:
//      llm_con_req_ind
Eq_2 lld_move_to_slave(Eq_2 ra, struct Eq_145805 * a0, struct Eq_154979 * a1, Eq_2 a2, Eq_2 a3, struct Eq_154982 * a4, Eq_2 s2, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out, ptr32 & s10Out)
{
	*((word32) a3 + 0x280080EA) = 0x03;
	((word32) a3 + 671122132)->u2 = (word16) (word32) (word16) ((word32) (word15) (word32) *((word32) a3 + 671122132) | 0xF8000000);
	((word32) a3 + 0x280080FA)->u2 = (word16) (word32) (word16) (((word32) a4->w280083E0 >> 5 & 0x01) << 0x0E | (word32) a1->b0021 << 8 & 0x01FFFF00 | 0xF8000000);
	*((word32) a3 + 0x280080F0) = (word16) ((word32) a1->b000D << 8 | (word32) a1->b000C);
	*((word32) a3 + 0x280080F2) = (word16) ((word32) a1->b000F << 8 | (word32) a1->b000E);
	*((word32) a3 + 0x280080F4) = (word16) ((word32) a1->b0011 << 8 | (word32) a1->b0010);
	*((word32) a3 + 0x280080F6) = (word16) (word32) a1->b0012;
	*((word32) a3 + 671121660) = (word16) (word32) g_b42025758;
	((word32) a3 + 0x280080EE)->u2 = (word16) ((word32) (word12) (word32) *((word32) a3 + 0x280080EE) | 0x02000000);
	((word32) a3 + 0x280080EE)->u2 = (word16) ((word32) (word16) (word32) *((word32) a3 + 0x280080EE) & ~0x1F | a3 & 31);
	*((word32) a3 + 0x28008106) = (word16) (word32) a1->w001C;
	*((word32) a3 + 0x28008108) = (word16) (word32) a1->w001E;
	Eq_2 a3_121;
	*((word32) a3 + 0x2800810A) = (word16) (word32) (word16) (llm_util_check_map_validity(&a1->w001C, 0x05, out a3_121) << 8 | (word32) a1->b0020);
	((word32) a3 + 0x280080EE)->u2 = (word16) (word32) (word16) ((word32) (word16) (word32) *((word32) a3 + 0x280080EE) & -0x0101);
	((word32) a3 + 0x280080EE)->u2 = (word16) (word32) (word16) ((word32) (word16) (word32) *((word32) a3 + 0x280080EE) & -513);
	((word32) a3 + 0x280080EE)->u2 = (word16) (word32) (word16) ((word32) (word16) (word32) *((word32) a3 + 0x280080EE) & -0x0401);
	*((word32) dwArg74 + 0x2800809C) = 0x00;
	((word32) a3 + 0x28008142)->u2 = (word16) (word32) (word16) ((word32) (word16) (word32) *((word32) a3 + 0x28008142) & -0x0081);
	*((word32) dwArg74 + 0x280080DC) = 0x00;
	*((word32) dwArg74 + 0x280080DE) = 0x00;
	*((word32) dwArg74 + 0x280080E0) = 0x00;
	*((word32) dwArg74 + 0x280080E2) = 0x00;
	*((word32) dwArg74 + 671121636) = 0x00;
	Eq_2 a0_187;
	ptr32 mstatus_195;
	int32 s0_197;
	struct Eq_155245 * s1_198;
	uint16 * s2_211;
	Eq_2 ra_196 = lld_evt_move_to_slave(ra, dwArg74, a0, a2, a3_121, dwArg78, out s0_197, out s1_198, out a0_187, out s2_211, out mstatus_195);
	lld_util_eff_tx_time_set(a0_187, 328, 0x1B);
	Eq_128173 a3_225 = lld_util_compute_ce_max(a0_187, 328);
	s1_198->a00A6[s0_197 / 2] = (word16) (word32) (word16) (word32) (s1_198->a00A6 + 1)[s0_197 / 2];
	s1_198->a00B0[s0_197 / 2] = 0x00;
	s1_198->a00B2[s0_197 / 2] = 0x00;
	s1_198->a00CC[s0_197 / 2] = 0x00;
	s1_198->a00CE[s0_197 / 2] = 0x00;
	s1_198->a00D0[s0_197 / 2] = 0x00;
	s1_198->a00D2[s0_197 / 2] = 0x00;
	s1_198->a00D4[s0_197 / 2] = 0x00;
	s1_198->a00D6[s0_197 / 2] = 0x00;
	s1_198->a00D8[s0_197 / 2] = 0x00;
	s1_198->a00A4[s0_197 / 2] = 0x00;
	*s2_211 = (word16) ((word32) *s2_211 & ~0x00FFF800);
	ptr32 a5_281;
	ptr32 s10_288;
	ptr32 s2_290;
	ptr32 s3_291;
	ptr32 s4_292;
	ptr32 s5_293;
	word32 s0_344;
	word32 s1_345;
	word32 a0_346;
	word32 a3_347;
	word32 a4_348;
	word32 s6_349;
	word32 s7_350;
	word32 s8_351;
	word32 s9_352;
	word32 mstatus_353;
	Eq_2 ra_285 = lld_evt_elt_insert(ra_196, a0_187, a3_225, mstatus_195, a3, s2, dwLoc18, dwArg28, dwArg48, dwArg68, dwArg6C, dwArg94, dwArgB0, dwArgB4, dwArgBC, dwArgD8, out s0_344, out s1_345, out a0_346, out a3_347, out a4_348, out a5_281, out s2_290, out s3_291, out s4_292, out s5_293, out s6_349, out s7_350, out s8_351, out s9_352, out s10_288, out mstatus_353);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	a0Out = s3_291;
	a5Out = a5_281;
	s2Out = s2_290;
	s3Out = s3_291;
	s4Out = s4_292;
	s5Out = s5_293;
	s8Out = dwArg58;
	s10Out = s10_288;
	return ra_285;
}

// 2303265C: Register word32 lld_ch_map_ind(Register Eq_2 s1, Register (ptr32 Eq_155377) a0, Register word32 a1, Stack word32 dwArg28)
// Called from:
//      llcp_channel_map_ind_handler
word32 lld_ch_map_ind(Eq_2 s1, struct Eq_155377 * a0, word32 a1, word32 dwArg28)
{
	a0->b006D = 0x02;
	ui32 a5_6 = (word32) a0->b007E;
	word32 a3_7 = (word32) a0->w0060;
	a0->w005C = (word16) a1;
	a0->b007E = (byte) (a5_6 | 1);
	if (a3_7 != (word32) ((word16) (a1 + -1)))
	{
		if (a3_7 != a1)
			return s2;
		word32 s2_31 = llc_map_update_ind(s1, (word32) a0->w0074, dwArg28);
		a0->b007E = (byte) ((word32) a0->b007E | 8);
		return s2_31;
	}
	else
	{
		a0->b007E = (byte) (a5_6 | 9);
		return s2;
	}
}

// 230326B6: Register Eq_2 lld_con_update_ind(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg38, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      llcp_con_upd_ind_handler
Eq_2 lld_con_update_ind(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 dwArg38, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s4Out)
{
	ptr32 s1_20;
	ptr32 s2_21;
	ptr32 s4_22;
	Eq_2 ra_19 = lld_evt_slave_update(ra, a1, a0, dwArg38, out s1_20, out s2_21, out s4_22);
	s1Out = s1_20;
	s2Out = s2_21;
	s4Out = s4_22;
	return ra_19;
}

// 230326C0: Register Eq_2 lld_crypt_isr(Register Eq_2 ra, Register Eq_2 s0, Stack Eq_2 dwArg10, Register out Eq_128610 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      rwble_isr
Eq_2 lld_crypt_isr(Eq_2 ra, Eq_2 s0, Eq_2 dwArg10, union Eq_128610 & s0Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	ptr32 a0_7;
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 mstatus_13;
	Eq_128610 s0_16;
	word32 t1_23;
	word32 a1_24;
	word32 a2_25;
	word32 a5_26;
	Eq_2 ra_14 = ble_ke_event_set(ra, s0, 0x01, dwArg10, out t1_23, out s0_16, out a0_7, out a1_24, out a2_25, out a3_10, out a4_11, out a5_26, out mstatus_13);
	s0Out = s0_16;
	a0Out = a0_7;
	a3Out = a3_10;
	a4Out = a4_11;
	mstatusOut = mstatus_13;
	return ra_14;
}

// 230326C6: Register word32 lld_test_mode_tx(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s3, Register Eq_2 s4, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 a0Out, Register out ptr32 s5Out)
// Called from:
//      llm_test_mode_start_tx
word32 lld_test_mode_tx(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s3, Eq_2 s4, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & a0Out, ptr32 & s5Out)
{
	Eq_2 a0_26;
	ptr32 mstatus_33;
	Eq_151156 s4_37;
	Eq_2 s1_112;
	Eq_2 ra_34 = lld_evt_adv_create(ra, s0, 0x02, 0x01, s3, out s1_112, out a0_26, out s4_37, out mstatus_33);
	*((word32) a0_26 + 0x007B) = 0x02;
	*(int32 *) 0x280000E0 = *(int32 *) 0x280000E0 & ~0x00FFF800 | 0x00FFF800;
	*(word16 *) 0x28008184 = 0x00;
	*(word16 *) 0x28008186 = 0x00;
	*(word16 *) 0x28008188 = 0x00;
	*(uint16 *) 0x28008146 = 0x1C;
	*(word16 *) 0x2800814C = 0x0129;
	*(word16 *) 671121742 = 0x0176;
	*(uint16 *) 0x28008158 = (word16) ((word32) (word16) (word32) *(uint16 *) 0x28008158 & -0x0100 | 0x0F);
	*(word16 *) 0x28008148 = 0x00;
	*(uint16 *) 671121822 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 671121822 & -0x0081);
	*(uint16 *) 0x2800814A = (word16) ((word32) (word16) (word32) *(uint16 *) 0x2800814A & ~0x1F | 2);
	*(uint16 *) 671121812 = 0x00;
	*(word16 *) 671121814 = 0x00;
	*(uint16 *) 671121816 = 0x00;
	*(word16 *) 671121818 = 0x00;
	*(word16 *) 0x2800819C = 0x00;
	*(uint16 *) 0x28008156 = (word16) (word32) (word16) (lld_util_freq2chnl(s4_37) | (word32) ((word16) ((word32) (*((uint16 *) 0x28008156)))) & -64);
	if (s1_112 != 0x00)
	{
		if (s1_112 == 0x04)
		{
			*(uint16 *) 0x280081A0 = (word16) ((word32) (word16) (word32) *(uint16 *) 0x280081A0 & -49 | 16);
			s1_112.u0 = 0x03;
		}
		else if (s1_112 == 0x03)
			*(uint16 *) 0x280081A0 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 0x280081A0 & -49);
		s1_112 = (byte) s1_112.u0 - 1 & 0x00FF | (word32) ((word16) ((word32) (*((uint16 *) 0x280081A0)))) & ~0x03;
		*(uint16 *) 0x280081A0 = (word16) s1_112;
	}
	word32 s1_173;
	ptr32 s2_176;
	ptr32 s5_179;
	word32 mstatus_267;
	word32 s9_265;
	word32 s10_266;
	word32 s7_263;
	word32 s8_264;
	word32 s4_261;
	word32 s6_262;
	word32 a5_259;
	word32 s3_260;
	word32 a3_257;
	word32 a4_258;
	word32 s0_255;
	word32 a0_256;
	word32 s1_253;
	word32 a3_254;
	lld_evt_elt_insert(lld_pdu_tx_push(ra_34, s1_112, a0_26, a0, mstatus_33, out s1_253, out a3_254), a0_26, lld_pdu_tx_loop(mstatus_33), mstatus_33, s4, dwLoc10, dwLoc08, dwArg38, dwArg58, dwArg78, dwArg7C, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_255, out s1_173, out a0_256, out a3_257, out a4_258, out a5_259, out s2_176, out s3_260, out s4_261, out s5_179, out s6_262, out s7_263, out s8_264, out s9_265, out s10_266, out mstatus_267);
	a0Out = s2_176;
	s5Out = s5_179;
	return s1_173;
}

