pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23032820: Register Eq_2 lld_test_mode_rx(Register Eq_2 ra, Register Eq_2 s0, Register Eq_151156 a0, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack word32 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgF8, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      llm_test_mode_start_rx
Eq_2 lld_test_mode_rx(Eq_2 ra, Eq_2 s0, Eq_151156 a0, Eq_2 dwArg00, Eq_2 dwArg08, word32 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgB4, Eq_2 dwArgD0, Eq_2 dwArgD4, Eq_2 dwArgDC, Eq_2 dwArgF8, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	struct Eq_155713 * a0_18;
	word32 s1_210;
	word32 s4_211;
	word32 mstatus_212;
	Eq_2 ra_26 = lld_evt_adv_create(ra, s0, 0x02, 0x01, ra, out s1_210, out a0_18, out s4_211, out mstatus_212);
	a0_18->b007B = 0x02;
	*(int32 *) 0x280000E0 = *(int32 *) 0x280000E0 & ~0x08000000 | 0x08000000;
	*(uint16 *) 0x2800818A = 0x00;
	*(word16 *) 0x2800818C = 0x00;
	*(word16 *) 0x2800818E = 0x00;
	*(uint16 *) 0x28008146 = 0x1D;
	*(word16 *) 0x2800815A = 0x4B;
	g_b4202645D = (byte) (*(union Eq_137626 *) 0x280001AC & 63);
	Eq_137626 a4_62 = *(union Eq_137626 *) 0x280001AC & -64 | 0x0F;
	*(union Eq_137626 *) 0x280001AC = a4_62;
	g_b4202645C = (byte) (a4_62 >> 28);
	*(word32 *) 4060242040 = g_dw42026078;
	struct Eq_155778 * a4_79 = *(int32 *) 0x40002850 & ~0x30000000 | 0x10000000;
	*(struct Eq_155778 **) 0x40003850 = a4_79;
	*(a4_79 & ~0x08000000) = a4_79->dw0000;
	*(word16 *) 0x2800814C = 0x0129;
	*(word16 *) 671121742 = 0x0176;
	*(word16 *) 0x28008148 = 0x00;
	*(word16 *) 0x28008168 = 0xFF;
	*(word16 *) 671121770 = 0x00;
	*(uint16 *) 671121822 = (word16) (word32) (word16) ((word32) (word16) (word32) *(uint16 *) 671121822 & -0x0081);
	*(uint16 *) 0x2800814A = (word16) ((word32) (word16) (word32) *(uint16 *) 0x2800814A & ~0x1F | 2);
	*(uint16 *) 671121812 = 0x00;
	*(word16 *) 671121814 = 0x00;
	*(uint16 *) 671121816 = 0x00;
	*(word16 *) 671121818 = 0x00;
	*(word16 *) 0x2800819C = 0x00;
	*(uint16 *) 0x28008156 = (word16) (word32) (word16) (lld_util_freq2chnl(a0) | (word32) ((word16) ((word32) (*((uint16 *) 0x28008156)))) & -64);
	<anonymous> * a5_124 = g_ptr42025730;
	Eq_128173 a3_128;
	Eq_2 ra_132;
	Eq_2 s1_134;
	ptr32 mstatus_140;
	ptr32 s3_184;
	ptr32 s5_185;
	a5_124();
	ptr32 s1_158;
	ptr32 s2_161;
	word32 s0_213;
	word32 a0_214;
	word32 a3_215;
	word32 a4_216;
	word32 a5_217;
	word32 s3_218;
	word32 s4_219;
	word32 s5_220;
	word32 s6_221;
	word32 s7_222;
	word32 s8_223;
	word32 s9_224;
	word32 s10_225;
	word32 mstatus_226;
	Eq_2 ra_156 = lld_evt_elt_insert(ra_132, s1_134, a3_128, mstatus_140, s0, dwArg00, dwArg08, dwArg48, dwArg68, dwArg88, dwArg8C, dwArgB4, dwArgD0, dwArgD4, dwArgDC, dwArgF8, out s0_213, out s1_158, out a0_214, out a3_215, out a4_216, out a5_217, out s2_161, out s3_218, out s4_219, out s5_220, out s6_221, out s7_222, out s8_223, out s9_224, out s10_225, out mstatus_226);
	0x00 = dwArg38;
	s1Out = s1_158;
	a0Out = s1_158;
	s2Out = s2_161;
	s3Out = s3_184;
	s5Out = s5_185;
	return ra_156;
}

// 23032974: Register Eq_2 lld_test_stop(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_155911) a5)
// Called from:
//      hci_le_test_end_cmd_handler
Eq_2 lld_test_stop(Eq_2 ra, Eq_2 s0, struct Eq_155911 * a5)
{
	word32 s0_9 = a5->dw0000;
	*(a5 | 0x04000000) = s0_9;
	<anonymous> * a5_15 = g_ptr42025730;
	struct Eq_155924 * s0_17;
	Eq_2 ra_18;
	a5_15();
	s0_17->dw00E0 = 0x00;
	return ra_18;
}

// 230329A0: Register Eq_2 llm_util_bd_addr_wl_position(Register Eq_2 ra, Register Eq_2 a0, Register Eq_155932 a1, Stack Eq_2 dwArg0128, Register out (ptr32 byte) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      llm_util_bd_addr_in_wl
//      llm_util_bl_add
//      llm_wl_dev_add
//      llm_wl_dev_rem
Eq_2 llm_util_bd_addr_wl_position(Eq_2 ra, Eq_2 a0, Eq_155932 a1, Eq_2 dwArg0128, byte & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 s5_155;
	ptr32 s2_151;
	ptr32 s1_116;
	ptr32 sp_3 = fp + -48;
	Eq_2 s3_153 = a0;
	struct Eq_155950 * s4_24 = &g_t4200F000;
	word32 s0_115 = 0x00;
	ptr32 s6_157 = 0x06;
	if ((a1 & 0x01) == 0x00)
	{
		s2_151 = 671121918;
		s5_155 = 0x04;
		do
		{
			word32 s0_90;
			s4_24->ptr03D0();
			word32 a2_206;
			word32 a5_209;
			word32 a3_207;
			word32 a4_208;
			if (co_bdaddr_compare(sp_3 + 8, s3_153, out a2_206, out a3_207, out a4_208, out a5_209) != 0x00)
				goto l230329F2;
			s0_115 = s0_90 + 0x01;
		} while (s0_90 + 0x01 != s5_155);
	}
	else
	{
		s2_151 = 0x28008216;
		s5_155 = 0x04;
		do
		{
			word32 s0_47;
			s4_24->ptr03D0();
			word32 a2_210;
			word32 a5_213;
			word32 a3_211;
			word32 a4_212;
			if (co_bdaddr_compare(sp_3 + 8, s3_153, out a2_210, out a3_211, out a4_212, out a5_213) != 0x00)
				goto l230329F2;
			s0_115 = s0_47 + 0x01;
		} while (s0_47 + 0x01 != s5_155);
	}
	s1_116 = 0x04;
l230329F2:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_116;
	a0Out = s1_116;
	s2Out = s2_151;
	s3Out = s3_153;
	s4Out = dwArg78;
	s5Out = s5_155;
	s6Out = s6_157;
	return ra;
}

// 23032A36: void llm_util_check_address_validity(Register Eq_2 a0)
void llm_util_check_address_validity(Eq_2 a0)
{
	word32 a5_31;
	word32 a4_30;
	word32 a3_29;
	word32 a2_28;
	co_bdaddr_compare(a0, 0x230CB978, out a2_28, out a3_29, out a4_30, out a5_31) == 0x00;
}

// 23032A54: Register Eq_2 llm_util_check_map_validity(Register Eq_2 a0, Register Eq_141654 a1, Register out Eq_141654 a3Out)
// Called from:
//      llc_map_update_ind
//      lld_con_start
//      lld_move_to_slave
//      hci_le_set_host_ch_class_cmd_handler
Eq_2 llm_util_check_map_validity(Eq_2 a0, Eq_141654 a1, union Eq_141654 & a3Out)
{
	ui32 a5_5 = (word32) *a0;
	Eq_2 a5_22 = a5_5 & 0x00F8;
	if ((a5_5 & 0x00F8) != 0x00)
	{
		a5_22.u0 = 0x00;
		if (a1 == 0x01)
			goto l23032A74;
	}
	int32 a4_10 = 0x00;
	while (true)
	{
		a3 = a4_10 & 0x00FF;
		if (a3 >= a1)
			break;
		int32 a6_19 = (word32) *((word32) a0 + a4_10);
		if (a3 == 0x04)
		{
			a3 = a6_19 & 224;
			if ((a6_19 & 224) != 0x00)
			{
				a5_22.u0 = 38;
				break;
			}
		}
		word32 a3_23 = 0x00;
		do
		{
			++a3_23;
			a5_22 = (byte) a5_22.u0 + (a6_19 >> a3_23 & 0x01) & 0x00FF;
		} while (a3_23 != 0x08);
		++a4_10;
	}
l23032A74:
	a3Out = a3;
	return a5_22;
}

// 23032AA8: Register (ptr32 Eq_151092) llm_util_apply_bd_addr(Register (ptr32 Eq_151092) a0, Register (ptr32 Eq_151094) a2)
// Called from:
//      lld_con_start
//      llm_set_adv_en
//      llm_set_scan_en
struct Eq_151092 * llm_util_apply_bd_addr(struct Eq_151092 * a0, struct Eq_151094 * a2)
{
	ui32 a1_10;
	struct Eq_151092 * a0_11;
	if (a0 != (struct Eq_151092 *) 0x01 && a0 != (struct Eq_151092 *) 0x03)
	{
		a1_10 = 0x00;
		a0_11 = &g_t420264C1;
	}
	else
	{
		a1_10 = 0x01;
		a0_11 = &g_t420264BB;
	}
	lld_util_set_bd_address(a0_11, a1_10, a2);
	return a0_11;
}

// 23032ACE: Register uint32 llm_util_check_evt_mask(Register uint32 a0)
// Called from:
//      llc_le_con_cmp_evt_send
//      llc_start
//      llc_feats_rd_event_send
//      llc_con_update_ind
//      llm_le_adv_report_ind
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_length_rsp_handler
//      llcp_con_param_rsp_handler
//      llcp_con_param_req_handler
//      llcp_length_req_handler
//      llc_enc_mgt_ind_handler
//      lld_stop_ind_handler
//      llm_ecc_result_ind_handler
//      hci_le_con_update_cmd_handler
uint32 llm_util_check_evt_mask(uint32 a0)
{
	return (word32) (a0 >> 0x03)->b42026498 >> a0 - ((a0 >> 0x03) << 3) & 0x01;
}

// 23032AEC: void llm_util_get_channel_map()
// Called from:
//      llc_start
//      lld_con_start
//      llc_chnl_assess_timer_handler
void llm_util_get_channel_map()
{
	g_ptr4200F3D0();
}

// 23032B00: void llm_util_get_supp_features()
// Called from:
//      llc_start
//      llc_llcp_feats_req_pdu_send
//      llc_llcp_feats_rsp_pdu_send
void llm_util_get_supp_features()
{
	g_ptr4200F3D0();
}

// 23032B14: Register Eq_2 llm_util_adv_data_update(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s4Out)
// Called from:
//      lld_evt_schedule
Eq_2 llm_util_adv_data_update(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s5, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s4Out)
{
	if (a0 != 0x00)
	{
		Eq_2 a0_15;
		struct Eq_156107 * a5_17;
		Eq_2 s1_20;
		Eq_2 s4_27;
		word32 * a5_41;
		word32 tp_162;
		word32 s0_163;
		word32 a2_164;
		word32 a3_165;
		word32 mstatus_166;
		ra = ble_ke_msg_free(llm_set_adv_data(ra, (word32) a0 + 0x0C, out s1_20, out a0_15, out a5_17, out s4_27), a5_17->t0014, s1_20, a0_15, s2, s3, s4_27, s5, out tp_162, out s0_163, out s1, out a0, out a2_164, out a3_165, out a4, out a5_41, out s2, out s3, out s4, out s5, out mstatus_166);
		*a5_41 = 0x00;
	}
	if (a0 != 0x00)
	{
		Eq_2 a0_63;
		struct Eq_156157 * a5_65;
		Eq_2 s1_68;
		Eq_2 s4_75;
		struct Eq_156160 * a5_89;
		word32 tp_167;
		word32 s0_168;
		word32 a0_169;
		word32 a2_170;
		word32 a3_171;
		word32 s2_172;
		word32 s3_173;
		word32 s5_174;
		word32 mstatus_175;
		ra = ble_ke_msg_free(llm_set_scan_rsp_data(ra, (word32) a0 + 0x0C, out s1_68, out a0_63, out a5_65, out s4_75), a5_65->t0014, s1_68, a0_63, s2, s3, s4_75, s5, out tp_167, out s0_168, out s1, out a0_169, out a2_170, out a3_171, out a4, out a5_89, out s2_172, out s3_173, out s4, out s5_174, out mstatus_175);
		a5_89->dw0004 = 0x00;
	}
	s1Out = s1;
	a4Out = a4;
	s4Out = s4;
	return ra;
}

// 23032B62: Register word32 llm_util_bl_check(Register Eq_2 a0, Register Eq_155932 a1, Register word32 a3, Stack Eq_2 dwArg74, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_156216) s2Out, Register out ptr32 s3Out)
// Called from:
//      llm_util_bd_addr_in_wl
//      llm_con_req_ind
//      llm_wl_dev_add_hdl
//      llm_wl_dev_rem_hdl
//      llm_create_con
//      hci_le_wl_mngt_cmd_handler
word32 llm_util_bl_check(Eq_2 a0, Eq_155932 a1, word32 a3, Eq_2 dwArg74, Eq_2 dwArg94, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_156216 & s2Out, ptr32 & s3Out)
{
	Eq_2 s0_21 = g_t42026478;
	while (true)
	{
		ptr32 a0_143;
		if (s0_21 == 0x00)
			break;
		if (a0 == 0x00 && a3 == 0x01)
			*((word32) s0_21 + 0x0D) = 0x00;
		else
		{
			s0_21 = dwArg74;
			byte * a4_42;
			word32 a2_169;
			word32 a5_170;
			if (co_bdaddr_compare(a0, (word32) s0_21 + 4, out a2_169, out a3, out a4_42, out a5_170) != 0x00 && (word32) (*((word32) dwArg74 + 0x0C)) == (a1 & 1))
			{
				if (dwArg94 != 0x00)
					*dwArg94 = (word16) (word32) *((word32) dwArg74 + 0x0A);
				if (a3 == 0x01)
					*((word32) dwArg74 + 0x0D) = 0x00;
				else if (a3 == 0x02)
					*((word32) dwArg74 + 0x0D) = 0x01;
				a0_143 = 11;
				if (a4_42 != null)
					*a4_42 = (byte) (word32) *((word32) dwArg74 + 0x0D);
				goto l23032BD2;
			}
		}
		s0_21 = *s0_21;
	}
	a0_143 = 0x00;
l23032BD2:
	0x00 = (int8) dwArg0128;
	s1Out = a0;
	a0Out = a0_143;
	s2Out = a1 & 1;
	s3Out = 0x01;
	return dwArgE4;
}

