pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23032BEC: Register Eq_2 llm_util_bd_addr_in_wl(Register Eq_2 ra, Register Eq_2 a0, Register Eq_155932 a1, Register (ptr32 byte) a2, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_155932 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      llm_wl_dev_add_hdl
//      llm_wl_dev_rem_hdl
Eq_2 llm_util_bd_addr_in_wl(Eq_2 ra, Eq_2 a0, Eq_155932 a1, byte * a2, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_155932 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	byte bLoc11_105 = 0x00;
	if (a2 != null)
		*a2 = 0x00;
	word32 a0_29;
	Eq_155932 s2_127;
	ptr32 s3_128;
	Eq_2 s1_126;
	Eq_2 s0_124 = llm_util_bl_check(a0, a1, 0x00, dwArg54, dwArg74, dwArg0108, out s1_126, out a0_29, out s2_127, out s3_128);
	if (a0_29 == 11 && s0_124 != 0x00)
		*s0_124 = 0x01;
	if (true)
	{
		up32 a0_53;
		word32 s4_146;
		word32 s6_147;
		ra = llm_util_bd_addr_wl_position(ra, s1_126, s2_127, dwArg0108, out s0_124, out s1_126, out a0_53, out s2_127, out s3_128, out s4_146, out s5, out s6_147);
		if (a0_53 <= 0x03)
			bLoc11_105 = 0x01;
	}
	s0Out = s0_124;
	s1Out = s1_126;
	a0Out = (word32) bLoc11_105;
	s2Out = s2_127;
	s3Out = s3_128;
	s5Out = s5;
	return ra;
}

// 23032C4E: Register Eq_2 llm_util_bl_add(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register ptr32 a0, Register Eq_155932 a2, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_155932 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      llm_con_req_ind
//      llm_con_req_tx_cfm
Eq_2 llm_util_bl_add(Eq_2 ra, Eq_2 s0, Eq_2 s1, ptr32 a0, Eq_155932 a2, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_155932 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	ptr32 s3_116 = a0;
	Eq_155932 s2_115 = a2;
	word32 a0_24;
	word32 s4_36;
	word32 s0_177;
	word32 a3_178;
	word32 a4_179;
	word32 a5_180;
	word32 a6_181;
	word32 s8_182;
	word32 mstatus_183;
	Eq_2 s1_100;
	Eq_2 ra_113 = ble_ke_malloc(ra, s0, s1, 0x10, 0x00, out s0_177, out s1_100, out a0_24, out a3_178, out a4_179, out a5_180, out a6_181, out s4_36, out s8_182, out mstatus_183);
	ptr32 s0_103 = 0x07;
	if (a0_24 != 0x00)
	{
		<anonymous> * a5_42 = g_ptr4200F3D0;
		struct Eq_156403 * sp_48;
		Eq_2 s3_49;
		Eq_155932 s4_50;
		struct Eq_156406 * s0_53;
		word32 s2_54;
		Eq_2 ra_55;
		word32 s5_140;
		word32 tp_142;
		a5_42();
		s0_53->w000A = (word16) s2_54;
		s0_53->b000C = (byte) (s4_50 & 1);
		Eq_156421 a0_72;
		Eq_2 s0_80;
		Eq_2 s1_81;
		word32 s4_184;
		word32 s5_185;
		word32 s6_186;
		Eq_2 ra_79 = llm_util_bd_addr_wl_position(ra_55, s3_49, s4_50, sp_48->t0128, out s0_80, out s1_81, out a0_72, out s2_115, out s3_116, out s4_184, out s5_185, out s6_186);
		*((word32) s0_80 + 0x0D) = (byte) (word32) (a0_72 < 4);
		word32 a0_187;
		word32 a5_188;
		ra_113 = ble_co_list_push_back(ra_79, s0_80, s1_81, 0x42026478, s0_80, out s1_100, out a0_187, out a5_188);
		s0_103 = 0x00;
		if ((word32) *((word32) s0_80 + 0x0D) != 0x00)
		{
			word32 s5_189;
			ra_113 = llm_wl_dev_rem(ra_113, s1_100, s2_115, sp_48->t0118, out s1_100, out s2_115, out s3_116, out s5_189, out s6);
		}
	}
	s0Out = s1;
	s1Out = s1_100;
	a0Out = s0_103;
	s2Out = s2_115;
	s3Out = s3_116;
	s4Out = dwArg04;
	s6Out = s6;
	return ra_113;
}

// 23032CD0: Register Eq_2 llm_util_bl_rem(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out Eq_2 s5Out)
// Called from:
//      llc_stop
Eq_2 llm_util_bl_rem(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg0108, union Eq_2 & s1Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s4Out, union Eq_2 & s5Out)
{
	Eq_2 a5_12 = 0x42026000;
	Eq_2 s0_10 = g_t42026478;
	while (s0_10 != 0x00)
	{
		a5_12 = (word32) *((word32) s0_10 + 0x0A);
		if (a5_12 == a0)
		{
			word32 a4_157;
			Eq_2 s0_29;
			word32 a3_156;
			word32 s8_158;
			word32 a2_155;
			word32 a0_154;
			Eq_2 s1_30;
			Eq_2 s2_31;
			Eq_2 s4_32;
			Eq_2 ra_28 = ble_co_list_extract(ra, s0_10, s1, 0x42026478, s0_10, 0x00, s2, out s0_29, out s1_30, out a0_154, out a2_155, out a3_156, out a4_157, out s2_31, out s4_32, out s8_158);
			if ((word32) *((word32) s0_29 + 0x0D) != 0x00)
				ra_28 = llm_wl_dev_add(ra_28, (word32) *((word32) s0_29 + 0x0C), dwArg0108, out s1_30, out s2_31, out s3, out s4_32, out s5);
			word32 tp_159;
			word32 s0_160;
			word32 a0_161;
			word32 a1_162;
			word32 a2_163;
			word32 a3_164;
			word32 a4_165;
			word32 a6_166;
			word32 s3_167;
			word32 s8_168;
			word32 mstatus_169;
			ra = ble_ke_free(ra_28, s0_29, s1_30, s0_29, s2_31, s3, s4_32, s5, out tp_159, out s0_160, out s1, out a0_161, out a1_162, out a2_163, out a3_164, out a4_165, out a5_12, out a6_166, out s2, out s3_167, out s4, out s5, out s8_168, out mstatus_169);
			break;
		}
		s0_10 = *s0_10;
	}
	s1Out = s1;
	a5Out = a5_12;
	s2Out = s2;
	s4Out = s4;
	s5Out = s5;
	return ra;
}

// 23032D22: Register Eq_2 llm_end_evt_defer(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_deffered_elt_handler
Eq_2 llm_end_evt_defer(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArgE8, Eq_2 dwArgF8, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ui32 a0_9;
	struct Eq_156579 * a1_10;
	word32 s8_392;
	word32 a4_391;
	word32 s0_390;
	Eq_2 ra_113 = ble_ke_state_get(ra, s0, 0x00, out s0_390, out a0_9, out a1_10, out a4_391, out s8_392);
	Eq_2 s0_122 = 0x42026460;
	if ((a0_9 & 0x00F0) == 0x10)
	{
		s0_122 = a1_10->t0014;
		if ((word32) a1_10->b001C == 0x01 && (word32) a1_10->b0021 == 0x00)
		{
			<anonymous> * a5_26 = g_ptr4200F3D0;
			struct Eq_156622 * sp_30;
			Eq_2 ra_33;
			struct Eq_156624 * a5_34;
			word32 t0_297;
			word32 s7_295;
			word32 s6_294;
			word32 s10_292;
			word32 s11_293;
			word32 a7_290;
			word32 tp_289;
			word32 a6_285;
			word32 t1_298;
			word32 t4_299;
			a5_26();
			Eq_2 s0_41 = a5_34->t0014;
			sp_30->b001A = (byte) (word32) a5_34->b0020;
			Eq_2 a0_49;
			ptr32 mstatus_65;
			Eq_2 s0_88;
			Eq_2 s1_89;
			ui32 a0_95;
			Eq_2 s0_100;
			word32 s8_404;
			word32 a3_401;
			word32 a4_402;
			word32 s4_403;
			word32 a0_398;
			word32 a1_399;
			word32 a2_400;
			word32 s2_395;
			word32 s3_396;
			word32 s4_397;
			word32 s0_393;
			word32 s1_394;
			word32 mstatus_405;
			word32 a1_406;
			word32 a4_407;
			word32 s8_408;
			word32 a0_409;
			word32 a2_410;
			word32 a4_411;
			word32 a5_412;
			word32 s4_413;
			word32 mstatus_414;
			ra_113 = ble_ke_state_set(ble_ke_state_get(lld_evt_delete_elt_push(llc_le_con_cmp_evt_send(ra_33, s0_41, s1, 60, 0x00, (char *) &sp_30->t0004 + 8, s5, sp_30->dw0000, sp_30->t0004, sp_30->t0010, sp_30->t0014, sp_30->dw0028, sp_30->t0038, sp_30->t0048, sp_30->dw0088, sp_30->t0108, out s0_393, out s1_394, out a0_49, out s2_395, out s3_396, out s4_397, out s5, out mstatus_65), *((word32) a0_49 + 72), a0_49, 0x01, 0x00, mstatus_65, sp_30->t0010, out s0_88, out s1_89, out a0_398, out a1_399, out a2_400, out a3_401, out a4_402, out s4_403, out s8_404, out mstatus_405), s0_88, 0x00, out s0_100, out a0_95, out a1_406, out a4_407, out s8_408), s0_100, s1_89, 0x00, a0_95 & 0x0F, sp_30->t0108, out s0_122, out s1, out a0_409, out a2_410, out a4_411, out a5_412, out s2, out s3, out s4_413, out mstatus_414);
		}
	}
	if ((word32) *((word32) s0_122 + 90) != 0x03 && (word32) (*((word32) s0_122 + 89)) != 0x00)
	{
		Eq_2 a0_141;
		struct Eq_155778 ** a4_145;
		Eq_2 s0_151;
		Eq_2 s2_153;
		Eq_2 s3_154;
		Eq_2 s4_155;
		word32 s1_415;
		word32 a1_416;
		word32 a2_417;
		word32 a3_418;
		word32 a6_419;
		word32 a7_420;
		word32 s8_421;
		word32 mstatus_422;
		Eq_2 ra_150 = ble_ke_msg_alloc(ra_113, s0_122, s1, 0x00FFF801, 0x00, 0x0200001F, 0x04, s2, s3, dwArgF8, out s0_151, out s1_415, out a0_141, out a1_416, out a2_417, out a3_418, out a4_145, out a6_419, out a7_420, out s2_153, out s3_154, out s4_155, out s8_421, out mstatus_422);
		((word32) s0_151 + 89)->u0 = 0x00;
		struct Eq_155778 * a5_161 = *a4_145;
		*(a4_145 & ~0x00040000) = (struct Eq_155778 **) a5_161;
		if ((word32) *((word32) s0_151 + 90) == 0x01)
		{
			struct Eq_156843 * a3_170 = (word32) g_b4202645D;
			a5_161->dw01AC = a5_161->dw01AC & -64 | a3_170;
			((word32) g_b4202645C << 28 | (word32) ((word28) a3_170))->dw0078 = a3_170->dw0078;
			a5_161 = *(int32 *) 0x40002850 & ~0x30000000 | 0x20000000;
			*(struct Eq_155778 **) 0x40003850 = a5_161;
		}
		*(a5_161 & ~0x08000000 | 0x08000000) = a5_161->dw0000;
		word32 a5_201 = 0x00;
		if ((word32) *((word32) s0_151 + 90) != 0x00)
			a5_201 = (word32) (word16) (word32) *(uint16 *) 0x2800818A;
		*((word32) a0_141 + 2) = (word16) a5_201;
		((word32) s0_151 + 90)->u0 = 0x03;
		*a0_141 = 0x00;
		Eq_2 s0_237;
		Eq_2 s1_238;
		Eq_2 s2_241;
		Eq_2 s3_242;
		word32 tp_423;
		word32 a0_424;
		word32 a2_425;
		word32 a3_426;
		word32 a4_427;
		word32 s4_428;
		word32 s6_429;
		word32 s7_430;
		word32 s10_431;
		word32 mstatus_432;
		word32 t1_433;
		word32 s0_434;
		word32 s1_435;
		word32 a0_436;
		word32 a3_437;
		word32 a4_438;
		word32 a6_439;
		word32 a7_440;
		ra_113 = ble_ke_msg_send_basic(hci_send_2_host(ra_150, s0_151, a0_141, s2_153, s3_154, s4_155, s5, dwLoc20, s0, dwArg08, out tp_423, out s0_237, out s1_238, out a0_424, out a2_425, out a3_426, out a4_427, out s2_241, out s3_242, out s4_428, out s5, out s6_429, out s7_430, out s9, out s10_431, out mstatus_432), s0_237, s1_238, 0x01, 0x00, 0x00, s2_241, s3_242, dwLoc20, dwArg08, dwArgE8, out t1_433, out s0_434, out s1_435, out a0_436, out a3_437, out a4_438, out a6_439, out a7_440, out s2, out s3, out s4, out mstatus);
	}
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra_113;
}

