pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23032E60: Register Eq_2 llm_pdu_defer(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_148921 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s3, Register ptr32 s4, Register ptr32 s5, Register ptr32 s6, Register Eq_2 s7, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack word32 dwArgF8, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_148921 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      lld_pdu_check
Eq_2 llm_pdu_defer(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_148921 a0, Eq_2 a1, Eq_2 a2, Eq_2 s3, ptr32 s4, ptr32 s5, ptr32 s6, Eq_2 s7, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, word32 dwArgF8, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_148921 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	ptr32 s0_108;
	Eq_148921 s2_112 = a0;
	Eq_2 s1_109 = a1;
	int32 a0_19;
	word32 s8_25;
	word32 a4_259;
	word32 a1_258;
	word32 s0_257;
	Eq_2 ra_107 = ble_ke_state_get(ra, s0, 0x00, out s0_257, out a0_19, out a1_258, out a4_259, out s8_25);
	if ((a0_19 & 0x0F) == 0x02)
	{
		if ((a0 & 3) == 0x00)
		{
			s0_108 = 0x00;
			if (a2 != 0x00)
			{
				ra_107 = llm_con_req_tx_cfm(ra_107, 0x00, a1, a1, a0, s3, s4, dwLoc08, dwLoc04, dwArg38, dwArg40, dwArg44, dwArg4C, dwArg58, s1, dwArg88, dwArg98, dwArgA8, dwArgF8, out s1_109, out s2_112, out s3, out s6);
				s0_108 = 0x01;
			}
			goto l23032E92;
		}
		if (a0_19 == 35)
		{
			s0_108 = 0x00;
l23032E92:
			em_buf_rx_free(s1_109);
			s0Out = s0_108;
			s1Out = s1_109;
			a0Out = s0_108;
			s2Out = s2_112;
			s3Out = s3;
			s4Out = dwArg04;
			s6Out = s6;
			return ra_107;
		}
	}
	else
	{
		s0_108 = 0x00;
		if (a0_19 == 35 || a0_19 == 0x00)
			goto l23032E92;
	}
	s0_108 = 0x00;
	if (a0_19 != 36 && (a0 & 31) == 0x00)
	{
		ui32 a5_46 = (word32) *((word32) a1 + 0x280083E0);
		if ((a5_46 & 0x0F) <= 0x06)
		{
			ui32 a5_50 = 0x01 << (a5_46 & 0x0F);
			if ((a5_50 & 87) == 0x00)
			{
				if ((a5_50 & 32) != 0x00 && (a0_19 & 0x00F0) == 0x10)
					ra_107 = llm_con_req_ind(ra_107, 0x00, a1, a1, a0, a0, s3, s4, out s0_108, out s1_109, out s2_112, out s3, out s6);
			}
			else if ((a0_19 & 0x0F) == 0x01)
				ra_107 = llm_le_adv_report_ind(ra_107, 0x00, a1, a1, a0, s3, s4, s5, s6, s7, s8_25, out s0_108, out s1_109, out s2_112, out s3, out s6);
		}
	}
	goto l23032E92;
}

// 23032F18: void llm_wlpub_addr_set(Register up32 a0, Register (ptr32 Eq_157109) a1)
// Called from:
//      llm_wl_clr
//      llm_wl_dev_add
//      llm_wl_dev_rem
void llm_wlpub_addr_set(up32 a0, struct Eq_157109 * a1)
{
	word16 * a0_10 = a0 + 0x28008204;
	a1_11 = a1;
	do
	{
		struct Eq_157109 * a1_11;
		*a0_10 = (word16) ((word32) a1_11->b0001 << 8 | (word32) a1_11->b0000);
		++a1_11;
		++a0_10;
	} while (a1 + 3 != a1_11);
}

// 23032F46: void llm_wlpriv_addr_set(Register up32 a0, Register (ptr32 Eq_157109) a1)
// Called from:
//      llm_wl_clr
//      llm_wl_dev_add
//      llm_wl_dev_rem
void llm_wlpriv_addr_set(up32 a0, struct Eq_157109 * a1)
{
	word16 * a0_10 = a0 + 0x2800821C;
	a1_11 = a1;
	do
	{
		struct Eq_157109 * a1_11;
		*a0_10 = (word16) ((word32) a1_11->b0001 << 8 | (word32) a1_11->b0000);
		++a1_11;
		++a0_10;
	} while (a1 + 3 != a1_11);
}

// 23032F74: Register Eq_2 llm_con_req_ind(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_148921 a1, Register Eq_148921 s2, Register Eq_2 s3, Register ptr32 s4, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_157072) s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      llm_pdu_defer
Eq_2 llm_con_req_ind(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 a0, Eq_148921 a1, Eq_148921 s2, Eq_2 s3, ptr32 s4, union Eq_2 & s0Out, ptr32 & s1Out, struct Eq_157072 & s2Out, ptr32 & s3Out, ptr32 & s6Out)
{
	<anonymous> * a5_26 = g_ptr4200F3D0;
	word32 s4_34;
	struct Eq_157168 * sp_132;
	Eq_2 ra_107;
	Eq_2 s0_145;
	struct Eq_157072 * s2_147;
	ptr32 s3_148;
	ptr32 s6_175;
	a5_26();
	ui32 a5_48 = (word32) sp_132->w0036;
	if ((word32) (word16) (a5_48 + -0x0A) <= 0x00FFFC76)
	{
		up32 a1_54 = (word32) sp_132->w0032;
		if ((word32) (word16) (a1_54 + -6) > 0x00FFFC7A)
			goto l230330F2;
		Eq_157197 a3_59 = (word32) sp_132->w0034;
		if (a3_59 <= 499 && ((word32) a3_59.u1 + 1) + a1_54 < a5_48 << 2)
		{
			word32 a0_65;
			struct Eq_157211 * s1_71;
			ra_107 = llc_util_get_free_conhdl(ra_107, &sp_132->w0006, out s1_71, out a0_65);
			if (a0_65 != 0x00)
				goto l230330F2;
			if ((s0_145 & 0x0200) == 0x00)
			{
				word32 s0_80 = (word32) (word16) (word32) s1_71[(s4_34 + 984) / 0x280083D4];
				if (s0_80 != 0x00)
				{
					word32 s4_102;
					word32 s0_104;
					s2_147->ptr03D0();
					uint16 * a5_125 = (s0_104 + -558 >> 52 & 0x00FF) + 52 + (s4_102 + 558);
					sp_132->b0016 = (byte) ((word32) *a5_125 & 0x02 | (word32) (*a5_125) & 0x01);
l23033054:
					word32 a0_139;
					Eq_2 s1_146;
					s0_145 = llm_util_bl_check(&sp_132->dw001C, (word32) sp_132->b0016, 0x00, sp_132->t0074, sp_132->t0094, sp_132->t0128, out s1_146, out a0_139, out s2_147, out s3_148);
					if (a0_139 == 0x00)
					{
						word32 a0_156;
						struct Eq_157286 * s2_168;
						word32 s3_169;
						word32 s4_170;
						Eq_2 s0_166;
						Eq_2 s1_167;
						Eq_2 ra_165 = llm_util_bl_add(ra_107, s0_145, s1_146, &sp_132->dw001C, (word32) sp_132->w0006, out s0_166, out s1_167, out a0_156, out s2_168, out s3_169, out s4_170, out s6_175);
						if (a0_156 == 0x00)
						{
							word32 a5_177 = (word32) sp_132->w0032;
							sp_132->w000E = (word16) s0_166;
							sp_132->t0008 = (word16) a5_177;
							sp_132->w000A = (word16) (word32) sp_132->w0034;
							sp_132->w000C = (word16) (word32) sp_132->w0036;
							uint32 a5_189 = (word32) sp_132->b003D;
							sp_132->b0017 = (byte) (a5_189 & 0x1F);
							<anonymous> * a5_193 = s2_168->ptr03D0;
							sp_132->t0018 = (byte) (a5_189 >> 0x05);
							Eq_2 s2_201;
							struct Eq_154982 * s3_202;
							Eq_2 ra_203;
							Eq_2 a2_205;
							a5_193();
							struct Eq_139897 * a0_224;
							union Eq_2 * a5_229;
							Eq_2 s0_234;
							word32 s10_236;
							Eq_2 s2_238;
							word32 s3_239;
							Eq_2 s4_240;
							word32 s5_241;
							Eq_2 s8_244;
							Eq_2 ra_233 = lld_move_to_slave(ra_203, &sp_132->t0008, &sp_132->dw001C, a2_205, (word32) sp_132->w0006, s3_202, s2_201, sp_132->t0028, sp_132->t0048, sp_132->t0068, sp_132->t006C, sp_132->t0074, sp_132->t0078, sp_132->t0094, sp_132->t00B0, sp_132->t00B4, sp_132->t00BC, sp_132->t00D8, sp_132->t0128, out s0_234, out a0_224, out a5_229, out s2_238, out s3_239, out s4_240, out s5_241, out s8_244, out s10_236);
							a0_224->t0048 = s0_234;
							ra_165 = llc_start(ra_233, s0_234, &sp_132->t0008, a0_224, a5_229, s2_238, s3_239, s4_240, s5_241, s8_244, s10_236, sp_132->t0008, sp_132->t0010, sp_132->t0014, sp_132->t0018, sp_132->dw001C, sp_132->t0038, sp_132->t0078, sp_132->t00D8, sp_132->t0118, sp_132->t0128, out s0_166, out s1_167, out s6_175);
							word32 a0_284 = (word32) sp_132->w0006;
							((word32) s0_166 + 72)->u0 = 0x00;
							llc_util_update_channel_map(a0_284);
						}
						ui32 a0_294;
						Eq_2 s0_299;
						word32 mstatus_473;
						word32 s4_472;
						word32 a5_471;
						word32 s1_467;
						word32 a0_468;
						word32 a2_469;
						word32 a4_470;
						word32 a1_464;
						word32 a4_465;
						word32 s8_466;
						ra_107 = ble_ke_state_set(ble_ke_state_get(ra_165, s0_166, 0x00, out s0_299, out a0_294, out a1_464, out a4_465, out s8_466), s0_299, s1_167, 0x00, a0_294 & 0x0F, sp_132->t0108, out s0_145, out s1_467, out a0_468, out a2_469, out a4_470, out a5_471, out s2_147, out s3_148, out s4_472, out mstatus_473);
					}
					goto l230330F2;
				}
			}
			sp_132->b0016 = (byte) ((word32) s1_71->w280083D2 >> 6 & 0x01);
			goto l23033054;
		}
	}
l230330F2:
	s0Out = s0_145;
	s1Out = dwArg28;
	s2Out = s2_147;
	s3Out = s3_148;
	s6Out = s6_175;
	return ra_107;
}

