pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303311C: Register Eq_2 llm_le_adv_report_ind(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_148921 s2, Register Eq_2 s3, Register ptr32 s4, Register ptr32 s5, Register ptr32 s6, Register Eq_2 s7, Register word32 s8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_157099 s6Out)
// Called from:
//      llm_pdu_defer
Eq_2 llm_le_adv_report_ind(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 a0, Eq_148921 s2, Eq_2 s3, ptr32 s4, ptr32 s5, ptr32 s6, Eq_2 s7, word32 s8, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_157099 & s6Out)
{
	ui32 s1_49;
	Eq_2 ra_161;
	Eq_2 s0_140;
	word32 s5_132;
	word32 s4_136;
	word32 sp_131;
	Eq_2 s2_137;
	Eq_2 s3_135;
	Eq_157099 s6_142;
	g_ptr4200F3D0();
	ui32 s1_162 = s1_49 & 0x0F;
	word32 s7_138 = 0x42026460;
	if ((word32) *((word32) g_t42026470 + 0x0A) == 0x01 || (s1_49 & 0x0F) == 0x01)
	{
		Eq_2 s0_68 = g_t42026468;
		while (s0_68 != 0x00)
		{
			word32 a3_1134;
			word32 a4_1135;
			word32 a5_1136;
			word32 a2_1133;
			if (co_bdaddr_compare(sp_131 + 8, (word32) s0_68 + 5, out a2_1133, out a3_1134, out a4_1135, out a5_1136) != 0x00 && (word32) (*((word32) s0_68 + 4)) == (s1_49 & 0x0F))
				goto l2303331A;
			s0_68 = *s0_68;
		}
		s6_142.u0 = 0x42026000;
		word32 a0_89;
		word32 s0_93;
		Eq_2 ra_92 = ble_co_list_size(ra_161, s0_68, 0x42026468, out s0_93, out a0_89);
		if (a0_89 == 0x0A)
			goto l2303331A;
		word32 a0_99;
		word32 s1_110;
		word32 s4_111;
		word32 s8_112;
		Eq_2 ra_139;
		Eq_2 s1_141;
		(*((word32) s2_137 + 976))();
		*((word32) s0_140 + 4) = (byte) s1_141;
		word32 a0_1143;
		word32 a5_1144;
		ra_161 = ble_co_list_push_back(ra_139, s0_140, s1_141, (word32) s6_142.u0 + 1128, s0_140, out s1_162, out a0_1143, out a5_1144);
	}
	if (((word32) g_b4200F3BC & 0x00FF) != 0x00)
		goto l2303331A;
	up32 a0_170;
	word32 ra_174 = ble_ke_msg_get_sent_num(ra_161, s0_140, out a0_170);
	if (a0_170 <= 0x14)
	{
		struct Eq_157656 * sp_450;
		Eq_2 s5_451;
		Eq_2 s4_455;
		Eq_2 s3_454;
		Eq_2 s2_477;
		Eq_2 ra_458;
		Eq_2 s0_475;
		Eq_2 s1_460;
		<anonymous> * a5_190 = *((word32) s2_137 + 976);
		word32 sp_201;
		word32 s5_202;
		word32 s3_205;
		word32 s4_206;
		struct Eq_157672 * s2_207;
		word32 s7_208;
		word32 ra_209;
		word32 s0_210;
		word32 s1_211;
		word32 s6_212;
		word32 s8_213;
		a5_190();
		struct Eq_157679 * sp_230;
		word32 s5_231;
		struct Eq_157681 * s7_237;
		Eq_2 ra_238;
		word32 s0_239;
		Eq_2 s1_240;
		word32 s6_241;
		s2_207->ptr03D0();
		Eq_2 s0_257 = (word32) (word16) s0_239;
		s6_142 = (word32) (word16) s6_241;
		if (s1_240 == 0x01 && (s1_240 < (word32) (s7_237->ptr0010)->b0008 && (((word32) (*s3_135) >> 7 & 0x01) != 0x00 && (((word32) sp_230->b0015 & 0x00C0) == 64 && (s0_257 == 0x00 || (s6_142 & 0x0600) == 0x0600)))))
		{
			if (llm_util_check_evt_mask(0x0A) == 0x00)
				goto l2303331A;
			struct Eq_157738 * a0_552;
			word32 s0_562;
			word32 s2_564;
			word32 s3_565;
			word32 s4_566;
			word32 s8_567;
			word32 mstatus_1152;
			word32 a2_1147;
			word32 a4_1149;
			word32 a6_1150;
			word32 a7_1151;
			word32 a3_1148;
			word32 s1_1145;
			word32 a1_1146;
			Eq_2 ra_561 = ble_ke_msg_alloc(ra_238, s0_257, s1_240, 0x00FFF804, 0x00, 0x00, 0x12, s2_137, s3_135, sp_230->t0128, out s0_562, out s1_1145, out a0_552, out a1_1146, out a2_1147, out a3_1148, out a4_1149, out a6_1150, out a7_1151, out s2_564, out s3_565, out s4_566, out s8_567, out mstatus_1152);
			a0_552->b0000 = 11;
			a0_552->b0001 = 0x01;
			<anonymous> * a5_582 = g_ptr42025748;
			word32 s5_586;
			word32 a0_587;
			uint16 * s3_589;
			word32 s4_590;
			struct Eq_157791 * s2_591;
			word32 s7_592;
			word32 ra_593;
			word32 s0_594;
			struct Eq_157795 * s1_595;
			word32 s6_596;
			word32 s8_597;
			a5_582();
			s1_595->b0011 = (byte) a0_587;
			s1_595->b0002 = (byte) ((word32) *s3_589 & 0x0F);
			if (s0_594 != 0x00)
			{
				struct Eq_157849 * sp_681;
				word32 s5_682;
				word32 s3_685;
				word32 s4_686;
				struct Eq_157853 * s2_687;
				word32 s7_688;
				word32 ra_689;
				word32 s0_690;
				struct Eq_157857 * s1_691;
				word32 s6_692;
				word32 s8_693;
				s2_591->ptr03D0();
				ui32 a5_713 = (word32) ((word32) (s0_690 + -558 >> 52 & 0x00FF) + 52 + (s6_692 + 558));
				s1_691->b0003 = (byte) (a5_713 & 0x01);
				if (((word32) sp_681->b001D & 0x00C0) == 64)
					s1_691->b0003 = (byte) (a5_713 & 0x01 | 2);
				s2_687->ptr03D0();
				((word32) s1_460 + 0x0A)->u0 = 0x01;
			}
			else
			{
				word32 sp_618;
				word32 s5_619;
				uint16 * s3_622;
				word32 s4_623;
				struct Eq_157818 * s2_624;
				word32 s7_625;
				word32 ra_626;
				word32 s0_627;
				struct Eq_157822 * s1_628;
				word32 s6_629;
				word32 s8_630;
				s2_591->ptr03D0();
				s1_628->b0003 = (byte) ((word32) *s3_622 >> 6 & 0x01);
				<anonymous> * a5_648 = s2_624->ptr03D0;
				word32 s7_657;
				a5_648();
				*((word32) s1_460 + 0x0A) = (byte) s7_657;
			}
l23033314:
			word32 a3_1158;
			word32 a4_1159;
			word32 s7_1162;
			word32 s10_1164;
			word32 mstatus_1165;
			word32 s9_1163;
			word32 s4_1160;
			word32 s5_1161;
			word32 s1_1155;
			word32 a2_1157;
			word32 a0_1156;
			word32 s0_1154;
			word32 tp_1153;
			hci_send_2_host(ra_458, s0_475, s1_460, s2_477, s3_454, s4_455, s5_451, sp_450->t0010, sp_450->t0014, sp_450->t0038, out tp_1153, out s0_1154, out s1_1155, out a0_1156, out a2_1157, out a3_1158, out a4_1159, out s2_137, out s3_135, out s4_1160, out s5_1161, out s6_142, out s7_1162, out s9_1163, out s10_1164, out mstatus_1165);
			goto l2303331A;
		}
		if (llm_util_check_evt_mask(0x01) == 0x00)
			goto l2303331A;
		struct Eq_157945 * a0_285;
		word32 s0_295;
		word32 s2_297;
		word32 s3_298;
		word32 s4_299;
		word32 s8_300;
		word32 mstatus_1173;
		word32 a4_1170;
		word32 a7_1172;
		word32 a6_1171;
		word32 a3_1169;
		word32 a2_1168;
		word32 a1_1167;
		word32 s1_1166;
		Eq_2 ra_294 = ble_ke_msg_alloc(ra_238, s0_257, s1_240, 0x00FFF804, 0x00, 0x00, 43, s2_137, s3_135, sp_230->t0128, out s0_295, out s1_1166, out a0_285, out a1_1167, out a2_1168, out a3_1169, out a4_1170, out a6_1171, out a7_1172, out s2_297, out s3_298, out s4_299, out s8_300, out mstatus_1173);
		a0_285->b0001 = 0x01;
		a0_285->b0000 = 0x02;
		<anonymous> * a5_315 = g_ptr42025748;
		word32 a0_320;
		struct Eq_157995 * s1_328;
		struct Eq_157996 * s2_324;
		word32 s0_327;
		word32 s5_319;
		uint16 * s3_322;
		uint16 * s4_323;
		ui32 s7_325;
		word32 ra_326;
		word32 s8_330;
		int32 s6_329;
		a5_315();
		s1_328->b002A = (byte) a0_320;
		ui32 a5_343 = (word32) *s3_322;
		ui32 a5_344 = a5_343 & 0x0F;
		if ((a5_343 & 0x0F) != s7_325)
		{
			if ((a5_343 & 0x0F) == 0x06)
			{
				s1_328->b0002 = (byte) s7_325;
				goto l230333D2;
			}
		}
		else
			a5_344 = 0x03;
		s1_328->b0002 = (byte) a5_344;
l230333D2:
		if ((word32) s1_328->b0002 == 0x01)
			s1_328->b000A = 0x00;
		else
		{
			uint32 a5_360 = ((word32) *s3_322 >> 8) + ~0x05;
			if ((a5_360 & 0x00FF) <= 0x1F)
				s1_328->b000A = (byte) (a5_360 & 0x00FF);
			else
				s1_328->b000A = 0x1F;
			ui32 a5_376 = (word32) *s4_323 + 0x06 << 16;
			s2_324->ptr03D0();
		}
		ui32 a5_487;
		ptr32 a0_429 = &s1_328->b0002 + 2;
		<anonymous> * a5_432 = s2_324->ptr03D0;
		if (s0_327 != 0x00)
		{
			s6_329 &= 0x0600;
			if (s6_329 != 0x0200)
			{
				word32 s2_456;
				word32 s0_459;
				a5_432();
				ui32 a5_482 = (word32) ((word32) (s0_459 + -558 >> 52 & 0x00FF) + 52 + (s2_456 + 558));
				*((word32) s1_460 + 3) = (byte) (a5_482 & 0x01);
				s0_475.u0 = 52;
				s2_477 = s2_456 + 558;
				if (((word32) sp_450->b001D & 0x00C0) != 64)
					goto l23033314;
				a5_487 = a5_482 & 0x01 | 2;
l2303340C:
				*((word32) s1_460 + 3) = (byte) a5_487;
				goto l23033314;
			}
		}
		word32 a4_490 = (word32) *s4_323;
		a5_432();
		a5_487 = (word32) *s3_454 >> 6 & 0x01;
		goto l2303340C;
	}
l2303331A:
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	s2Out = s2_137;
	s3Out = s3_135;
	s6Out = s6_142;
	return dwLoc08;
}

// 230334A4: Register Eq_2 llm_con_req_tx_cfm(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_148921 s2, Register Eq_2 s3, Register ptr32 s4, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack word32 dwArg0118, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      llm_pdu_defer
Eq_2 llm_con_req_tx_cfm(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 a0, Eq_148921 s2, Eq_2 s3, ptr32 s4, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, word32 dwArg0118, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s6Out)
{
	ptr32 s6_178;
	Eq_2 s1_108;
	Eq_2 ra_112;
	word32 s3_114;
	<anonymous> * a5_25 = g_ptr4200F3D0;
	word32 sp_29;
	word32 s1_30;
	word32 s0_32;
	word32 ra_34;
	word32 s2_35;
	word32 s3_36;
	struct Eq_158154 * s4_37;
	a5_25();
	struct Eq_158155 * sp_51;
	int32 s1_52;
	ptr32 s0_54;
	word32 ra_56;
	word32 s2_57;
	struct Eq_158160 * s4_59;
	s4_37->ptr03D0();
	word32 s3_72 = (word32) (word16) (word32) (s0_54 + 984 + s1_52);
	if (s3_72 != 0x00)
	{
		struct Eq_158194 * sp_107;
		word32 s0_110;
		s4_59->ptr03D0();
		uint16 * s0_130 = s0_110 + 558 + ((s3_114 + -558 >> 52 & 0x00FF) + 52);
		sp_107->b0022 = (byte) ((word32) *s0_130 & 0x02 | (word32) (*s0_130) & 0x01);
	}
	else
	{
		uint16 * s0_74 = s0_54 + 978 + s1_52;
		sp_51->b0022 = (byte) ((word32) *s0_74 >> 6 & 0x01);
		<anonymous> * a5_81 = s4_59->ptr03D0;
		a5_81();
	}
	ui32 a5_148 = (word32) bLoc23;
	Eq_2 s0_152 = (a5_148 & 0x1F)->t0054;
	Eq_139126 dwLoc48_382 = SEQ((word16) s3_114, (word16) (word32) wLoc2A);
	Eq_2 dwLoc4C_391 = SEQ((word16) (word32) wLoc2C, (word16) (word32) wLoc2E);
	if ((a5_148 & 0x1F) != 0x00)
	{
		Eq_2 a0_159;
		Eq_2 s2_171;
		word32 s4_433;
		word32 s3_432;
		ra_112 = llm_util_bl_add(ra_112, s0_152, s1_108, fp - 0x0044, (word32) *((word32) s0_152 + 0x0044), out s0_152, out s1_108, out a0_159, out s2_171, out s3_432, out s4_433, out s6_178);
		if (a0_159 == 0x00)
		{
			struct Eq_139897 * a0_184;
			union Eq_2 * a5_189;
			Eq_2 s0_194;
			word32 s10_196;
			Eq_2 s2_198;
			word32 s3_199;
			Eq_2 s4_200;
			word32 s5_201;
			Eq_2 s8_204;
			Eq_2 ra_193 = lld_move_to_master(ra_112, s1_108, a0_159, s2_171, dwLoc28, dwLoc08, dwArg18, dwArg1C, s3, dwArg58, dwArg60, dwArg64, dwArg6C, dwArg88, dwArg0118, out s0_194, out a0_184, out a5_189, out s2_198, out s3_199, out s4_200, out s5_201, out s8_204, out s10_196);
			a0_184->t0054 = s0_194;
			ra_112 = llc_start(ra_193, s0_194, fp - 76, a0_184, a5_189, s2_198, s3_199, s4_200, s5_201, s8_204, s10_196, dwLoc58, dwLoc50, dwLoc4C_391, dwLoc48_382, dwLoc44, dwLoc28, dwArg18, dwArg78, dwArgB8, dwArgC8, out s0_152, out s1_108, out s6_178);
			((word32) s0_152 + 84)->u0 = 0x00;
		}
	}
	ui32 a0_245;
	Eq_2 s0_250;
	ptr32 s2_268;
	ptr32 s3_269;
	word32 mstatus_431;
	word32 a5_429;
	word32 s4_430;
	word32 a2_427;
	word32 a4_428;
	word32 s1_425;
	word32 a0_426;
	word32 s8_423;
	word32 s0_424;
	word32 a1_421;
	word32 a4_422;
	Eq_2 ra_266 = ble_ke_state_set(ble_ke_state_get(ra_112, s0_152, 0x00, out s0_250, out a0_245, out a1_421, out a4_422, out s8_423), s0_250, s1_108, 0x00, a0_245 & 0x00F0, dwArgA8, out s0_424, out s1_425, out a0_426, out a2_427, out a4_428, out a5_429, out s2_268, out s3_269, out s4_430, out mstatus_431);
	s1Out = dwArg28;
	s2Out = s2_268;
	s3Out = s3_269;
	s6Out = s6_178;
	return ra_266;
}

// 230335E2: Register Eq_2 llm_common_cmd_complete_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_158369) s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      lld_stop_ind_handler
//      hci_vsc_set_tx_pwr
//      hci_le_wr_rfpath_compensation_cmd_handler
//      hci_wr_le_host_supp_cmd_handler
//      hci_le_wr_suggted_dft_data_len_cmd_handler
//      hci_le_set_evt_mask_cmd_handler
//      hci_host_nb_cmp_pkts_cmd_handler
//      hci_host_buf_size_cmd_handler
//      hci_set_evt_mask_page_2_cmd_handler
//      hci_set_evt_mask_cmd_handler
//      hci_set_ctrl_to_host_flow_ctrl_cmd_handler
//      hci_reset_cmd_handler
//      hci_le_tx_test_cmd_handler
//      hci_le_rx_test_cmd_handler
//      hci_le_wl_mngt_cmd_handler
//      hci_le_set_host_ch_class_cmd_handler
//      hci_le_set_scan_en_cmd_handler
//      hci_le_set_scan_param_cmd_handler
//      hci_le_set_scan_rsp_data_cmd_handler
//      hci_le_set_adv_en_cmd_handler
//      hci_le_set_adv_data_cmd_handler
//      hci_le_set_adv_param_cmd_handler
//      hci_le_set_rand_add_cmd_handler
//      hci_le_create_con_cancel_cmd_handler
Eq_2 llm_common_cmd_complete_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, struct Eq_158369 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	Eq_2 a0_19;
	word32 s0_29;
	Eq_2 s2_31;
	Eq_2 s3_32;
	Eq_2 s4_33;
	word32 s1_81;
	word32 a1_82;
	word32 a2_83;
	word32 a3_84;
	word32 a4_85;
	word32 a6_86;
	word32 a7_87;
	word32 s8_88;
	word32 mstatus_89;
	Eq_2 ra_28 = ble_ke_msg_alloc(ra, a1, s1, 0x00FFF801, 0x00, a0, 0x01, s2, s3, dwArg0118, out s0_29, out s1_81, out a0_19, out a1_82, out a2_83, out a3_84, out a4_85, out a6_86, out a7_87, out s2_31, out s3_32, out s4_33, out s8_88, out mstatus_89);
	*a0_19 = (byte) s0_29;
	struct Eq_158369 * s0_53;
	ptr32 s1_54;
	ptr32 s2_57;
	ptr32 s3_58;
	ptr32 s5_60;
	word32 tp_90;
	word32 a0_91;
	word32 a2_92;
	word32 a3_93;
	word32 a4_94;
	word32 s4_95;
	word32 s6_96;
	word32 s7_97;
	word32 s9_98;
	word32 s10_99;
	word32 mstatus_100;
	Eq_2 ra_52 = hci_send_2_host(ra_28, s0, a0_19, s2_31, s3_32, s4_33, s5, dwArg10, dwArg14, dwArg38, out tp_90, out s0_53, out s1_54, out a0_91, out a2_92, out a3_93, out a4_94, out s2_57, out s3_58, out s4_95, out s5_60, out s6_96, out s7_97, out s9_98, out s10_99, out mstatus_100);
	s0Out = s0_53;
	s1Out = s1_54;
	s2Out = s2_57;
	s3Out = s3_58;
	s5Out = s5_60;
	return ra_52;
}

// 23033608: Register Eq_2 llm_common_cmd_status_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      hci_le_generate_dhkey_cmd_handler
//      hci_le_create_con_cmd_handler
//      hci_le_rd_local_p256_public_key_cmd_handler
Eq_2 llm_common_cmd_status_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_2 a0_19;
	word32 s0_29;
	Eq_2 s2_31;
	Eq_2 s3_32;
	Eq_2 s4_33;
	word32 s1_82;
	word32 a1_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a6_87;
	word32 a7_88;
	word32 s8_89;
	word32 mstatus_90;
	Eq_2 ra_28 = ble_ke_msg_alloc(ra, a1, s1, 0x00FFF802, 0x00, a0, 0x01, s2, s3, dwArg0118, out s0_29, out s1_82, out a0_19, out a1_83, out a2_84, out a3_85, out a4_86, out a6_87, out a7_88, out s2_31, out s3_32, out s4_33, out s8_89, out mstatus_90);
	*a0_19 = (byte) s0_29;
	ptr32 a2_45;
	ptr32 s0_53;
	ptr32 s1_54;
	ptr32 s10_55;
	ptr32 s7_62;
	ptr32 s9_64;
	word32 tp_91;
	word32 a0_92;
	word32 a3_93;
	word32 a4_94;
	word32 s2_95;
	word32 s3_96;
	word32 s4_97;
	word32 s5_98;
	word32 s6_99;
	word32 mstatus_100;
	Eq_2 ra_52 = hci_send_2_host(ra_28, s0, a0_19, s2_31, s3_32, s4_33, s5, dwArg10, dwArg14, dwArg38, out tp_91, out s0_53, out s1_54, out a0_92, out a2_45, out a3_93, out a4_94, out s2_95, out s3_96, out s4_97, out s5_98, out s6_99, out s7_62, out s9_64, out s10_55, out mstatus_100);
	s0Out = s0_53;
	s1Out = s1_54;
	a2Out = a2_45;
	s7Out = s7_62;
	s9Out = s9_64;
	s10Out = s10_55;
	return ra_52;
}

// 2303362E: Register Eq_2 llm_test_mode_start_tx(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s4, Register ptr32 mstatus, Register out ptr32 s5Out)
// Called from:
//      hci_le_tx_test_cmd_handler
Eq_2 llm_test_mode_start_tx(Eq_2 ra, Eq_2 a0, Eq_2 s4, ptr32 mstatus, ptr32 & s5Out)
{
	if ((word32) *a0 <= 39)
	{
		Eq_2 a5_316 = 0x12;
		if ((word32) *((word32) a0 + 1) != 0x00)
		{
			struct Eq_158559 * sp_12 = fp + -288;
			if ((word32) *((word32) a0 + 2) <= 0x07)
			{
				__csrrs(mstatus, 0x00);
				__csrrc(mstatus, 0x08);
				Eq_2 a0_33;
				Eq_2 s0_38;
				word32 s8_472;
				word32 a5_471;
				word32 a1_470;
				Eq_2 ra_37 = ble_co_list_pop_front(ra, a0, 0x420262D0, out s0_38, out a0_33, out a1_470, out a5_471, out s8_472);
				__csrrw(mstatus, 0x00);
				struct Eq_158592 * a0_44;
				Eq_2 s0_49;
				word32 s8_475;
				word32 a5_474;
				word32 a1_473;
				Eq_2 ra_48 = ble_co_list_pop_front(ra_37, s0_38, 0x420262C8, out s0_49, out a0_44, out a1_473, out a5_474, out s8_475);
				a5_316.u0 = 0x07;
				if (a0_33 != 0x00 && a0_44 != null)
				{
					((word16[]) 0x280082D8)[(word32) a0_44->w0004 / 2] = (word16) (word32) *((word32) a0_33 + 6);
					struct Eq_158623 * a4_63 = (word32) a0_44->w0004;
					a4_63->w280082DC = (word16) ((word32) (word15) (word32) a4_63->w280082DC | 0x08000000);
					struct Eq_158664 ** a5_79;
					word32 mstatus_81;
					word32 s1_83;
					word32 a0_476;
					word32 a4_478;
					word32 a2_477;
					Eq_2 s4_159;
					Eq_2 s0_156;
					word32 s2_158;
					Eq_2 s3_154;
					Eq_2 ra_155 = ble_ke_state_set(ra_48, s0_49, a0_33, 0x00, 36, s4, out s0_156, out s1_83, out a0_476, out a2_477, out a4_478, out a5_79, out s2_158, out s3_154, out s4_159, out mstatus_81);
					struct Eq_158664 * a4_92 = *a5_79;
					*(a5_79 & ~0x00040000 | 0x00040000) = (struct Eq_158664 **) a4_92;
					Eq_2 a5_99 = (word32) *((word32) s0_156 + 2);
					if (s3_154 >= a5_99)
					{
						ui32 a3_101 = 0x01 << a5_99;
						if ((a3_101 & 0x00F6) == 0x00)
						{
							if ((a3_101 & 0x09) != 0x00)
							{
								a4_92->dw00E0 = (a5_99 & 0x01) << 0x0D | a4_92->dw00E0 & ~0x02000000;
								a4_92->dw00E0 = a4_92->dw00E0 & ~0x01000000 | 0x01000000;
							}
						}
						else
						{
							<anonymous> * a5_114 = g_ptr4200F3D4;
							word32 sp_124;
							word32 s3_128;
							word32 ra_129;
							word32 s0_130;
							word32 s1_131;
							word32 s2_132;
							word32 s4_133;
							word32 mstatus_134;
							a5_114();
							<anonymous> * a5_145 = g_ptr4200F3D0;
							word32 a2_161;
							word32 a1_163;
							word32 s8_164;
							word32 t3_165;
							word32 a6_166;
							word32 t1_167;
							word32 tp_168;
							word32 a7_344;
							word32 s10_345;
							word32 s11_346;
							word32 s5_347;
							word32 s6_348;
							word32 s7_349;
							word32 s9_350;
							word32 t0_351;
							a5_145();
							*(int32 *) 0x280000E0 &= ~0x01000000;
						}
					}
					if (g_ptr42026474 == null)
					{
						struct Eq_158828 * a0_200;
						word32 mstatus_208;
						word32 s0_210;
						word32 s1_211;
						word32 s4_212;
						word32 a4_480;
						word32 a3_479;
						word32 s8_483;
						word32 a6_482;
						word32 a5_481;
						Eq_2 ra_209 = ble_ke_malloc(ra_155, s0_156, 0x42026460, 36, 0x00, out s0_210, out s1_211, out a0_200, out a3_479, out a4_480, out a5_481, out a6_482, out s4_212, out s8_483, out mstatus_208);
						<anonymous> * a5_217 = g_ptr4200F3D4;
						a0_200->dw0014 = s1_211;
						struct Eq_158860 * a5_227;
						word32 a3_236;
						word32 s8_238;
						word32 t3_239;
						word32 a6_240;
						word32 t1_241;
						word32 tp_242;
						word32 a7_243;
						word32 s10_352;
						word32 s11_353;
						word32 s5_354;
						word32 s6_355;
						word32 s7_356;
						word32 s9_357;
						word32 t0_358;
						a5_217();
						a5_227->w0016 = 0xF800;
						a5_227->b001C = 0x00;
						a5_227->w0018 = 0xF800;
						a5_227->b001B = 0x00;
						a5_227->b001A = 0x07;
						a5_227->b0021 = 0x01;
						*(uint16 *) 0x280082FE = (word16) ((word32) a5_227->b001C | 0x0600);
						*(uint16 *) 0x280082F4 = 0x0604;
					}
					((word16[]) 0x280082D6)[(word32) *((word32) s4_159 + 4) / 2] = (word16) ((word32) *((word32) s0_156 + 1) << 8 | (word32) (*((word32) s0_156 + 2)));
					struct Eq_158779 * a0_289;
					struct Eq_158780 * s1_300 = lld_test_mode_tx(ra_155, s0_156, s2_158 + 712 + ((word32) (*((word32) s4_159 + 4)) + 0x1C), s3_154, s4_159, sp_12->t0038, sp_12->t0058, sp_12->t0078, sp_12->t007C, sp_12->t00A4, sp_12->t00C0, sp_12->t00C4, sp_12->t00CC, sp_12->t00E8, out a0_289, out s5);
					a0_289->ptr0048 = s1_300;
					a5_316.u0 = 0x1F;
					if (a0_289 != null)
					{
						s1_300->b005A = 0x00;
						a5_316.u0 = 0x00;
					}
				}
			}
			s5Out = s5;
			return a5_316;
		}
	}
	s5Out = s5;
	return 0x12;
}

