pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303386A: Register Eq_2 llm_test_mode_start_rx(Register Eq_2 ra, Register Eq_2 a0, Stack word32 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      hci_le_rx_test_cmd_handler
Eq_2 llm_test_mode_start_rx(Eq_2 ra, Eq_2 a0, word32 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, Eq_2 dwArgF8, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	if ((word32) *a0 > 39)
	{
		s1Out = s1;
		a0Out = 0x12;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		return ra;
	}
	else
	{
		struct Eq_142600 * a5_18 = g_ptr42026474;
		Eq_2 s1_19 = a0;
		Eq_2 s0_20 = 0x42026460;
		if (a5_18 == null)
		{
			struct Eq_159014 * a0_23;
			word32 s0_33;
			word32 s1_34;
			word32 a3_279;
			word32 a4_280;
			word32 a5_281;
			word32 a6_282;
			word32 s4_283;
			word32 s8_284;
			word32 mstatus_285;
			Eq_2 ra_32 = ble_ke_malloc(ra, 0x42026460, a0, 36, 0x00, out s0_33, out s1_34, out a0_23, out a3_279, out a4_280, out a5_281, out a6_282, out s4_283, out s8_284, out mstatus_285);
			<anonymous> * a5_40 = g_ptr4200F3D4;
			a0_23->dw0014 = s0_33;
			struct Eq_159046 * a5_47;
			word32 a3_53;
			word32 tp_54;
			word32 a6_55;
			word32 a7_56;
			word32 mstatus_57;
			word32 s4_58;
			word32 s8_59;
			word32 t1_60;
			word32 t3_61;
			word32 s2_155;
			word32 s3_156;
			word32 s10_157;
			word32 s11_158;
			word32 s5_159;
			word32 s6_160;
			word32 s7_161;
			word32 s9_162;
			word32 t0_163;
			a5_40();
			a5_47->w0016 = 0xF800;
			a5_47->b001C = 0x00;
			a5_47->w0018 = 0xF800;
			a5_47->b001B = 0x00;
			s0_20 = a5_47->t0014;
			a5_47->b001A = 0x07;
			a5_47->b0021 = 0x01;
			*(uint16 *) 0x280082FE = (word16) ((word32) a5_47->b001C | 0x0600);
			*(uint16 *) 0x280082F4 = 0x0604;
			a5_18 = (struct Eq_142600 *) 0x0604;
		}
		*(a5_18 & ~0x00040000 | 0x00040000) = a5_18->dw0000;
		byte * s1_104;
		Eq_2 s0_112;
		struct Eq_158965 * a0_114;
		ptr32 s1_124;
		ptr32 s2_127;
		ptr32 s3_128;
		ptr32 s5_130;
		word32 a5_274;
		word32 s2_275;
		word32 s3_276;
		word32 s4_277;
		word32 mstatus_278;
		word32 a4_273;
		word32 a2_272;
		word32 a0_271;
		Eq_2 ra_123 = lld_test_mode_rx(ble_ke_state_set(ra, s0_20, s1_19, 0x00, 36, dwArgF8, out s0_112, out s1_104, out a0_271, out a2_272, out a4_273, out a5_274, out s2_275, out s3_276, out s4_277, out mstatus_278), s0_112, (word32) *s1_104, dwLoc10, dwLoc08, dwArg28, dwArg38, dwArg58, dwArg78, dwArg7C, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s1_124, out a0_114, out s2_127, out s3_128, out s5_130);
		a0_114->t0048 = s0_112;
		ptr32 a5_140 = 0x1F;
		if (a0_114 != null)
		{
			((word32) s0_112 + 90)->u0 = 0x01;
			a5_140 = 0x00;
		}
		s1Out = s1_124;
		a0Out = a5_140;
		s2Out = s2_127;
		s3Out = s3_128;
		s5Out = s5_130;
		return ra_123;
	}
}

// 23033932: Register Eq_2 llm_set_adv_param(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Stack word32 dwArg00, Stack word32 dwArg04, Stack word32 dwArg28, Stack word32 dwArg48, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      hci_le_set_adv_param_cmd_handler
Eq_2 llm_set_adv_param(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s3, word32 dwArg00, word32 dwArg04, word32 dwArg28, word32 dwArg48, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	up32 a4_5 = (word32) *a0;
	up32 a5_6 = (word32) *((word32) a0 + 2);
	if (a5_6 >= a4_5 && ((word32) (*((word32) a0 + 0x0D)) <= 0x07 && (word32) (*((word32) a0 + 0x0E)) <= 0x03))
	{
		ui32 a3_11 = (word32) *((word32) a0 + 4);
		if (((a3_11 & 0x00FB) != 0x00 || a4_5 > 0x1F) && ((word32) (*((word32) a0 + 5)) <= 0x03 && ((word32) (*((word32) a0 + 6)) <= 0x01 && (a3_11 == 0x01 || a5_6 <= 0x04000000))))
		{
			struct Eq_142600 * a5_114 = g_ptr42026474;
			Eq_2 s0_124 = a0;
			if (a5_114 == null)
			{
				struct Eq_159201 * a0_58;
				word32 s0_68;
				word32 s1_69;
				word32 s4_70;
				word32 a4_257;
				word32 a3_256;
				word32 a6_259;
				word32 s8_260;
				word32 a5_258;
				word32 mstatus_261;
				Eq_2 ra_67 = ble_ke_malloc(ra, a0, 0x42026460, 36, 0x00, out s0_68, out s1_69, out a0_58, out a3_256, out a4_257, out a5_258, out a6_259, out s4_70, out s8_260, out mstatus_261);
				<anonymous> * a5_75 = g_ptr4200F3D4;
				a0_58->dw0014 = s1_69;
				struct Eq_159233 * a5_82;
				word32 a3_84;
				word32 t3_92;
				word32 s8_93;
				word32 a6_94;
				word32 a7_95;
				word32 mstatus_96;
				word32 t1_97;
				a5_75();
				a5_82->w0016 = 0xF800;
				a5_82->b001C = 0x00;
				a5_82->w0018 = 0xF800;
				a5_82->b001B = 0x00;
				a5_82->b001A = 0x07;
				a5_82->b0021 = 0x01;
				*(uint16 *) 0x280082FE = (word16) ((word32) a5_82->b001C | 0x0600);
				*(uint16 *) 0x280082F4 = 0x0604;
				a5_114 = (struct Eq_142600 *) 0x0604;
			}
			ptr32 s1_118 = a5_114->ptr0014;
			a5_114->b001C = 0x08;
			a5_114->b0021 = 0x01;
			uint32 a4_125 = (word32) *((word32) s0_124 + 4);
			if (a4_125 > 0x04)
			{
				s0Out = s1;
				s1Out = s1_118;
				a0Out = 0x12;
				s2Out = s2;
				s3Out = s3;
				return ra;
			}
			else
			{
				<anonymous> * a4_139 = *((char *) g_a230B5A28 + a4_125 * 0x04);
				ptr32 a0_146;
				word32 a2_148;
				ptr32 s1_150;
				ptr32 s0_151;
				Eq_2 ra_152;
				Eq_2 s2_153;
				Eq_2 s3_154;
				word32 a1_156;
				word32 t3_157;
				word32 s8_158;
				word32 a6_159;
				word32 a7_160;
				word32 mstatus_161;
				word32 t1_162;
				a4_139();
				s0Out = s0_151;
				s1Out = s1_150;
				a0Out = a0_146;
				s2Out = s2_153;
				s3Out = s3_154;
				return ra_152;
			}
		}
	}
	s0Out = s0;
	s1Out = s1;
	a0Out = 0x12;
	s2Out = s2;
	s3Out = s3;
	return ra;
}

// 23033B18: Register Eq_2 llm_set_adv_en(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_159300) a5, Register Eq_2 s7, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      hci_le_set_adv_en_cmd_handler
Eq_2 llm_set_adv_en(Eq_2 ra, Eq_2 a0, struct Eq_159300 * a5, Eq_2 s7, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	Eq_2 s1_176;
	struct Eq_159311 * sp_214 = fp + ~0x0F;
	Eq_2 s1_11 = (word32) *a0;
	if (s1_11 == 0x00)
	{
		ui32 a0_15;
		Eq_2 s0_20;
		Eq_2 a0_26;
		ptr32 mstatus_33;
		Eq_2 s2_36;
		word32 a4_465;
		word32 s0_467;
		word32 a5_471;
		word32 a4_470;
		word32 a2_469;
		word32 s3_472;
		word32 s1_468;
		word32 s8_466;
		word32 s4_473;
		word32 a1_464;
		ra = lld_adv_stop(ble_ke_state_set(ble_ke_state_get(ra, 0x42026460, 0x00, out s0_20, out a0_15, out a1_464, out a4_465, out s8_466), s0_20, s1_11, 0x00, a0_15 & 0x0F | 32, dwArgF8, out s0_467, out s1_468, out a0_26, out a2_469, out a4_470, out a5_471, out s2_36, out s3_472, out s4_473, out mstatus_33), a0_26, s2_36, mstatus_33, dwArgC8, dwArg0108, out s1_176, out s2, out s3, out s5);
		goto l23033BB0;
	}
	Eq_2 s0_72 = a5->t0014;
	if (a5 == null)
	{
		struct Eq_159393 * a0_75;
		word32 s0_85;
		word32 s1_86;
		word32 a5_478;
		word32 a4_477;
		word32 a6_479;
		word32 a3_476;
		word32 s4_480;
		word32 s8_481;
		word32 mstatus_482;
		Eq_2 ra_84 = ble_ke_malloc(ra, s0_72, s1_11, 36, 0x00, out s0_85, out s1_86, out a0_75, out a3_476, out a4_477, out a5_478, out a6_479, out s4_480, out s8_481, out mstatus_482);
		<anonymous> * a5_92 = g_ptr4200F3D4;
		a0_75->dw0014 = s0_85;
		struct Eq_159424 * a5_101;
		word32 s8_107;
		word32 t3_108;
		word32 a6_109;
		word32 mstatus_110;
		word32 s4_113;
		word32 t1_114;
		word32 a7_115;
		word32 s10_116;
		word32 s11_117;
		word32 s6_119;
		word32 s9_121;
		word32 t0_122;
		word32 t4_123;
		a5_92();
		a5_101->w0016 = 0xF800;
		a5_101->b001C = 0x00;
		a5_101->w0018 = 0xF800;
		a5_101->b001B = 0x00;
		a5_101->b001A = 0x07;
		a5_101->b0021 = 0x01;
		*(uint16 *) 0x280082FE = (word16) ((word32) a5_101->b001C | 0x0600);
		*(uint16 *) 0x280082F4 = 0x0604;
	}
	struct Eq_151094 * a2_147;
	word32 a3_474;
	word32 a4_475;
	struct Eq_159382 * a5_150;
	if (co_bdaddr_compare(0x420264BB, 0x230CB978, out a2_147, out a3_474, out a4_475, out a5_150) != 0x00)
	{
		ui32 a5_153 = (word32) a5_150->b001F;
		a5_150 = a5_153 & 0x01;
		if ((a5_153 & 0x01) != 0x00)
			goto l23033BAE;
	}
	Eq_2 s0_224;
	word32 a1_173;
	struct Eq_152259 * a0_160 = llm_util_apply_bd_addr((word32) a5_150->b001F, a2_147);
	Eq_2 s0_166 = a0_160->t0014;
	ui32 a4_168 = (word32) a0_160->b001C;
	if (a4_168 != 0x01)
	{
		if (a4_168 != 0x00 && a4_168 != 0x02)
		{
			s1_176.u0 = 0x12;
			if (a4_168 != 0x06)
				goto l23033BB0;
		}
		*(uint16 *) 0x280082FE = (word16) (((word32) a0_160->b001D + 0x06 & 0x00FF) << 8 | a4_168 | 32);
		s0_166 = a0_160->t0014;
		if ((word32) a0_160->b001C != 0x02)
		{
			*(uint16 *) 0x280082F4 = (word16) (((word32) a0_160->b001E + 0x06 & 0x00FF) << 8 | 36);
			struct Eq_159553 * a0_235;
			ra = lld_adv_start(ra, s0_166, a0_160, 0x42026314, 0x42026308, s7, sp_214->dw0128, out s0_224, out s1_176, out a0_235, out s2, out s3, out s5);
			a0_235->t0048 = s0_224;
			if (a0_235 == null)
				goto l23033BB0;
			goto l23033C56;
		}
		a1_173 = 0x42026314;
	}
	else
		a1_173 = 0x420262F0;
	struct Eq_159616 * a0_273;
	ra = lld_adv_start(ra, s0_166, a0_160, a1_173, 0x00, s7, sp_214->dw0128, out s0_224, out s1_176, out a0_273, out s2, out s3, out s5);
	a0_273->t0048 = s0_224;
	if (a0_273 == null)
	{
l23033BAE:
		s1_176.u0 = 0x12;
		goto l23033BB0;
	}
l23033C56:
	ui32 a0_283;
	Eq_2 s0_288;
	word32 a1_483;
	word32 a4_484;
	word32 s8_485;
	word32 s0_486;
	word32 s1_487;
	word32 a0_488;
	word32 a2_489;
	word32 a4_490;
	word32 a5_491;
	word32 s4_492;
	word32 mstatus_493;
	ra = ble_ke_state_set(ble_ke_state_get(ra, s0_224, 0x00, out s0_288, out a0_283, out a1_483, out a4_484, out s8_485), s0_288, s1_176, 0x00, a0_283 & 0x0F | 16, sp_214->t0108, out s0_486, out s1_487, out a0_488, out a2_489, out a4_490, out a5_491, out s2, out s3, out s4_492, out mstatus_493);
	s1_176.u0 = 0x00;
l23033BB0:
	s1Out = s1_176;
	a0Out = s1_176;
	s2Out = s2;
	s3Out = s3;
	s5Out = s5;
	return ra;
}

// 23033C9E: Register Eq_2 llm_set_adv_data(Register Eq_2 ra, Register Eq_2 a0, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_156123 a5Out, Register out ptr32 s4Out)
// Called from:
//      llm_util_adv_data_update
//      hci_le_set_adv_data_cmd_handler
Eq_2 llm_set_adv_data(Eq_2 ra, Eq_2 a0, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_156123 & a5Out, ptr32 & s4Out)
{
	if ((word32) *a0 > 0x1F)
	{
		s1Out = s1;
		a0Out = 0x12;
		a5Out.u0 = 0x1F;
		s4Out = s4;
		return ra;
	}
	else
	{
		struct Eq_142600 * a5_111 = g_ptr42026474;
		Eq_2 s1_159 = a0;
		if (a5_111 == null)
		{
			struct Eq_159665 * a0_22;
			word32 s0_32;
			word32 s1_33;
			word32 a3_191;
			word32 a4_192;
			word32 a5_193;
			word32 a6_194;
			word32 s4_195;
			word32 s8_196;
			word32 mstatus_197;
			Eq_2 ra_31 = ble_ke_malloc(ra, 0x42026460, a0, 36, 0x00, out s0_32, out s1_33, out a0_22, out a3_191, out a4_192, out a5_193, out a6_194, out s4_195, out s8_196, out mstatus_197);
			<anonymous> * a5_39 = g_ptr4200F3D4;
			a0_22->dw0014 = s0_32;
			struct Eq_159697 * a5_46;
			word32 a3_52;
			word32 tp_53;
			word32 a6_54;
			word32 a7_55;
			word32 mstatus_56;
			word32 s8_58;
			word32 t1_59;
			word32 t3_60;
			a5_39();
			a5_46->w0016 = 0xF800;
			a5_46->b001C = 0x00;
			a5_46->w0018 = 0xF800;
			a5_46->b001B = 0x00;
			a5_46->b001A = 0x07;
			a5_46->b0021 = 0x01;
			*(uint16 *) 0x280082FE = (word16) ((word32) a5_46->b001C | 0x0600);
			*(uint16 *) 0x280082F4 = 0x0604;
			a5_111 = (struct Eq_142600 *) 0x0604;
		}
		word32 a2_81 = (word32) *s1_159;
		ptr32 s0_83 = a5_111->ptr0014;
		a5_111->b001D = (byte) a2_81;
		if (a2_81 != 0x00)
		{
			<anonymous> * a4_88 = g_ptr4200F3D0;
			word32 a2_101;
			word32 a3_102;
			word32 tp_103;
			word32 a6_104;
			word32 a7_105;
			word32 mstatus_106;
			word32 s8_108;
			word32 t1_109;
			word32 t3_110;
			a4_88();
		}
		Eq_156123 a5_122 = ((word32) a5_111->b001D + 0x06 & 0x00FF) << 8 | (word32) (*((uint16 *) 0x280082FE)) & 0x00FF;
		*(uint16 *) 0x280082FE = (word16) a5_122;
		s1Out = s1_159;
		a0Out = 0x00;
		a5Out = a5_122;
		s4Out = s4;
		return ra;
	}
}

