pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23033D70: Register Eq_2 llm_set_scan_rsp_data(Register Eq_2 ra, Register Eq_2 a0, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_156177 a5Out, Register out ptr32 s4Out)
// Called from:
//      llm_util_adv_data_update
//      hci_le_set_scan_rsp_data_cmd_handler
Eq_2 llm_set_scan_rsp_data(Eq_2 ra, Eq_2 a0, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_156177 & a5Out, ptr32 & s4Out)
{
	if ((word32) *a0 > 0x1F)
	{
		s1Out = s1;
		a0Out = 0x12;
		a5Out.u0 = 0x1F;
		s4Out = s4;
		return ra;
	}
	else
	{
		struct Eq_142600 * a5_111 = g_ptr42026474;
		Eq_2 s1_159 = a0;
		if (a5_111 == null)
		{
			struct Eq_159807 * a0_22;
			word32 s0_32;
			word32 s1_33;
			word32 a3_191;
			word32 a4_192;
			word32 a5_193;
			word32 a6_194;
			word32 s4_195;
			word32 s8_196;
			word32 mstatus_197;
			Eq_2 ra_31 = ble_ke_malloc(ra, 0x42026460, a0, 36, 0x00, out s0_32, out s1_33, out a0_22, out a3_191, out a4_192, out a5_193, out a6_194, out s4_195, out s8_196, out mstatus_197);
			<anonymous> * a5_39 = g_ptr4200F3D4;
			a0_22->dw0014 = s0_32;
			struct Eq_159839 * a5_46;
			word32 a3_52;
			word32 tp_53;
			word32 a6_54;
			word32 a7_55;
			word32 mstatus_56;
			word32 s8_58;
			word32 t1_59;
			word32 t3_60;
			a5_39();
			a5_46->w0016 = 0xF800;
			a5_46->b001C = 0x00;
			a5_46->w0018 = 0xF800;
			a5_46->b001B = 0x00;
			a5_46->b001A = 0x07;
			a5_46->b0021 = 0x01;
			*(uint16 *) 0x280082FE = (word16) ((word32) a5_46->b001C | 0x0600);
			*(uint16 *) 0x280082F4 = 0x0604;
			a5_111 = (struct Eq_142600 *) 0x0604;
		}
		word32 a2_81 = (word32) *s1_159;
		ptr32 s0_83 = a5_111->ptr0014;
		a5_111->b001E = (byte) a2_81;
		if (a2_81 != 0x00)
		{
			<anonymous> * a4_88 = g_ptr4200F3D0;
			word32 a2_101;
			word32 a3_102;
			word32 tp_103;
			word32 a6_104;
			word32 a7_105;
			word32 mstatus_106;
			word32 s8_108;
			word32 t1_109;
			word32 t3_110;
			a4_88();
		}
		Eq_156177 a5_122 = ((word32) a5_111->b001E + 0x06 & 0x00FF) << 8 | (word32) (*((uint16 *) 0x280082F4)) & 0x00FF;
		*(uint16 *) 0x280082F4 = (word16) a5_122;
		s1Out = s1_159;
		a0Out = 0x00;
		a5Out = a5_122;
		s4Out = s4;
		return ra;
	}
}

// 23033E42: Register Eq_2 llm_set_scan_param(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 s1Out, Register out ptr32 a0Out)
// Called from:
//      hci_le_set_scan_param_cmd_handler
Eq_2 llm_set_scan_param(Eq_2 ra, Eq_2 a0, ptr32 & s1Out, ptr32 & a0Out)
{
	up32 a4_5 = (word32) *((word32) a0 + 4);
	up32 a5_6 = (word32) *((word32) a0 + 2);
	if (a5_6 < a4_5)
	{
		s1Out = s1;
		a0Out = 0x12;
		return ra;
	}
	else
	{
		Eq_2 s0_17 = a0;
		ptr32 a0_110 = 0x12;
		if ((word32) *a0 <= 0x01 && ((word32) ((word16) (a4_5 + ~0x03)) <= 0x03FFFFFC && ((word32) ((word16) (a5_6 + ~0x03)) <= 0x03FFFFFC && (word32) (*((word32) a0 + 7)) <= 0x03)))
		{
			Eq_151243 a5_31 = g_t42026470;
			if (a5_31 == 0x00)
			{
				struct Eq_160017 * a0_35;
				word32 s0_45;
				word32 s1_46;
				word32 a5_174;
				word32 a6_175;
				word32 a3_172;
				word32 a4_173;
				word32 s4_176;
				word32 s8_177;
				word32 mstatus_178;
				Eq_2 ra_44 = ble_ke_malloc(ra, a0, 0x42026460, 0x0C, 0x00, out s0_45, out s1_46, out a0_35, out a3_172, out a4_173, out a5_174, out a6_175, out s4_176, out s8_177, out mstatus_178);
				<anonymous> * a5_52 = g_ptr4200F3D4;
				a0_35->dw0010 = s1_46;
				word32 a3_64;
				word32 tp_66;
				word32 a6_67;
				word32 a7_68;
				word32 mstatus_69;
				word32 s4_70;
				word32 s8_71;
				word32 t1_72;
				word32 t3_73;
				a5_52();
			}
			((word32) a5_31 + 8)->u0 = (byte) (word32) *((word32) s0_17 + 7);
			*((word32) a5_31 + 4) = (word16) (word32) *((word32) s0_17 + 2);
			*((word32) a5_31 + 6) = (word16) (word32) *((word32) s0_17 + 4);
			((word32) a5_31 + 9)->u0 = (byte) (word32) *s0_17;
			s1 = (ptr32) *((word32) a5_31 + 16);
			((word32) a5_31 + 11)->u0 = (byte) (word32) *((word32) s0_17 + 6);
			a0_110 = 0x00;
			if ((word32) *s0_17 == 0x01)
				*(word16 *) 0x280082EA = 0xFC03;
		}
		s1Out = s1;
		a0Out = a0_110;
		return ra;
	}
}

// 23033F08: Register Eq_2 llm_set_scan_en(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_160063) a5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s5Out)
// Called from:
//      hci_le_set_scan_en_cmd_handler
Eq_2 llm_set_scan_en(Eq_2 ra, Eq_2 a0, struct Eq_160063 * a5, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s5Out)
{
	Eq_2 ra_108;
	Eq_2 s2_111;
	Eq_2 s1_13 = (word32) *a0;
	if (s1_13 == 0x00)
	{
		word32 a3_405;
		word32 s3_402;
		word32 a0_404;
		word32 s4_403;
		ui32 a0_168;
		Eq_2 s0_173;
		Eq_2 a0_179;
		ptr32 mstatus_186;
		Eq_2 s2_189;
		Eq_2 s4_213;
		word32 s6_406;
		word32 s7_407;
		word32 s8_408;
		word32 mstatus_409;
		word32 a5_401;
		word32 a4_400;
		word32 a2_399;
		word32 s1_398;
		word32 s0_397;
		word32 s8_396;
		word32 a4_395;
		word32 a1_394;
		ra_108 = lld_util_flush_list(lld_scan_stop(ble_ke_state_set(ble_ke_state_get(ra, 0x42026460, 0x00, out s0_173, out a0_168, out a1_394, out a4_395, out s8_396), s0_173, s1_13, 0x00, a0_168 & 0x00F0 | 3, dwArgF8, out s0_397, out s1_398, out a0_179, out a2_399, out a4_400, out a5_401, out s2_189, out s3_402, out s4_403, out mstatus_186), a0_179, s2_189, mstatus_186, dwArgC8, dwArg0108, out s1_13, out a0_404, out a3_405, out s2_111, out s3, out s4_213, out s5, out s6_406, out s7_407, out s8_408, out mstatus_409), s1_13, 0x42026468, s2_111, s3, s4_213, s5);
		goto l23033F46;
	}
	Eq_2 s0_17 = a5->t0010;
	s2_111 = a0;
	ra_108 = ra;
	if (a5 == null)
	{
		struct Eq_160174 * a0_21;
		struct Eq_160175 * a5_26;
		word32 s0_31;
		word32 a3_411;
		word32 a4_412;
		word32 a6_413;
		word32 s4_414;
		word32 s8_415;
		word32 mstatus_416;
		ra_108 = ble_ke_malloc(ra, s0_17, s1_13, 0x0C, 0x00, out s0_31, out s1_13, out a0_21, out a3_411, out a4_412, out a5_26, out a6_413, out s4_414, out s8_415, out mstatus_416);
		a0_21->dw0010 = s0_31;
		a0_21->b0008 = 0x00;
		a5_26->w0004 = 0x10;
		a5_26->w0006 = 0x08;
		a5_26->b0009 = 0x00;
		a5_26->b000A = 0x00;
	}
	struct Eq_151094 * a2_54;
	struct Eq_160161 * a4_56;
	word32 a3_410;
	struct Eq_160163 * a5_57;
	if (co_bdaddr_compare(0x420264BB, 0x230CB978, out a2_54, out a3_410, out a4_56, out a5_57) != 0x00)
	{
		ui32 a5_60 = (word32) a4_56->b000B;
		a5_57 = a5_60 & 0x01;
		if ((a5_60 & 0x01) != 0x00)
		{
			a5_57 = (struct Eq_160163 *) 0x01;
			s1_13.u0 = 0x12;
			if ((word32) a4_56->b0009 == 0x01)
				goto l23033F46;
		}
	}
	a5_57->b000A = (byte) (word32) *((word32) a0 + 1);
	struct Eq_152259 * a0_75 = llm_util_apply_bd_addr((word32) a5_57->b000B, a2_54);
	Eq_2 s0_109 = a0_75->t0010;
	word32 a5_82 = (word32) a0_75->b0009;
	if (a5_82 == 0x00 || a5_82 == 0x01)
	{
		struct Eq_160306 * a0_99;
		ra_108 = lld_scan_start(ra_108, s0_109, s1_13, a0_75, dwArg08, dwArg28, ra, dwArg90, dwArg94, dwArg9C, dwArgB8, out s0_109, out a0_99, out s2_111, out s3, out s5);
		a0_99->t0054 = s0_109;
		s1_13.u0 = 0x1F;
		if (a0_99 == null)
		{
l23033F46:
			0x00 = (int8) dwArg38;
			s1Out = s1_13;
			a0Out = s1_13;
			s2Out = s2_111;
			s3Out = s3;
			s5Out = s5;
			return ra_108;
		}
	}
	ui32 a0_134;
	Eq_2 s0_139;
	word32 a1_417;
	word32 a4_418;
	word32 s8_419;
	word32 s0_420;
	word32 s1_421;
	word32 a0_422;
	word32 a2_423;
	word32 a4_424;
	word32 a5_425;
	word32 s4_426;
	word32 mstatus_427;
	ra_108 = ble_ke_state_set(ble_ke_state_get(ra_108, s0_109, 0x00, out s0_139, out a0_134, out a1_417, out a4_418, out s8_419), s0_139, s1_13, 0x00, a0_134 & 0x00F0 | 1, dwArgF8, out s0_420, out s1_421, out a0_422, out a2_423, out a4_424, out a5_425, out s2_111, out s3, out s4_426, out mstatus_427);
	s1_13.u0 = 0x00;
	goto l23033F46;
}

// 23034002: Register up32 llm_wl_clr(Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      llm_init
//      hci_le_wl_mngt_cmd_handler
up32 llm_wl_clr(ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	up32 s0_15 = 0x00;
	do
	{
		llm_wlpriv_addr_set(s0_15, &g_t230CB990);
		s0_15 = (word32) (word16) (s0_15 + 0x01);
	} while (s0_15 != 0x04);
	up32 s0_31 = 0x00;
	do
	{
		llm_wlpub_addr_set(s0_31, &g_t230CB990);
		s0_31 = (word32) (word16) (s0_31 + 0x01);
	} while (s0_31 != 0x04);
	*(uint16 *) 0x2800822E = (word16) ((word32) *(uint16 *) 0x2800822E & ~0x02000000);
	*(uint16 *) 0x28008262 = (word16) ((word32) *(uint16 *) 0x28008262 & ~0x02000000);
	*(uint16 *) 0x28008296 = (word16) ((word32) *(uint16 *) 0x28008296 & ~0x02000000);
	g_b420264D1 = 0x00;
	g_b420264D2 = 0x00;
	s1Out = 0x04;
	s2Out = 0x230CC000;
	s3Out = 0x04;
	s4Out = dwArg04;
	return s0_31;
}

// 23034088: Register Eq_2 llm_init(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_127970) a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      rwble_init
//      rwble_reset
Eq_2 llm_init(Eq_2 ra, Eq_2 a0, struct Eq_127970 * a5, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 dwArgE8, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 ra_145;
	Eq_2 s0_100;
	Eq_2 s1_10 = 0x42026000;
	Eq_2 s3_104 = 0x42026000;
	if (a0 == 0x00)
	{
		Eq_2 s0_158;
		Eq_2 s1_159;
		word32 a0_508;
		word32 a3_509;
		word32 a4_510;
		word32 mstatus_511;
		word32 s4_512;
		ra_145 = ble_ke_event_callback_set(ble_ke_task_create(ra, 0x42026460, 0x42026000, a0, 587946556, out s0_158, out s1_159, out a0_508, out a3_509, out a4_510, out mstatus_511), s0_158, s1_159, 0x01, 0x230345AE, out s0_100, out s1_10, out s4_512);
	}
	else
	{
		Eq_2 s0_21 = a5->t0014;
		if (a5 != null)
		{
			struct Eq_160538 * a5_22 = *a0;
			if (a0 != 0x00)
			{
				word32 tp_533;
				word32 s0_534;
				word32 a2_535;
				word32 a3_536;
				word32 a4_537;
				word32 mstatus_538;
				ra = ble_ke_msg_free(ra, s0_21, 0x42026000, a0, s2, 0x42026000, s4, s5, out tp_533, out s0_534, out s1_10, out a0, out a2_535, out a3_536, out a4_537, out a5_22, out s2, out s3_104, out s4, out s5, out mstatus_538);
			}
			Eq_2 s0_44 = a5_22->t0014;
			if (a0 != 0x00)
			{
				word32 tp_549;
				word32 s0_550;
				word32 a2_551;
				word32 a3_552;
				word32 a4_553;
				word32 a5_554;
				word32 mstatus_555;
				ra = ble_ke_msg_free(ra, s0_44, s1_10, a0, s2, s3_104, s4, s5, out tp_549, out s0_550, out s1_10, out a0, out a2_551, out a3_552, out a4_553, out a5_554, out s2, out s3_104, out s4, out s5, out mstatus_555);
			}
			word32 tp_539;
			word32 s0_540;
			word32 a1_541;
			word32 a2_542;
			word32 a3_543;
			word32 a4_544;
			word32 a5_545;
			word32 a6_546;
			word32 s8_547;
			word32 mstatus_548;
			ra = ble_ke_free(ra, *((word32) a0 + 20), s1_10, a0, s2, s3_104, s4, s5, out tp_539, out s0_540, out s1_10, out a0, out a1_541, out a2_542, out a3_543, out a4_544, out a5_545, out a6_546, out s2, out s3_104, out s4, out s5, out s8_547, out mstatus_548);
		}
		s0_100 = *((word32) a0 + 16);
		if (a0 != 0x00)
		{
			word32 tp_556;
			word32 a0_557;
			word32 a1_558;
			word32 a2_559;
			word32 a3_560;
			word32 a4_561;
			word32 a5_562;
			word32 a6_563;
			word32 s8_564;
			word32 mstatus_565;
			ra = ble_ke_free(ra, s0_100, s1_10, a0, s2, s3_104, s4, s5, out tp_556, out s0_100, out s1_10, out a0_557, out a1_558, out a2_559, out a3_560, out a4_561, out a5_562, out a6_563, out s2, out s3_104, out s4, out s5, out s8_564, out mstatus_565);
		}
		ra_145 = lld_util_flush_list(lld_util_flush_list(ra, s1_10, (word32) s3_104 + 1128, s2, s3_104, s4, s5), s1_10, 0x42026478, s2, s3_104, s4, s5);
	}
	Eq_2 a0_189;
	struct Eq_64398 * a2_191;
	word32 s3_200;
	struct Eq_160664 * s0_206;
	word32 s1_566;
	word32 a4_567;
	word32 a5_568;
	word32 s2_569;
	word32 s4_570;
	word32 mstatus_571;
	Eq_2 ra_197 = ble_ke_state_set(ra_145, s0_100, s1_10, 0x00, 0x00, dwArgE8, out s0_206, out s1_566, out a0_189, out a2_191, out a4_567, out a5_568, out s2_569, out s3_200, out s4_570, out mstatus_571);
	s0_206->b005A = 0x03;
	s0_206->b004C = 0x00;
	s0_206->dw0054 = 0x00;
	s0_206->b0059 = 0x00;
	word32 a0_213;
	word32 s4_221;
	word32 a1_572;
	word32 a2_573;
	word32 a3_574;
	word32 a4_575;
	word32 a5_576;
	word32 s8_577;
	Eq_2 s1_218 = bl_rand(a0_189, a2_191, out a0_213, out a1_572, out a2_573, out a3_574, out a4_575, out a5_576, out s4_221, out s8_577);
	<anonymous> * a5_224 = g_ptr4200F3D4;
	s0_206->b0040 = (byte) a0_213;
	s0_206->b0041 = 0x00;
	s0_206->b0042 = 0x00;
	struct Eq_160736 * s0_234;
	word32 ra_237;
	word32 s5_249;
	a5_224();
	s0_234->b0036 = 0x1F;
	s0_234->dw0048 = 0x00;
	word32 s1_264;
	struct Eq_160748 * s2_265;
	word32 s3_266;
	word32 s4_267;
	struct Eq_160751 * s0_263 = llm_wl_clr(out s1_264, out s2_265, out s3_266, out s4_267);
	s0_263->w006A = 0x10;
	<anonymous> * a5_272 = s2_265->ptr03D4;
	s0_263->b00D3 = 0x00;
	s0_263->b0038 = (byte) s4_267;
	Eq_2 s0_280;
	word32 s1_281;
	word32 s3_282;
	Eq_2 ra_283;
	struct Eq_160779 * s2_284;
	word32 s4_285;
	word32 s5_295;
	a5_272();
	((word32) s0_280 + 88)->u0 = 0x00;
	*((word32) s0_280 + 16) = 0x00;
	word32 a0_578;
	word32 a1_579;
	Eq_2 ra_306 = ble_co_list_init(ra_283, s0_280, s3_282 + 1128, out a0_578, out a1_579);
	<anonymous> * a5_307 = s2_284->ptr03D4;
	*((word32) s0_280 + 20) = 0x00;
	uint32 a5_322;
	ptr32 mstatus_330;
	Eq_2 s1_315;
	Eq_2 s0_314;
	Eq_2 ra_317;
	Eq_2 s2_318;
	Eq_2 s3_316;
	Eq_2 s4_319;
	Eq_2 s5_329;
	a5_307();
	*((word32) s0_314 + 97) = (byte) a5_322;
	*((word32) s0_314 + 98) = (byte) (a5_322 >> 0x08);
	*((word32) s0_314 + 99) = (byte) (a5_322 >> 0x10);
	*((word32) s0_314 + 100) = (byte) (a5_322 >> 24);
	*((word32) s0_314 + 101) = (byte) (a5_322 >> 24);
	*((word32) s0_314 + 0x0066) = (byte) (a5_322 >> 24 << 16 >> 24);
	while (true)
	{
		word32 a5_531;
		Eq_2 a0_351;
		Eq_2 s0_356;
		word32 s8_532;
		word32 a1_530;
		Eq_2 ra_355 = ble_co_list_pop_front(ra_317, s0_314, (word32) s1_315 + 1120, out s0_356, out a0_351, out a1_530, out a5_531, out s8_532);
		if (a0_351 == 0x00)
			break;
		word32 a0_525;
		word32 a2_526;
		word32 a3_527;
		word32 a4_528;
		word32 a5_529;
		word32 tp_524;
		ra_317 = ble_ke_msg_free(ra_355, s0_356, s1_315, a0_351, s2_318, s3_316, s4_319, s5_329, out tp_524, out s0_314, out s1_315, out a0_525, out a2_526, out a3_527, out a4_528, out a5_529, out s2_318, out s3_316, out s4_319, out s5_329, out mstatus_330);
	}
	word32 a0_513;
	word32 a1_514;
	word32 a0_515;
	word32 a1_516;
	Eq_2 ra_371 = ble_co_list_init(ble_co_list_init(ra_355, s0_356, (word32) s1_315 + 1120, out a0_513, out a1_514), s0_356, &g_t42026478, out a0_515, out a1_516);
	word32 a3_519;
	word32 a4_520;
	word32 a5_521;
	word32 a6_522;
	word32 a7_523;
	word32 a1_517;
	word32 a2_518;
	memcpy((word32) s0_356 + 32, 587946636, 0x0C, out a1_517, out a2_518, out a3_519, out a4_520, out a5_521, out a6_522, out a7_523);
	*((word32) s0_356 + 55) = 0x01;
	*(union Eq_2 *) 0x0AF60090 = s0_356;
	((word32) s0_356 + 48)->u0 = 63684;
	*((word32) s0_356 + 110) = 0x00;
	((word32) s0_356 + 0x006C)->u0 = 0x00;
	((word32) s0_356 + 80)->u0 = 0x00;
	((word32) s0_356 + 78)->u2 = 0x00;
	s0Out = s1;
	s1Out = s1_315;
	s2Out = s2_318;
	s3Out = s3_316;
	s4Out = dwArg04;
	s5Out = s5_329;
	mstatusOut = mstatus_330;
	return ra_371;
}

// 23034230: Register Eq_2 llm_wl_dev_add(Register Eq_2 ra, Register Eq_155932 a1, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      llc_stop
//      llm_wl_dev_add_hdl
Eq_2 llm_wl_dev_add(Eq_2 ra, Eq_155932 a1, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	up32 a0_16;
	struct Eq_157109 * s0_24;
	ptr32 s1_25;
	ptr32 s2_26;
	ptr32 s3_27;
	ptr32 s4_28;
	ptr32 s5_29;
	word32 s6_85;
	Eq_2 ra_23 = llm_util_bd_addr_wl_position(ra, 0x230CB990, a1, dwArg0118, out s0_24, out s1_25, out a0_16, out s2_26, out s3_27, out s4_28, out s5_29, out s6_85);
	if (s1_25 != 0x00)
	{
		if (s1_25 == 0x01)
			llm_wlpriv_addr_set(a0_16, s0_24);
	}
	else
		llm_wlpub_addr_set(a0_16, s0_24);
	g_b420264D2 = (byte) ((word32) g_b420264D2 + 0x01);
	s1Out = s1_25;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	s5Out = s5_29;
	return ra_23;
}

// 2303427C: Register Eq_2 llm_wl_dev_rem(Register Eq_2 ra, Register Eq_2 a0, Register Eq_155932 a1, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      llm_util_bl_add
//      llm_wl_dev_rem_hdl
Eq_2 llm_wl_dev_rem(Eq_2 ra, Eq_2 a0, Eq_155932 a1, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out)
{
	up32 a0_11;
	word32 s0_19;
	ptr32 s1_20;
	ptr32 s2_21;
	ptr32 s3_22;
	ptr32 s5_24;
	ptr32 s6_25;
	word32 s4_98;
	Eq_2 ra_18 = llm_util_bd_addr_wl_position(ra, a0, a1, dwArg0118, out s0_19, out s1_20, out a0_11, out s2_21, out s3_22, out s4_98, out s5_24, out s6_25);
	if (a0_11 <= 0x03)
	{
		if (s0_19 == 0x01)
			llm_wlpriv_addr_set(a0_11, &g_t230CB990);
		else
			llm_wlpub_addr_set(a0_11, &g_t230CB990);
		g_b420264D2 = (byte) ((word32) g_b420264D2 + ~0x00);
	}
	s1Out = s1_20;
	s2Out = s2_21;
	s3Out = s3_22;
	s5Out = s5_24;
	s6Out = s6_25;
	return ra_18;
}

// 230342C0: Register Eq_2 llm_wl_dev_add_hdl(Register Eq_2 ra, Register Eq_2 a0, Register Eq_155932 a1, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_155932 s1Out, Register out ptr32 a0Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      hci_le_wl_mngt_cmd_handler
Eq_2 llm_wl_dev_add_hdl(Eq_2 ra, Eq_2 a0, Eq_155932 a1, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_155932 & s1Out, ptr32 & a0Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	if (a1 <= 0x01)
	{
		ptr32 a0_116;
		word32 a0_18;
		word32 s0_178;
		Eq_155932 s1_141;
		Eq_2 s2_144;
		ptr32 s3_148;
		ptr32 s5_156;
		Eq_2 ra_137 = llm_util_bd_addr_in_wl(ra, a0, a1, null, dwArg44, dwArg64, dwArgF8, out s0_178, out s1_141, out a0_18, out s2_144, out s3_148, out s5_156);
		if (a0_18 == 0x00)
		{
			a0_116 = 0x07;
			if ((word32) g_b420264D1 <= 0x03)
			{
				word32 a0_48;
				Eq_2 s0_54 = llm_util_bl_check(s2_144, s1_141, 0x02, dwArg64, dwArg84, dwArg0118, out s1_141, out a0_48, out s2_144, out s3_148);
				if (a0_48 != 11)
				{
					word32 s4_179;
					ra_137 = llm_wl_dev_add(ra_137, s1_141, dwArg0108, out s1_141, out s2_144, out s3_148, out s4_179, out s5_156);
				}
				*((word32) s0_54 + 113) = (byte) ((word32) *((word32) s0_54 + 113) + 0x01);
				a0_116 = 0x00;
			}
		}
		else
			a0_116 = 0x12;
		0x00 = (int8) dwArg38;
		s1Out = s1_141;
		a0Out = a0_116;
		s2Out = s2_144;
		s3Out = s3_148;
		s5Out = s5_156;
		return ra_137;
	}
	else
	{
		s1Out = s1;
		a0Out = 0x12;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		return ra;
	}
}

// 23034330: Register Eq_2 llm_wl_dev_rem_hdl(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_155932 a1, Stack Eq_2 dwArg34, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      hci_le_wl_mngt_cmd_handler
Eq_2 llm_wl_dev_rem_hdl(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_155932 a1, Eq_2 dwArg34, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	if (a1 <= 0x01)
	{
		ptr32 a0_107;
		byte bLoc11_93 = SLICE(s0, byte, 24);
		word32 a0_16;
		Eq_155932 s0_23;
		Eq_2 s1_135;
		ptr32 s2_139;
		ptr32 s3_143;
		ptr32 s5_149;
		Eq_2 ra_129 = llm_util_bd_addr_in_wl(ra, a0, a1, fp + ~0x10, dwArg34, dwArg54, dwArgE8, out s0_23, out s1_135, out a0_16, out s2_139, out s3_143, out s5_149);
		if (a0_16 != 0x00)
		{
			if ((word32) bLoc11_93 != 0x00)
			{
				word32 a0_170;
				llm_util_bl_check(s1_135, s0_23, 0x01, dwArg54, dwArg74, dwArg0108, out s1_135, out a0_170, out s2_139, out s3_143);
			}
			else
			{
				word32 s6_169;
				ra_129 = llm_wl_dev_rem(ra_129, s1_135, s0_23, dwArgF8, out s1_135, out s2_139, out s3_143, out s5_149, out s6_169);
			}
			g_b420264D1 = (byte) ((word32) g_b420264D1 + ~0x00);
			a0_107 = 0x00;
		}
		else
			a0_107 = 0x12;
		s1Out = s1_135;
		a0Out = a0_107;
		s2Out = s2_139;
		s3Out = s3_143;
		s5Out = s5_149;
		return ra_129;
	}
	else
	{
		s1Out = s1;
		a0Out = 0x12;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		return ra;
	}
}

