pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23034390: Register Eq_2 llm_create_con(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack ptr32 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_161081) s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      hci_le_create_con_cmd_handler
Eq_2 llm_create_con(Eq_2 ra, Eq_2 a0, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg84, Eq_2 dwArgF8, ptr32 dwArg0108, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a0Out, struct Eq_161081 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	struct Eq_161081 * s2_166 = &g_dw42026000;
	Eq_2 s0_10 = a0;
	Eq_2 a0_16;
	word32 s1_381;
	Eq_2 ra_163 = llc_util_get_free_conhdl(ra, &g_w420264A4, out s1_381, out a0_16);
	ptr32 s1_165 = 0x09;
	if (a0_16 != 0x00)
	{
l230343D0:
		0x00 = (int8) dwArg38;
		s1Out = s1_165;
		a0Out = s1_165;
		s2Out = s2_166;
		s3Out = s3;
		s5Out = s5;
		return ra_163;
	}
	Eq_2 s1_126 = a0_16;
	if ((word32) *((word32) a0 + 4) != 0x01)
	{
		ptr32 a0_41;
		s0_10 = llm_util_bl_check((word32) a0 + 6, (word32) *((word32) a0 + 5), 0x00, dwArg64, dwArg84, dwArg0118, out s1_126, out a0_41, out s2_166, out s3);
		if (a0_41 != 0x00)
		{
			s1_165 = a0_41;
			goto l230343D0;
		}
	}
	else if ((word32) g_b420264D2 == 0x00)
	{
		s1_165 = (word32) ((word32) g_b420264D1 < 1) + 11;
		goto l230343D0;
	}
	up32 a3_55 = (word32) *((word32) s0_10 + 2);
	up32 a4_56 = (word32) *s0_10;
	if (a4_56 < a3_55)
	{
l23034404:
		s1_165 = 0x12;
		goto l230343D0;
	}
	up32 a5_57 = (word32) *((word32) s0_10 + 0x0E);
	up32 a1_58 = (word32) *((word32) s0_10 + 16);
	if (a1_58 < a5_57 || ((word32) ((word16) (a3_55 + ~0x03)) > 0x03FFFFFC || ((word32) ((word16) (a4_56 + ~0x03)) > 0x03FFFFFC || ((word32) (*((word32) s0_10 + 24)) < (word32) (*((word32) s0_10 + 22)) || (a5_57 <= 0x05 || a1_58 > 0x00FFFC80)))))
		goto l23034404;
	ui32 a4_72 = (word32) *((word32) s0_10 + 20);
	if ((word32) (word16) (a4_72 + -0x0A) > 0x00FFFC76)
		goto l23034404;
	Eq_161197 a5_77 = (word32) *((word32) s0_10 + 18);
	if (a5_77 > 499 || ((word32) a5_77.u1 + 1) + a1_58 >= a4_72 << 2)
		goto l23034404;
	word32 a4_384;
	word32 a5_385;
	word32 a3_383;
	word32 a2_382;
	word32 a0_86 = co_bdaddr_compare(0x420264BB, 0x230CB978, out a2_382, out a3_383, out a4_384, out a5_385);
	ui32 a5_91 = (word32) *((word32) s0_10 + 0x0C);
	if (a0_86 != 0x00 && (a5_91 & 1) != 0x00)
		goto l23034404;
	s2_166 = &g_t42026460;
	if (((word32) g_b420264CF & 0x01) == 0x00)
	{
		if ((a5_91 & 0x02) != 0x00)
			goto l23034404;
	}
	else if ((a5_91 & 0x02) != 0x00)
		goto l230344B8;
	if (((word32) *((word32) s0_10 + 5) & 0x02) != 0x00)
		goto l23034404;
l230344B8:
	ui32 a0_112;
	Eq_2 s0_117;
	Eq_2 s1_141;
	struct Eq_161260 * s2_142;
	Eq_2 s3_143;
	Eq_2 s0_149;
	word32 a0_154;
	word32 a4_391;
	word32 mstatus_394;
	word32 s4_393;
	word32 a5_392;
	word32 s8_388;
	word32 a2_390;
	word32 a0_389;
	word32 a4_387;
	word32 a1_386;
	ra_163 = lld_con_start(ble_ke_state_set(ble_ke_state_get(ra_163, s0_10, 0x00, out s0_117, out a0_112, out a1_386, out a4_387, out s8_388), s0_117, s1_126, 0x00, a0_112 & 0x00F0 | 2, dwArgF8, out s0_149, out s1_141, out a0_389, out a2_390, out a4_391, out a5_392, out s2_142, out s3_143, out s4_393, out mstatus_394), s0_149, s1_141, s0_149, &g_t420262FC, (word32) s2_142->w0044, s3_143, dwArg0108, out s1_165, out a0_154, out s2_166, out s3, out s5);
	s2_166->dw0054 = a0_154;
	if (a0_154 == 0x00)
		s1_165 = 0x1F;
	goto l230343D0;
}

// 230344EA: void llm_encryption_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus)
// Called from:
//      llm_encryption_done
//      llm_enc_req_handler
//      hci_le_enc_cmd_handler
void llm_encryption_start(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus)
{
	*(ui32 *) 0x280000C4 = ((word32) *((word32) a0 + 3) << 8 | (word32) (*((word32) a0 + 2))) << 16 | ((word32) (*((word32) a0 + 1)) << 8 | (word32) (*a0));
	*(ui32 *) 0x280000C8 = ((word32) *((word32) a0 + 7) << 8 | (word32) (*((word32) a0 + 6))) << 16 | ((word32) (*((word32) a0 + 5)) << 8 | (word32) (*((word32) a0 + 4)));
	*(ui32 *) 0x280000CC = ((word32) *((word32) a0 + 11) << 8 | (word32) (*((word32) a0 + 0x0A))) << 16 | ((word32) (*((word32) a0 + 9)) << 8 | (word32) (*((word32) a0 + 8)));
	ui32 a3_47 = (word32) *((word32) a0 + 0x0C);
	ui32 a4_54 = (word32) *((word32) a0 + 0x0D) << 8 | a3_47;
	*(ui32 *) 0x280000D0 = ((word32) *((word32) a0 + 0x0F) << 8 | (word32) (*((word32) a0 + 0x0E))) << 16 | a4_54;
	<anonymous> * a5_58 = g_ptr4200F3D0;
	struct Eq_161434 * s0_61;
	a5_58();
	s0_61->dw00D4 = 110;
	s0_61->dw00C0 = 0x01;
	g_b420264B8 = 0x01;
	word32 a3_89;
	word32 a5_90;
	rwip_prevent_sleep_set(0x10, mstatus, out a3_89, out a5_90);
}

// 230345AE: void llm_encryption_done(Register Eq_2 ra, Register word32 s1, Register Eq_2 s5, Stack word32 dwArg0108)
void llm_encryption_done(Eq_2 ra, word32 s1, Eq_2 s5, word32 dwArg0108)
{
	struct Eq_161457 * a0_16;
	Eq_2 s0_21;
	word32 mstatus_347;
	word32 s8_345;
	word32 a0_346;
	word32 a1_343;
	word32 a5_344;
	Eq_2 ra_33 = ble_ke_event_clear(ble_co_list_pop_front(ra, 0x42026000, 0x42026460, out s0_21, out a0_16, out a1_343, out a5_344, out s8_345), s0_21, 0x01, out a0_346, out mstatus_347);
	if (a0_16 == null)
		return;
	Eq_2 s4_169;
	Eq_2 s2_167;
	Eq_2 s1_164;
	Eq_2 ra_162;
	Eq_2 s0_163;
	Eq_2 s3_168;
	ui32 a1_34 = (word32) a0_16->w0008;
	if ((a1_34 & 0x00FF) != 0x01)
	{
		word32 a0_105;
		word32 s0_115;
		struct Eq_161544 * s2_117;
		word32 s3_118;
		struct Eq_161546 * sp_130;
		Eq_2 s0_131;
		Eq_2 s3_133;
		Eq_2 ra_134;
		Eq_2 s1_135;
		Eq_2 s2_136;
		Eq_2 s4_144;
		word32 s10_252;
		word32 s11_253;
		word32 s6_254;
		word32 s7_255;
		word32 s9_256;
		word32 t0_257;
		word32 t4_258;
		s2_117->ptr03D0();
		*s1_135 = 0x00;
		word32 tp_179;
		word32 a0_374;
		word32 a2_375;
		word32 a3_376;
		word32 a4_377;
		word32 s6_378;
		word32 s7_379;
		word32 s9_380;
		word32 s10_381;
		word32 mstatus_382;
		ra_162 = hci_send_2_host(ra_134, s0_131, s1_135, s2_136, s3_133, s4_144, s5, sp_130->t0010, sp_130->t0014, sp_130->t0038, out tp_179, out s0_163, out s1_164, out a0_374, out a2_375, out a3_376, out a4_377, out s2_167, out s3_168, out s4_169, out s5, out s6_378, out s7_379, out s9_380, out s10_381, out mstatus_382);
	}
	else
	{
		word32 a0_41;
		word32 s0_51;
		struct Eq_161498 * s2_53;
		word32 s3_54;
		struct Eq_161500 * sp_66;
		Eq_2 s0_67;
		Eq_2 ra_70;
		Eq_2 s1_71;
		word32 a7_83;
		word32 s10_244;
		word32 s11_245;
		word32 s6_246;
		word32 s7_247;
		word32 s9_248;
		word32 t0_249;
		word32 t4_250;
		s2_53->ptr03D0();
		*s1_71 = 0x00;
		word32 t1_97;
		word32 tp_98;
		word32 a0_358;
		word32 a2_359;
		word32 a3_360;
		word32 a4_361;
		word32 a5_362;
		word32 mstatus_363;
		ra_162 = ble_ke_msg_send(ra_70, s0_67, s1_71, s1_71, sp_66->t0010, out tp_98, out t1_97, out s0_163, out s1_164, out a0_358, out a2_359, out a3_360, out a4_361, out a5_362, out mstatus_363);
	}
	union Eq_2 * a0_188;
	ptr32 mstatus_195;
	word32 tp_384;
	word32 s0_385;
	word32 s1_386;
	word32 a2_387;
	word32 a3_388;
	word32 a4_389;
	word32 a5_390;
	word32 s2_391;
	word32 s3_392;
	word32 s4_393;
	word32 s5_394;
	Eq_2 ra_196 = ble_ke_msg_free(ra_162, s0_163, s1_164, s3_168, s2_167, s3_168, s4_169, s5, out tp_384, out s0_385, out s1_386, out a0_188, out a2_387, out a3_388, out a4_389, out a5_390, out s2_391, out s3_392, out s4_393, out s5_394, out mstatus_195);
	Eq_2 s0_207 = *a0_188;
	if (a0_188 == null)
	{
		word32 a3_383;
		rwip_prevent_sleep_clear(0x10, mstatus_195, out a3_383);
		((word32) s0_207 + 88)->u0 = 0x00;
	}
	else
		llm_encryption_start(ra_196, s0_207, (char *) a0_188 + 0x0C, mstatus_195);
}

