pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23034674: void hci_fc_init()
// Called from:
//      hci_init
//      hci_reset
void hci_fc_init()
{
	g_ptr4200F3D4();
}

// 2303468A: Register Eq_161655 hci_fc_acl_buf_size_set(Register Eq_161655 a0, Register word32 a1)
// Called from:
//      hci_host_buf_size_cmd_handler
Eq_161655 hci_fc_acl_buf_size_set(Eq_161655 a0, word32 a1)
{
	Eq_161655 a5_12 = 0x12;
	if (a0 != 0x00 && a1 != 0x00)
	{
		a5_12.u0 = 0x11;
		if (a0 > 1020)
		{
			g_w42026536 = (word16) a0;
			g_w42026538 = (word16) a1;
			a5_12.u0 = 0x00;
		}
	}
	return a5_12;
}

// 230346B0: Register Eq_2 hci_fc_acl_en(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a0, Register out ptr32 s1Out, Register out ptr32 a0Out)
// Called from:
//      hci_set_ctrl_to_host_flow_ctrl_cmd_handler
Eq_2 hci_fc_acl_en(Eq_2 ra, Eq_2 s0, ptr32 a0, ptr32 & s1Out, ptr32 & a0Out)
{
	ptr32 a0_34;
	Eq_2 a0_13;
	word32 s0_72;
	word32 a1_73;
	word32 a4_74;
	word32 s8_75;
	Eq_2 ra_17 = ble_ke_state_get(ra, s0, 0x01, out s0_72, out a0_13, out a1_73, out a4_74, out s8_75);
	if (a0_13 == 0x007F)
	{
		word32 a0_24;
		word32 s0_29;
		word32 a1_76;
		word32 a4_77;
		word32 s8_78;
		ra_17 = ble_ke_state_get(ra_17, a0_13, 0x0101, out s0_29, out a0_24, out a1_76, out a4_77, out s8_78);
		if (a0_24 == s0_29)
		{
			g_b42026534 = (byte) a0;
			a0_34 = 0x00;
l230346CA:
			s1Out = a0;
			a0Out = a0_34;
			return ra_17;
		}
	}
	a0_34 = 0x0C;
	goto l230346CA;
}

// 230346EE: Register word32 hci_fc_host_nb_acl_pkts_complete(Register up32 a0)
// Called from:
//      hci_host_nb_cmp_pkts_cmd_handler
word32 hci_fc_host_nb_acl_pkts_complete(up32 a0)
{
	up32 a4_6 = (word32) g_w4202653C;
	word32 a3_12 = 0x00;
	if (a0 < a4_6)
		a3_12 = (word32) (word16) (a4_6 - a0);
	g_w4202653C = (word16) a3_12;
	return a3_12;
}

// 23034712: Register word32 hci_pack_bytes(Register word32 ra, Register (ptr32 (ptr32 Eq_161733)) a1, Register Eq_161731 a2, Register ptr32 a3, Register (ptr32 Eq_161733) a4, Register out ptr32 s0Out, Register out (ptr32 Eq_161733) s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_161733) a4Out, Register out Eq_161731 a5Out, Register out (ptr32 (ptr32 Eq_161733)) s2Out, Register out (ptr32 Eq_161733) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      hci_host_nb_cmp_pkts_cmd_pkupk
//      hci_le_adv_report_evt_pkupk
//      hci_le_dir_adv_report_evt_pkupk
word32 hci_pack_bytes(word32 ra, struct Eq_161733 ** a1, Eq_161731 a2, ptr32 a3, struct Eq_161733 * a4, ptr32 & s0Out, struct Eq_161733 & s1Out, ptr32 & a0Out, struct Eq_161733 & a4Out, union Eq_161731 & a5Out, struct Eq_161733 & s2Out, struct Eq_161733 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_161733 ** s2_15 = a1;
	struct Eq_161733 * a0_16 = *a1;
	ptr32 s0_17 = 0x01;
	word32 a5_19 = a1 + a4;
	if (a2 >= a5_19)
	{
		struct Eq_161733 * s1_21 = a4;
		s3 = a0_16;
		s0_17 = 0x00;
		if (a3 != 0x00)
		{
			struct Eq_161733 * a0_25 = *a1;
			<anonymous> * a5_27 = g_ptr4200F3D0;
			a5_27();
		}
		a5_19 = Mem13[s3 + 0x00:int32] + s1_21;
		s3->t0000 = a5_19;
		a4 = (struct Eq_161733 *) *s2_15;
		s1 = s1_21 + a4;
		*s2_15 = (struct Eq_161733 **) s1;
	}
	s0Out = s0_17;
	s1Out = s1;
	a0Out = s0_17;
	a4Out = a4;
	a5Out = a5_19;
	s2Out = s2_15;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return ra;
}

// 23034772: void hci_host_nb_cmp_pkts_cmd_pkupk(Register word32 ra, Register word32 a0, Register word32 a1, Register (ptr32 uint16) a2, Register word32 a3, Stack word32 dwArg0198)
void hci_host_nb_cmp_pkts_cmd_pkupk(word32 ra, word32 a0, word32 a1, uint16 * a2, word32 a3, word32 dwArg0198)
{
	if (a1 != 0x00)
	{
		ptr32 s7_36 = (word32) *a2 + a0;
		word32 a5_255;
		word32 s2_256;
		word32 s8_258;
		word32 s4_257;
		byte * s3_118;
		word32 a4_116;
		Eq_161731 s1_117;
		word32 a0_107;
		word32 s0_111;
		word32 ra_121 = hci_pack_bytes(ra, fp + -52, a1 + a3, s7_36, (struct Eq_161733 *) 0x01, out s0_111, out s1_117, out a0_107, out a4_116, out a5_255, out s2_256, out s3_118, out s4_257, out s8_258);
		if (a0_107 == 0x00)
		{
			uint32 a5_124 = 0x00;
			up32 s8_114 = 0x0E;
			while (true)
			{
				up32 a4_69 = a4_116 - s0_111;
				if (a5_124 >= (word32) (*s3_118) || s8_114 < a4_69)
					break;
				Eq_161731 s1_94;
				word32 s4_263;
				word32 s8_264;
				word32 a4_259;
				word32 a5_260;
				word32 s3_262;
				word32 s2_261;
				word32 ra_98 = hci_pack_bytes(ra_121, fp + -52, s1_117, s7_36, (struct Eq_161733 *) 0x02, out s0_111, out s1_94, out a0_107, out a4_259, out a5_260, out s2_261, out s3_262, out s4_263, out s8_264);
				if (a0_107 != 0x00)
				{
l23034822:
					break;
				}
				ui32 s2_112;
				word32 s4_266;
				word32 a5_265;
				ra_121 = hci_pack_bytes(ra_98, fp + -52, s1_94, s7_36, (struct Eq_161733 *) 0x02, out s0_111, out s1_117, out a0_107, out a4_116, out a5_265, out s2_112, out s3_118, out s4_266, out s8_114);
				if (a0_107 != 0x00)
					goto l23034822;
				a5_124 = s2_112 & 0x00FF;
			}
		}
		*a2 = (word16) (a0_107 - s0_111);
	}
	else
		*a2 = 0x0E;
	0x00 = dwArg0198;
}

// 23034830: void hci_le_adv_report_evt_pkupk(Register word32 ra, Register word32 a0, Register word32 a1, Register (ptr32 uint16) a2, Register word32 a3)
void hci_le_adv_report_evt_pkupk(word32 ra, word32 a0, word32 a1, uint16 * a2, word32 a3)
{
	if (a1 != 0x00)
	{
		ptr32 s1_27;
		if (a0 != 0x00)
			s1_27 = (word32) *a2 + a0;
		else
			s1_27 = fp + -33;
		word32 a0_46;
		Eq_161731 s2_51;
		ptr32 s1_56;
		word32 s0_393;
		word32 a4_394;
		word32 s4_395;
		word32 s8_396;
		int32 a5_105;
		struct Eq_161915 * s3_114;
		word32 ra_60 = hci_pack_bytes(ra, fp + -80, a1 + a3, s1_27, (struct Eq_161733 *) 0x01, out s0_393, out s1_56, out a0_46, out a4_394, out a5_105, out s2_51, out s3_114, out s4_395, out s8_396);
		if (a0_46 == 0x00)
		{
			word32 a0_69;
			word32 s8_369;
			word32 s4_368;
			word32 a4_367;
			word32 s0_366;
			ptr32 s1_222;
			Eq_161731 s2_217;
			word32 ra_102 = hci_pack_bytes(ra_60, fp + -80, s2_51, s1_56, (struct Eq_161733 *) 0x01, out s0_366, out s1_222, out a0_69, out a4_367, out a5_105, out s2_217, out s3_114, out s4_368, out s8_369);
			if (a0_69 == 0x00)
			{
				int32 s6_230 = 0x00;
				while (true)
				{
					a5_105 = (word32) s3_114->b0001;
					if (s6_230 >= a5_105)
						break;
					word32 a0_103;
					Eq_161731 s2_108;
					ptr32 s1_113;
					word32 s0_370;
					word32 s8_373;
					word32 s4_372;
					word32 a4_371;
					word32 ra_117 = hci_pack_bytes(ra_102, fp + -80, s2_217, s1_222, (struct Eq_161733 *) 0x01, out s0_370, out s1_113, out a0_103, out a4_371, out a5_105, out s2_108, out s3_114, out s4_372, out s8_373);
					if (a0_103 != 0x00)
					{
l23034946:
						break;
					}
					word32 a0_125;
					Eq_161731 s2_130;
					ptr32 s1_135;
					word32 s0_374;
					word32 a4_375;
					word32 s4_376;
					word32 s8_377;
					word32 ra_139 = hci_pack_bytes(ra_117, fp + -80, s2_108, s1_113, (struct Eq_161733 *) 0x01, out s0_374, out s1_135, out a0_125, out a4_375, out a5_105, out s2_130, out s3_114, out s4_376, out s8_377);
					if (a0_125 != 0x00)
						goto l23034946;
					word32 a0_147;
					Eq_161731 s2_152;
					ptr32 s1_157;
					word32 s0_378;
					word32 a4_379;
					word32 s4_380;
					word32 s8_381;
					word32 ra_161 = hci_pack_bytes(ra_139, fp + -80, s2_130, s1_135, (struct Eq_161733 *) 0x06, out s0_378, out s1_157, out a0_147, out a4_379, out a5_105, out s2_152, out s3_114, out s4_380, out s8_381);
					if (a0_147 != 0x00)
						goto l23034946;
					word32 a0_168;
					Eq_161731 s2_173;
					byte * s4_174;
					ptr32 s1_178;
					word32 s0_382;
					word32 a4_383;
					word32 s8_384;
					word32 ra_182 = hci_pack_bytes(ra_161, fp + -80, s2_152, s1_157, (struct Eq_161733 *) 0x01, out s0_382, out s1_178, out a0_168, out a4_383, out a5_105, out s2_173, out s3_114, out s4_174, out s8_384);
					if (a0_168 != 0x00)
						goto l23034946;
					word32 a0_190;
					Eq_161731 s2_195;
					ptr32 s1_200;
					word32 s0_385;
					word32 a4_386;
					word32 s4_387;
					word32 s8_388;
					word32 ra_204 = hci_pack_bytes(ra_182, fp + -80, s2_173, s1_178, (word32) *s4_174, out s0_385, out s1_200, out a0_190, out a4_386, out a5_105, out s2_195, out s3_114, out s4_387, out s8_388);
					if (a0_190 != 0x00)
						goto l23034946;
					word32 a0_212;
					word32 s0_389;
					word32 a4_390;
					word32 s4_391;
					word32 s8_392;
					ra_102 = hci_pack_bytes(ra_204, fp + -80, s2_195, s1_200, (struct Eq_161733 *) 0x01, out s0_389, out s1_222, out a0_212, out a4_390, out a5_105, out s2_217, out s3_114, out s4_391, out s8_392);
					if (a0_212 != 0x00)
						goto l23034946;
					++s6_230;
				}
			}
		}
		*a2 = (word16) (a5_105 - s3_114);
	}
	else
		*a2 = 0x00;
}

// 23034952: void hci_le_dir_adv_report_evt_pkupk(Register word32 ra, Register word32 a0, Register word32 a1, Register (ptr32 uint16) a2, Register word32 a3, Stack word32 dwArg0198)
void hci_le_dir_adv_report_evt_pkupk(word32 ra, word32 a0, word32 a1, uint16 * a2, word32 a3, word32 dwArg0198)
{
	if (a1 != 0x00)
	{
		ptr32 s1_27;
		if (a0 != 0x00)
			s1_27 = (word32) *a2 + a0;
		else
			s1_27 = fp + -0x0022;
		word32 a0_46;
		Eq_161731 s2_51;
		ptr32 s1_56;
		word32 s0_386;
		word32 a4_387;
		word32 s4_388;
		word32 s8_389;
		int32 a5_105;
		struct Eq_162147 * s3_114;
		word32 ra_60 = hci_pack_bytes(ra, fp + -56, a1 + a3, s1_27, (struct Eq_161733 *) 0x01, out s0_386, out s1_56, out a0_46, out a4_387, out a5_105, out s2_51, out s3_114, out s4_388, out s8_389);
		if (a0_46 == 0x00)
		{
			word32 a0_69;
			word32 s8_361;
			word32 s4_360;
			word32 s0_358;
			word32 a4_359;
			ptr32 s1_222;
			Eq_161731 s2_217;
			word32 ra_102 = hci_pack_bytes(ra_60, fp + -56, s2_51, s1_56, (struct Eq_161733 *) 0x01, out s0_358, out s1_222, out a0_69, out a4_359, out a5_105, out s2_217, out s3_114, out s4_360, out s8_361);
			if (a0_69 == 0x00)
			{
				int32 s6_230 = 0x00;
				while (true)
				{
					a5_105 = (word32) s3_114->b0001;
					if (s6_230 >= a5_105)
						break;
					word32 a0_103;
					Eq_161731 s2_108;
					ptr32 s1_113;
					word32 s0_362;
					word32 s8_365;
					word32 s4_364;
					word32 a4_363;
					word32 ra_117 = hci_pack_bytes(ra_102, fp + -56, s2_217, s1_222, (struct Eq_161733 *) 0x01, out s0_362, out s1_113, out a0_103, out a4_363, out a5_105, out s2_108, out s3_114, out s4_364, out s8_365);
					if (a0_103 != 0x00)
					{
l23034A64:
						break;
					}
					word32 a0_125;
					Eq_161731 s2_130;
					ptr32 s1_135;
					word32 s0_366;
					word32 a4_367;
					word32 s8_369;
					word32 s4_368;
					word32 ra_139 = hci_pack_bytes(ra_117, fp + -56, s2_108, s1_113, (struct Eq_161733 *) 0x01, out s0_366, out s1_135, out a0_125, out a4_367, out a5_105, out s2_130, out s3_114, out s4_368, out s8_369);
					if (a0_125 != 0x00)
						goto l23034A64;
					word32 a0_147;
					Eq_161731 s2_152;
					ptr32 s1_157;
					word32 a4_371;
					word32 s8_373;
					word32 s4_372;
					word32 s0_370;
					word32 ra_161 = hci_pack_bytes(ra_139, fp + -56, s2_130, s1_135, (struct Eq_161733 *) 0x06, out s0_370, out s1_157, out a0_147, out a4_371, out a5_105, out s2_152, out s3_114, out s4_372, out s8_373);
					if (a0_147 != 0x00)
						goto l23034A64;
					word32 a0_169;
					Eq_161731 s2_174;
					ptr32 s1_179;
					word32 s0_374;
					word32 a4_375;
					word32 s4_376;
					word32 s8_377;
					word32 ra_183 = hci_pack_bytes(ra_161, fp + -56, s2_152, s1_157, (struct Eq_161733 *) 0x01, out s0_374, out s1_179, out a0_169, out a4_375, out a5_105, out s2_174, out s3_114, out s4_376, out s8_377);
					if (a0_169 != 0x00)
						goto l23034A64;
					word32 a0_191;
					Eq_161731 s2_196;
					ptr32 s1_201;
					word32 s0_378;
					word32 a4_379;
					word32 s4_380;
					word32 s8_381;
					word32 ra_205 = hci_pack_bytes(ra_183, fp + -56, s2_174, s1_179, (struct Eq_161733 *) 0x06, out s0_378, out s1_201, out a0_191, out a4_379, out a5_105, out s2_196, out s3_114, out s4_380, out s8_381);
					if (a0_191 != 0x00)
						goto l23034A64;
					word32 a0_212;
					word32 s0_382;
					word32 a4_383;
					word32 s4_384;
					word32 s8_385;
					ra_102 = hci_pack_bytes(ra_205, fp + -56, s2_196, s1_201, (struct Eq_161733 *) 0x01, out s0_382, out s1_222, out a0_212, out a4_383, out a5_105, out s2_217, out s3_114, out s4_384, out s8_385);
					if (a0_212 != 0x00)
						goto l23034A64;
					++s6_230;
				}
			}
		}
		*a2 = (word16) (a5_105 - s3_114);
	}
	else
		*a2 = 0x00;
	0x00 = dwArg0198;
}

