pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23034A70: Register (ptr32 Eq_130689) hci_look_for_cmd_desc(Register (ptr32 Eq_130689) a0, Register out Eq_130690 a4Out, Register out Eq_130691 a5Out)
// Called from:
//      hci_send_2_controller
//      hci_build_cc_evt
//      bt_onchiphci_send
struct Eq_130689 * hci_look_for_cmd_desc(struct Eq_130689 * a0, union Eq_130690 & a4Out, union Eq_130691 & a5Out)
{
	Eq_130690 a4_16;
	struct Eq_130689 * a0_17;
	Eq_130691 a5_28 = a0 >> 0x0A;
	if (a0 >> 0x0A != 0x01)
	{
		if (a0 >> 0x0A != 0x03)
		{
			if (a0 >> 0x0A != 0x04)
			{
				if (a0 >> 0x0A != 0x05)
				{
					if (a0 >> 0x0A != 0x08)
					{
						a4_16.u0 = 63;
						a0_17 = null;
						if (a0 >> 0x0A != 63)
							goto l23034AE8;
					}
					else
						a0_17 = a0;
				}
				else
					a0_17 = a0;
			}
			else
				a0_17 = a0;
		}
		else
			a0_17 = a0;
	}
	else
		a0_17 = a0;
	a4_16.u0 = 587946648;
	Eq_130691 a3_27 = (word32) a0_17->ptr0004->w0002;
	a5_28.u0 = 0x00;
	if (a0_17 == null)
	{
		a4Out.u0 = 587946648;
		a5Out.u0 = 0x00;
		return a0_17;
	}
	while (a5_28 != a3_27)
	{
		ui32 a4_33 = (word32) a0_17->w0000;
		a4_16 = a4_33 & 0x03FF;
		if ((a4_33 & 0x03FF) == (a0 & 0x03FF))
			goto l23034AE8;
		++a0_17;
		a5_28 = (word32) (word16) ((word32) a5_28.u0 + 1);
	}
	a0_17 = null;
l23034AE8:
	a4Out = a4_16;
	a5Out = a5_28;
	return a0_17;
}

// 23034AEA: Register ui32 hci_look_for_evt_desc(Register ui32 a0, Register out (ptr32 Eq_162412) a3Out, Register out Eq_2 a5Out)
// Called from:
//      hci_build_evt
ui32 hci_look_for_evt_desc(ui32 a0, struct Eq_162412 & a3Out, union Eq_2 & a5Out)
{
	struct Eq_162412 * a3_14 = g_a230B5E28;
	ui32 a4_12;
	for (a4_12 = 0x00; a4_12 != 0x09; ++a4_12)
	{
		if ((word32) a3_14->b0000 == a0)
		{
			a3Out = a3_14;
			a5Out.u0 = <invalid>;
			return (a4_12 << 0x03) + 0x230B5E28;
		}
		++a3_14;
	}
	a3Out = a3_14;
	a5Out.u0 = <invalid>;
	return 0x00;
}

// 23034B16: Register ui32 hci_look_for_le_evt_desc(Register ui32 a0, Register out (ptr32 Eq_162435) a3Out, Register out Eq_2 a5Out)
// Called from:
//      hci_build_le_evt
ui32 hci_look_for_le_evt_desc(ui32 a0, struct Eq_162435 & a3Out, union Eq_2 & a5Out)
{
	struct Eq_162435 * a3_14 = g_a230B5E70;
	ui32 a4_12;
	for (a4_12 = 0x00; a4_12 != 0x0C; ++a4_12)
	{
		if ((word32) a3_14->b0000 == a0)
		{
			a3Out = a3_14;
			a5Out.u0 = <invalid>;
			return (a4_12 << 0x03) + 0x230B5E70;
		}
		++a3_14;
	}
	a3Out = a3_14;
	a5Out.u0 = <invalid>;
	return 0x00;
}

// 23034B42: Register Eq_2 hci_tl_init(Register Eq_2 ra, Register word32 a0)
// Called from:
//      hci_init
//      hci_reset
Eq_2 hci_tl_init(Eq_2 ra, word32 a0)
{
	Eq_2 s0_11 = 0x420131CC;
	if (a0 == 0x00)
	{
		<anonymous> * a5_14 = g_ptr4200F3D4;
		word32 s1_20;
		Eq_2 ra_21;
		a5_14();
		word32 a0_64;
		word32 a1_63;
		word32 a0_62;
		word32 a1_65;
		ra = ble_co_list_init(ble_co_list_init(ra_21, s0_11, s1_20 + 0x01CC, out a0_62, out a1_63), s0_11, (word32) s0_11 + 8, out a0_64, out a1_65);
		*((word32) s0_11 + 24) = 0x01;
	}
	((word32) s0_11 + 25)->u0 = 0x05;
	return ra;
}

// 23034B8C: Register (ptr32 Eq_162490) hci_util_read_array_size(Register (ptr32 Eq_162491) a3, Register (ptr32 Eq_162492) a5, Register out (ptr32 Eq_162490) a5Out)
// Called from:
//      hci_util_pack
//      hci_util_unpack
union Eq_162490 * hci_util_read_array_size(struct Eq_162491 * a3, union Eq_162492 * a5, union Eq_162490 & a5Out)
{
	*((char *) a5 + 1) = *a5;
	union Eq_162490 * a5_13 = (word32) (word16) ((word32) *a5 + -48);
	while (true)
	{
		Eq_162509 a0_16 = a3->b0000;
		if (((word32) a3->b0000 + -48 & 0x00FF) > 0x09)
			break;
		a3->t0001 = a0_16;
		a5_13 = (word32) (word16) ((char *) a5_13 + 0x0A + ((word32) a3->b0000 + -48));
	}
	a5Out = a5_13;
	return a5_13;
}

// 23034BD4: Register Eq_2 hci_util_pack(Register Eq_2 ra, Register (ptr32 Eq_162538) a0, Register (ptr32 uint16) a1, Register (ptr32 Eq_162491) a3, Register (ptr32 Eq_162541) a5, Register out (ptr32 Eq_162538) s0Out, Register out (ptr32 uint16) s1Out, Register out Eq_162544 a0Out, Register out Eq_162544 s2Out, Register out (ptr32 Eq_162538) s3Out, Register out ptr32 s5Out)
// Called from:
//      hci_build_cc_evt
//      hci_build_evt
//      hci_build_le_evt
Eq_2 hci_util_pack(Eq_2 ra, union Eq_162538 * a0, uint16 * a1, struct Eq_162491 * a3, struct Eq_162541 * a5, union Eq_162538 & s0Out, uint16 & s1Out, union Eq_162544 & a0Out, union Eq_162544 & s2Out, union Eq_162538 & s3Out, ptr32 & s5Out)
{
	union Eq_162538 * s3_160 = a0;
	uint16 * s5_161 = a1;
	union Eq_162538 * s4_169 = (char *) a0 + (word32) (*a1);
	union Eq_162538 * s0_108 = a0;
	union Eq_162538 * s1_112 = a0;
	Eq_162544 s2_115 = 0x00;
	union Eq_162492 * s6_162 = (union Eq_162492 *) 0x09;
	struct Eq_162541 * s7_163 = (struct Eq_162541 *) 72;
	Eq_162564 s8_123 = 0x01;
	struct Eq_162541 * s9_165 = (struct Eq_162541 *) 76;
	struct Eq_162541 * s10_114 = (struct Eq_162541 *) 66;
	struct Eq_162570 * s11_138 = &g_t4200F000;
	while (true)
	{
		word32 a5_51 = (word32) a5->t0000;
		if (a5_51 == 0x00)
			break;
		if (s2_115 != 0x00)
			goto l23034C22;
		union Eq_162492 * a5_59 = a5_51 + -48 & 0x00FF;
		Eq_162564 a4_125 = 0x00;
		if (s6_162 >= a5_59)
			a4_125 = hci_util_read_array_size(a3, a5_59, out a5_59);
		union Eq_162538 * a4_109;
		a3 = (struct Eq_162491 *) ((char *) a5_59 + 1);
		a5 = (word32) *a5_59;
		if (a5 == s7_163)
		{
			ui32 a5_81 = (char *) s1_112 + 1;
			a5 = a5_81 & ~0x01;
			a4_109 = (a5_81 & ~0x01) + 2;
			if (s3_160 != null)
			{
				if (s4_169 < a4_109)
					goto l23034D0E;
				uint32 a5_87 = (word32) *(a5_81 & ~0x01);
				*s0_108 = (union Eq_162538 *) (byte) a5_87;
				*((char *) s0_108 + 1) = (union Eq_162538 *) (byte) (a5_87 >> 8);
				a5 = a5_87 >> 8;
			}
			s0_108 = (union Eq_162538 *) ((char *) s0_108 + 2);
			goto l23034CCA;
		}
		if (a5 == s9_165)
		{
			ui32 a5_96 = (char *) s1_112 + 3;
			a5 = a5_96 & ~0x03;
			a4_109 = (a5_96 & ~0x03) + 4;
			if (s3_160 != null)
			{
				if (s4_169 < a4_109)
					goto l23034D0E;
				uint32 a5_99 = *(a5_96 & ~0x03);
				*s0_108 = (union Eq_162538 *) (byte) a5_99;
				*((char *) s0_108 + 1) = (union Eq_162538 *) (byte) (a5_99 >> 0x08);
				*((char *) s0_108 + 2) = (union Eq_162538 *) (byte) (a5_99 >> 0x10);
				*((char *) s0_108 + 3) = (union Eq_162538 *) (byte) (a5_99 >> 24);
				a3 = a5_99 >> 0x10;
				a5 = a5_99 >> 24;
			}
			s0_108 = (union Eq_162538 *) ((char *) s0_108 + 4);
l23034CCA:
			s1_112 = a4_109;
			continue;
		}
		if (a5 == s10_114)
		{
			union Eq_162538 * a1_116 = (char *) s1_112 + 1;
			if (s3_160 != null)
			{
				if (s4_169 < a1_116)
					goto l23034D0E;
				a5 = (word32) *s1_112;
				*s0_108 = (union Eq_162538 *) (byte) a5;
			}
			union Eq_162538 * a0_120 = (char *) s0_108 + 1;
			if (s8_123 >= a4_125)
			{
				s0_108 = a0_120;
				s1_112 = a1_116;
				continue;
			}
			Eq_162564 a4_180;
			struct Eq_162491 * a3_177;
			struct Eq_162541 * a5_174;
			s1_112 += a4_125;
			if (s3_160 != null)
			{
				if (s4_169 < s1_112)
				{
					s0_108 = a0_120;
					s1_112 = a1_116;
l23034D0E:
					s2_115.u0 = 0x01;
					continue;
				}
				s11_138->ptr03D0();
				a4_125 = a4_180;
				a5 = a5_174;
				a3 = a3_177;
			}
			s0_108 += a4_125;
			continue;
		}
		s2_115.u0 = 0x03;
	}
	if (s2_115 == 0x00)
	{
		s0_108 -= s3_160;
		*s5_161 = (word16) s0_108;
	}
l23034C22:
	s0Out = s0_108;
	s1Out = dwArg28;
	a0Out = s2_115;
	s2Out = s2_115;
	s3Out = s3_160;
	s5Out = s4;
	return dwArg68;
}

// 23034D20: Register Eq_2 hci_util_unpack(Register Eq_2 ra, Register (ptr32 Eq_162717) a0, Register Eq_2 a1, Register (ptr32 uint16) a2, Register (ptr32 Eq_162491) a3, Register (ptr32 Eq_162491) a5, Stack word32 dwArg010C, Register out (ptr32 uint16) s0Out, Register out ptr32 s1Out, Register out Eq_162725 a0Out, Register out Eq_162725 s2Out, Register out (ptr32 uint16) s3Out)
// Called from:
//      bt_onchiphci_send
Eq_2 hci_util_unpack(Eq_2 ra, struct Eq_162717 * a0, Eq_2 a1, uint16 * a2, struct Eq_162491 * a3, struct Eq_162491 * a5, word32 dwArg010C, uint16 & s0Out, ptr32 & s1Out, union Eq_162725 & a0Out, union Eq_162725 & s2Out, uint16 & s3Out)
{
	struct Eq_162717 * s4_159 = a0;
	Eq_2 s0_135 = a1;
	uint16 * s3_156 = a2;
	word32 s11_174 = a1 + a3;
	struct Eq_162491 * s9_181 = a0 + (word32) (*a2) / 2;
	word32 s5_173 = (word32) (a1 != 0x00);
	if (a0 == null)
		s5_173 = 0x00;
	struct Eq_162717 * s1_117 = a0;
	Eq_162725 s2_119 = 0x00;
	Eq_162564 s6_128 = 0x01;
	struct Eq_162491 * s7_100 = (struct Eq_162491 *) 76;
	struct Eq_162752 * s8_150 = &g_t4200F000;
	while (true)
	{
		word32 a5_54 = (word32) a5->b0000;
		if (a5_54 == 0x00 || s2_119 != 0x00)
			break;
		union Eq_162492 * a5_57 = a5_54 + -48 & 0x00FF;
		Eq_162564 s10_130 = 0x00;
		if (a5_57 <= (union Eq_162492 *) 0x09)
			s10_130 = hci_util_read_array_size(a3, a5_57, out a5_57);
		a3 = (struct Eq_162491 *) ((char *) a5_57 + 1);
		a5 = (word32) *a5_57;
		if (a5 == (struct Eq_162491 *) 72)
		{
			ui32 a5_78 = &s1_117->b0000 + 1;
			a5 = a5_78 & ~0x01;
			Eq_2 a2_82 = (word32) s0_135 + 2;
			if (s5_173 != 0x00)
			{
				if (s11_174 < a2_82)
					goto l23034E98;
				a3 = (a5_78 & ~0x01) + 2;
				if (s9_181 < a3)
					goto l23034EA0;
				a3 = (word32) *((word32) s0_135 + 1) << 8 | (word32) (*s0_135);
				*(a5_78 & ~0x01) = (word16) a3;
			}
			s1_117 = (a5_78 & ~0x01) + 2;
			s0_135 = a2_82;
			continue;
		}
		Eq_2 a1_103;
		if (a5 == s7_100)
		{
			ui32 a3_101 = &s1_117->b0000 + 3;
			a3 = a3_101 & ~0x03;
			a1_103 = (word32) s0_135 + 4;
			if (s5_173 != 0x00)
			{
				if (s11_174 < a1_103)
					goto l23034E98;
				a5 = (a3_101 & ~0x03) + 4;
				if (s9_181 < a5)
					goto l23034EA0;
				a5 = ((word32) *((word32) s0_135 + 3) << 8 | (word32) (*((word32) s0_135 + 2))) << 16 | ((word32) (*((word32) s0_135 + 1)) << 8 | (word32) (*s0_135));
				a5->b0000 = (byte) (a3_101 & ~0x03);
			}
			s1_117 = (a3_101 & ~0x03) + 4;
			goto l23034E88;
		}
		a3 = (struct Eq_162491 *) 66;
		if (a5 == (struct Eq_162491 *) 66)
		{
			a1_103 = (word32) s0_135 + 1;
			if (s5_173 != 0x00)
			{
				if (s11_174 < a1_103)
					goto l23034E98;
				a5 = (struct Eq_162491 *) (&s1_117->b0000 + 1);
				if (s9_181 < a5)
					goto l23034EA0;
				a5 = (word32) *s0_135;
				s1_117->b0000 = (byte) a5;
			}
			struct Eq_162717 * a0_125 = &s1_117->b0000 + 1;
			if (s6_128 >= s10_130)
			{
				s1_117 = a0_125;
l23034E88:
				s0_135 = a1_103;
				continue;
			}
			struct Eq_162491 * a5_188;
			s0_135 += s10_130;
			if (s5_173 != 0x00)
			{
				if (s11_174 < s0_135)
				{
					s1_117 = a0_125;
					s0_135 = a1_103;
l23034E98:
					s2_119.u0 = 0x01;
					continue;
				}
				a5 = s1_117 + s10_130;
				if (s9_181 < a5)
				{
					s1_117 = a0_125;
					s0_135 = a1_103;
l23034EA0:
					s2_119.u0 = 0x02;
					continue;
				}
				s8_150->ptr03D0();
				a5 = a5_188;
			}
			s1_117 += s10_130;
			continue;
		}
		s2_119.u0 = 0x03;
	}
	if (s11_174 < s0_135)
		s2_119.u0 = 0x01;
	ptr32 s1_207 = dwLoc4C - s4_159;
	*s3_156 = (word16) s1_207;
	0x00 = dwArg010C;
	s0Out = dwArgCC;
	s1Out = s1_207;
	a0Out = s2_119;
	s2Out = s2_119;
	s3Out = s3_156;
	return dwLoc08;
}

// 23034EA4: void hci_build_cc_evt(Register Eq_2 ra, Register (ptr32 Eq_162916) a0)
void hci_build_cc_evt(Eq_2 ra, struct Eq_162916 * a0)
{
	struct Eq_130689 * s1_13 = (word32) a0->w0008;
	word16 wLoc12_83 = (word16) (word32) a0->w000A;
	struct Eq_162916 * s0_15 = a0;
	struct Eq_162541 * a5_22;
	word32 a4_140;
	if (hci_look_for_cmd_desc(s1_13, out a4_140, out a5_22) != 0x00)
	{
		struct Eq_162491 * a3_24 = (word32) wLoc12_83;
		if (a3_24 != null)
		{
			struct Eq_162943 * a0_29 = a5_22->ptr0008;
			if (a5_22 != null)
			{
				if ((int32) a0_29->b0002 >= 0x00)
				{
					word32 s5_145;
					word32 s3_144;
					word32 s2_143;
					word32 a0_142;
					word32 s1_141;
					hci_util_pack(ra, &a0->b000C, fp + ~0x11, a3_24, a5_22, out s0_15, out s1_141, out a0_142, out s2_143, out s3_144, out s5_145);
				}
				else
					a5_22();
			}
l23034EEA:
			s0_15->w000A = (word16) (word32) wLoc12_83;
			return;
		}
	}
	if (s1_13 != null)
		a0->b000C = 0x01;
	goto l23034EEA;
}

// 23034F14: Register Eq_2 hci_build_evt(Register Eq_2 ra, Register (ptr32 Eq_130614) a0, Register out (ptr32 Eq_130614) s0Out, Register out (ptr32 uint16) s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      lld_pdu_tx_flush
Eq_2 hci_build_evt(Eq_2 ra, struct Eq_130614 * a0, struct Eq_130614 & s0Out, uint16 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word16 wLoc12_76 = (word16) (word32) a0->w000A;
	struct Eq_130614 * s0_104 = a0;
	uint16 * s1_13 = &a0->w000A;
	struct Eq_162491 * a3_19;
	struct Eq_162541 * a5_21;
	if (hci_look_for_evt_desc((word32) a0->b0008, out a3_19, out a5_21) != 0x00)
	{
		struct Eq_163010 * a0_22 = a5_21->ptr0004;
		if (a5_21 != null)
		{
			if ((word32) a0_22->b0002 == 0x00)
			{
				word32 a0_141;
				ra = hci_util_pack(ra, &a0->w000A + 1, fp + ~0x11, a3_19, a5_21, out s0_104, out s1_13, out a0_141, out s2, out s3, out s5);
			}
			else
				a5_21();
		}
		s0_104->w000A = (word16) (word32) wLoc12_76;
	}
	s0Out = s0_104;
	s1Out = s1_13;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	return ra;
}

// 23034F70: void hci_build_le_evt(Register Eq_2 ra, Register (ptr32 Eq_163042) a0)
void hci_build_le_evt(Eq_2 ra, struct Eq_163042 * a0)
{
	word16 wLoc12_78 = (word16) (word32) a0->w000A;
	struct Eq_163042 * s0_12 = a0;
	struct Eq_162491 * a3_19;
	struct Eq_162541 * a5_21;
	if (hci_look_for_le_evt_desc((word32) a0->b000C, out a3_19, out a5_21) != 0x00)
	{
		struct Eq_163010 * a0_22 = a5_21->ptr0004;
		if (a5_21 != null)
		{
			ui32 a0_35;
			if ((word32) a0_22->b0002 == 0x00)
			{
				word32 s1_138;
				word32 s2_139;
				word32 s3_140;
				word32 s5_141;
				hci_util_pack(ra, &a0->b000C, fp + ~0x11, a3_19, a5_21, out s0_12, out s1_138, out a0_35, out s2_139, out s3_140, out s5_141);
			}
			else
			{
				ui32 a0_29;
				a5_21();
				a0_35 = a0_29 & 0x00FF;
			}
			if (a0_35 == 0x00)
				s0_12->w000A = (word16) (word32) wLoc12_78;
		}
	}
}

// 23034FD2: Register (ptr32 Eq_163103) hci_build_acl_rx_data(Register (ptr32 Eq_163103) a0)
// Called from:
//      bt_onchiphci_hanlde_rx_acl
struct Eq_163103 * hci_build_acl_rx_data(struct Eq_163103 * a0)
{
	struct Eq_163104 * a0_11 = em_buf_rx_buff_addr_get((word32) a0->b0012);
	int32 a5_22 = (int32) (word16) ((word32) a0->b000E << 0x0C | (word32) ((word12) ((word32) a0->w000C)));
	a0_11->bFFFFFFFC = (byte) a5_22;
	a0_11->bFFFFFFFD = (byte) ((word32) (word16) a5_22 >> 8);
	uint32 a5_28 = (word32) a0->w0010;
	a0_11->bFFFFFFFE = (byte) a5_28;
	a0_11->bFFFFFFFF = (byte) (a5_28 >> 8);
	return &a0_11->bFFFFFFFC;
}

// 2303501C: Register Eq_2 ble_ke_queue_extract(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register word32 a1, Register Eq_2 a2, Register ptr32 s2, Register Eq_2 s3, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out (ptr32 Eq_136957) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 (ptr32 word32)) a4Out, Register out (ptr32 code) s2Out, Register out ptr32 s3Out)
// Called from:
//      ble_ke_timer_set
//      ble_ke_timer_clear
//      ble_ke_state_set
Eq_2 ble_ke_queue_extract(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, word32 a1, Eq_2 a2, ptr32 s2, Eq_2 s3, Eq_2 dwArg0128, ptr32 & s0Out, struct Eq_136957 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, word32 & a4Out, <anonymous> & s2Out, ptr32 & s3Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_136957 ** a5_28;
	struct Eq_163160 * sp_27;
	ptr32 a0_34;
	ptr32 a1_101;
	ptr32 a3_102;
	word32 ** a4_105;
	Eq_2 ra_109;
	struct Eq_136957 * s1_111;
	<anonymous> * s2_112;
	ptr32 s3_114;
	a5_5();
	if (a0_34 == 0x00)
	{
		s1_111 = (struct Eq_136957 *) *a5_28;
		sp_27->ptr0084 = a5_28;
		struct Eq_136957 *** s0_42 = null;
		while (true)
		{
			word32 a2_46 = sp_27->dw0044;
			if (a0_34 == 0x00)
				break;
			struct Eq_136957 *** a5_55;
			struct Eq_136957 * s0_60;
			s2_112();
			if (a0_34 != 0x00)
			{
				struct Eq_136957 ** a5_72 = *a5_55;
				if (s0_60 != null)
					*a5_72 = (struct Eq_136957 **) s0_60;
				else
					*a5_72 = (struct Eq_136957 **) s1_111;
				word32 * a5_79 = *a4_105;
				if (a4_105 != null)
					*a5_79 = 0x00;
				else
					s0_60->ptr0004 = s1_111;
				break;
			}
			sp_27->ptr0084 = (struct Eq_136957 **) *a5_55;
			s0_42 = a5_55;
		}
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_111;
	a0Out = a0_34;
	a1Out = a1_101;
	a3Out = a3_102;
	a4Out = a4_105;
	s2Out = s2_112;
	s3Out = s3_114;
	return ra_109;
}

// 23035086: Register word32 ble_ke_queue_insert(Register word32 ra, Register word32 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register word32 a2, Register word32 s2, Register word32 s3, Register word32 s4, Register out Eq_2 s0Out, Register out (ptr32 Eq_137023) s1Out, Register out (ptr32 Eq_137024) s2Out, Register out (ptr32 Eq_137023) s3Out, Register out ptr32 s4Out)
// Called from:
//      ble_ke_timer_set
word32 ble_ke_queue_insert(word32 ra, word32 s0, Eq_2 s1, word32 a0, Eq_2 a1, word32 a2, word32 s2, word32 s3, word32 s4, union Eq_2 & s0Out, struct Eq_137023 & s1Out, struct Eq_137024 & s2Out, struct Eq_137023 & s3Out, ptr32 & s4Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 a0_37;
	<anonymous> * s4_33;
	word32 a2_39;
	struct Eq_137023 * s0_31;
	word32 ra_110;
	struct Eq_137023 * s1_112;
	struct Eq_137024 * s2_113;
	struct Eq_137023 * s3_114;
	a5_5();
	if (a0_37 == 0x00)
	{
		s3_114 = null;
		for (s1_112 = s2_113->ptr0000; s1_112 != null; s1_112 = s1_112->ptr0000)
		{
			word32 a0_65;
			s4_33();
			if (a0_65 != 0x00)
				goto l230350C8;
			s3_114 = s1_112;
		}
		s2_113->ptr0004 = s0_31;
l230350C8:
		s1_112->ptr0000 = s0_31;
		if (s3_114 != null)
			s3_114->ptr0000 = s0_31;
		else
			s2_113->ptr0000 = s0_31;
	}
	s0Out = s1;
	s1Out = s1_112;
	s2Out = s2_113;
	s3Out = s3_114;
	s4Out = dwArg04;
	return ra_110;
}

// 230350E8: void ble_cmp_dest_id(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 a0, Register word32 a1)
void ble_cmp_dest_id(word32 ra, word32 s0, word32 s1, word32 a0, word32 a1)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 a0_25;
	a5_5();
}

// 23035122: Register Eq_2 ble_ke_task_saved_update(Register Eq_2 ra, Register Eq_2 s0, Register Eq_138800 s1, Register uint32 a0, Register (ptr32 Eq_138805) s2, Register (ptr32 Eq_138806) s3, Register ptr32 s4, Stack Eq_2 dwArg0108, Register out Eq_138800 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      ble_ke_state_set
Eq_2 ble_ke_task_saved_update(Eq_2 ra, Eq_2 s0, Eq_138800 s1, uint32 a0, struct Eq_138805 * s2, struct Eq_138806 * s3, ptr32 s4, Eq_2 dwArg0108, union Eq_138800 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 s0_25;
	Eq_2 a0_107;
	ptr32 a4_104;
	ptr32 a5_111;
	ptr32 mstatus_112;
	Eq_2 ra_113;
	Eq_2 s1_114;
	ptr32 s2_115;
	Eq_2 s3_116;
	a5_5();
	if (a0_107 == 0x00)
	{
		s3_116.u0 = 0x23035000;
		s2_115 = 0x42026000;
		while (true)
		{
			Eq_2 s0_59;
			word32 a3_152;
			word32 a1_151;
			ra_113 = ble_ke_queue_extract(ra_113, s0_25, s1_114, 0x420262AC, (byte) s3_116.u0 + 232, s0_25, s2_115, s3_116, dwArg0108, out s0_59, out s1_114, out a0_107, out a1_151, out a3_152, out a4_104, out s2_115, out s3_116);
			if (a0_107 == 0x00)
				break;
			Eq_2 s1_76 = __csrrs(mstatus_112, 0x00);
			__csrrc(mstatus_112, 0x08);
			word32 a5_154;
			word32 a0_153;
			Eq_2 ra_83 = ble_co_list_push_back(ra_113, s0_59, s1_76, s2_115 + 676, a0_107, out s1_114, out a0_153, out a5_154);
			__csrrw(mstatus_112, 0x00);
			word32 t1_155;
			word32 a0_156;
			word32 a1_157;
			word32 a2_158;
			word32 a3_159;
			word32 a4_160;
			word32 a5_161;
			ra_113 = ble_ke_event_set(ra_83, s0_59, 0x02, dwLoc10, out t1_155, out s0_25, out a0_156, out a1_157, out a2_158, out a3_159, out a4_160, out a5_161, out mstatus_112);
		}
	}
	s0Out = s1;
	s1Out = s1_114;
	a0Out = a0_107;
	a2Out = dwArg48;
	a4Out = a4_104;
	a5Out = a5_111;
	s2Out = s2_115;
	s3Out = s3_116;
	s4Out = dwArg04;
	mstatusOut = mstatus_112;
	return ra_113;
}

// 2303518C: Register Eq_2 ble_ke_handler_search(Register Eq_2 ra, Register (ptr32 byte) s0, Register (ptr32 Eq_163369) s1, Register ptr32 a0, Register (ptr32 Eq_163371) a1, Register out Eq_163372 s0Out, Register out (ptr32 Eq_163373) s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 Eq_163369)) a1Out, Register out Eq_163376 a5Out)
// Called from:
//      ble_ke_task_handler_get
Eq_2 ble_ke_handler_search(Eq_2 ra, byte * s0, struct Eq_163369 * s1, ptr32 a0, struct Eq_163371 * a1, union Eq_163372 & s0Out, struct Eq_163373 & s1Out, ptr32 & a0Out, struct Eq_163369 & a1Out, union Eq_163376 & a5Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_163373 * s1_23;
	Eq_2 ra_24;
	struct Eq_163369 ** a1_26;
	struct Eq_163373 * a3_31;
	ptr32 a0_25;
	Eq_163376 a5_21;
	Eq_163372 s0_22;
	a5_5();
	if (a0_25 == 0x00)
	{
		a1_26 = (struct Eq_163369 **) ~0x00;
		a5_21 = (word32) *((word32) s0_22 + 4) + ~0x00;
		while (a5_21 != ~0x00)
		{
			s0_22 = a3_31->a0000[0];
			a3_31 = (word32) a3_31[a5_21 * 0x08 / 16];
			if (s1_23 == a3_31 || a3_31 == (struct Eq_163373 *) 0x0FFFFFFF)
				goto l230351AC;
			a5_21 = (word32) a5_21.u0 - 1;
		}
		a0_25 = 0x00;
	}
l230351AC:
	s0Out = s0_22;
	s1Out = s1_23;
	a0Out = a0_25;
	a1Out = a1_26;
	a5Out = a5_21;
	return ra_24;
}

// 230351E6: Register Eq_2 ble_ke_task_handler_get(Register Eq_2 ra, Register (ptr32 Eq_163412) s0, Register word32 s1, Register word32 a0, Register word32 a1, Register Eq_2 s2, Register out (ptr32 byte) s0Out, Register out (ptr32 Eq_163369) s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      ble_ke_task_schedule
Eq_2 ble_ke_task_handler_get(Eq_2 ra, struct Eq_163412 * s0, word32 s1, word32 a0, word32 a1, Eq_2 s2, byte & s0Out, struct Eq_163369 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s4Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	ptr32 s2_26;
	struct Eq_163371 * a1_30;
	ptr32 a0_101;
	Eq_2 ra_109;
	byte * s0_110;
	struct Eq_163369 * s1_111;
	a5_5();
	if (a0_101 == 0x00)
	{
		struct Eq_163433 * a5_42 = (word32) s1_111->w000E;
		if (a5_42 != null)
		{
			s0_110 >>= 8;
			if (s0_110 >> 8 < a5_42)
			{
				s1_111 = a1_30->ptr0000;
				if (a1_30 != null)
				{
					byte * s0_47 = a5_42 + (s0_110 >> 8) / 0x0C;
					ra_109 = ble_ke_handler_search(ra_109, s0_47, a5_42->ptr0008, s2_26, a1_30 + ((word32) (*s0_47) << 3) / 8, out s0_110, out s1_111, out a0_101, out a1_30, out a5_42);
				}
				if (a5_42 == null)
				{
					s1_111 = a1_30->ptr0004;
					if (a1_30 != null)
					{
						word32 a5_140;
						word32 a1_139;
						ra_109 = ble_ke_handler_search(ra_109, s0_110, s1_111, s2_26, a1_30, out s0_110, out s1_111, out a0_101, out a1_139, out a5_140);
					}
				}
			}
		}
	}
	s0Out = s0_110;
	s1Out = s1_111;
	a0Out = a0_101;
	s2Out = s2_26;
	s4Out = dwArg04;
	return ra_109;
}

