pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303525E: void ble_ke_task_schedule(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 s2, Register Eq_2 s3, Register Eq_2 s5, Stack word32 dwArg38)
void ble_ke_task_schedule(word32 ra, word32 s0, word32 s1, word32 s2, Eq_2 s3, Eq_2 s5, word32 dwArg38)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 ra_18;
	Eq_2 s0_19;
	word32 a0_22;
	ptr32 mstatus_105;
	a5_5();
	if (a0_22 != 0x00)
	{
l230352DE:
		0x00 = dwArg38;
		return;
	}
	Eq_2 s2_28 = __csrrs(mstatus_105, 0x00);
	__csrrc(mstatus_105, 0x08);
	Eq_2 a0_32;
	word32 s0_225;
	word32 a1_226;
	word32 a5_227;
	word32 s8_228;
	Eq_2 ra_106 = ble_co_list_pop_front(ra_18, s0_19, 0x420262A4, out s0_225, out a0_32, out a1_226, out a5_227, out s8_228);
	__csrrw(mstatus_105, 0x00);
	Eq_2 s1_107 = 0x42026000;
	if (a0_32 == 0x00)
	{
l230352C6:
		Eq_2 s0_128 = __csrrs(mstatus_105, 0x00);
		__csrrc(mstatus_105, 0x08);
		if (*((word32) s1_107 + 676) == 0x00)
		{
			word32 a0_242;
			ble_ke_event_clear(ra_106, s0_128, 0x02, out a0_242, out mstatus_105);
		}
		__csrrw(mstatus_105, 0x00);
		goto l230352DE;
	}
	else
	{
		*(union Eq_2 *) ~0x00 = a0_32;
		word32 a0_43;
		struct Eq_163412 * s0_47;
		ra_106 = ble_ke_is_free(ra_106, a0_32, a0_32, out s0_47, out a0_43);
		if (a0_43 != 0x00)
			goto l230352C6;
		<anonymous> * a0_52;
		Eq_2 s0_60;
		Eq_2 s2_62;
		Eq_2 s4_63;
		ra_106 = ble_ke_task_handler_get(ra_106, s0_47, 0x42026000, (word32) s0_47->w0004, (word32) s0_47->w0006, s2_28, out s0_60, out s1_107, out a0_52, out s2_62, out s4_63);
		if (a0_52 != null)
		{
			word32 a0_77;
			a0_52();
			if (a0_77 != 0x00)
			{
				if (a0_77 == 0x02)
				{
					word32 a0_240;
					word32 a5_241;
					ra_106 = ble_co_list_push_back(ra_106, s0_60, s1_107, 0x420262AC, s0_60, out s1_107, out a0_240, out a5_241);
				}
				goto l230352C6;
			}
		}
		word32 a5_235;
		word32 a4_234;
		word32 a3_233;
		word32 s5_239;
		word32 s4_238;
		word32 s3_237;
		word32 s2_236;
		word32 tp_229;
		word32 s0_230;
		word32 a0_231;
		word32 a2_232;
		ra_106 = ble_ke_msg_free(ra_106, s0_60, s1_107, s0_60, s2_62, s3, s4_63, s5, out tp_229, out s0_230, out s1_107, out a0_231, out a2_232, out a3_233, out a4_234, out a5_235, out s2_236, out s3_237, out s4_238, out s5_239, out mstatus_105);
		goto l230352C6;
	}
}

// 23035302: Register Eq_2 ble_ke_task_init(Register Eq_2 ra, Stack word32 dwArg10, Register out ptr32 s1Out)
// Called from:
//      ble_ke_init
Eq_2 ble_ke_task_init(Eq_2 ra, word32 dwArg10, ptr32 & s1Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 ra_12;
	word32 a0_13;
	ptr32 s1_17;
	a5_5();
	if (a0_13 != 0x00)
	{
		s1Out = s1_17;
		return ra_12;
	}
	else
	{
		<anonymous> * a5_24 = g_ptr4200F3D4;
		Eq_2 ra_31;
		Eq_2 s0_35;
		Eq_2 s1_36;
		a5_24();
		ptr32 s1_51;
		word32 s0_71;
		word32 s4_72;
		Eq_2 ra_49 = ble_ke_event_callback_set(ra_31, s0_35, s1_36, 0x02, 0x2303525E, out s0_71, out s1_51, out s4_72);
		s1Out = s1_51;
		return ra_49;
	}
}

// 23035342: Register Eq_2 ble_ke_task_create(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register out Eq_151738 s0Out, Register out (ptr32 word32) s1Out, Register out ptr32 a0Out, Register out (ptr32 word32) a3Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_init
//      lld_init
//      llm_init
//      bt_onchiphci_interface_init
Eq_2 ble_ke_task_create(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, word32 a1, union Eq_151738 & s0Out, word32 & s1Out, ptr32 & a0Out, word32 & a3Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 * s1_24;
	Eq_2 ra_25;
	word32 a0_26;
	ptr32 mstatus_32;
	word32 * a3_34;
	Eq_2 a4_33;
	Eq_151738 s0_23;
	a5_5();
	byte bLoc11_61 = 0x00;
	if (a0_26 != 0x00)
	{
l23035366:
		s0Out = s0_23;
		s1Out = s1_24;
		a0Out = (word32) bLoc11_61;
		a3Out = a3_34;
		a4Out = a4_33;
		mstatusOut = mstatus_32;
		return ra_25;
	}
	a4_33 = __csrrs(mstatus_32, 0x00);
	__csrrc(mstatus_32, 0x08);
	word32 a5_37 = 0x04;
	if (s0_23 > 0x04)
		a5_37 = 0x03;
	else
	{
		s0_23 <<= 2;
		word32 a0_41 = *a3_34;
		if (a3_34 == null)
		{
			*s1_24 = a0_41;
l23035388:
			__csrrw(mstatus_32, 0x00);
			goto l23035366;
		}
	}
	bLoc11_61 = (byte) a5_37;
	goto l23035388;
}

// 230353A2: Register Eq_2 ble_ke_state_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_138800 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_138800 a4Out, Register out (ptr32 Eq_138804) a5Out, Register out (ptr32 Eq_138805) s2Out, Register out (ptr32 Eq_138806) s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_init
//      llc_stop
//      llc_start
//      llc_con_update_finished
//      llc_map_update_finished
//      llm_end_evt_defer
//      llm_con_req_ind
//      llm_con_req_tx_cfm
//      llm_test_mode_start_tx
//      llm_test_mode_start_rx
//      llm_set_adv_en
//      llm_set_scan_en
//      llm_init
//      llm_create_con
//      llcp_ping_rsp_handler
//      llcp_terminate_ind_handler
//      llc_llcp_reject_ind
//      llcp_pause_enc_req_handler
//      llcp_enc_req_handler
//      llcp_unknown_rsp_handler
//      llcp_vers_ind_handler
//      llcp_start_enc_rsp_handler
//      llcp_length_rsp_handler
//      llcp_con_param_rsp_handler
//      llcp_feats_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
//      llcp_con_param_req_handler
//      llc_llcp_terminate_ind_pdu_send
//      llc_chmap_update_req_ind_handler
//      llc_length_req_ind_handler
//      llc_enc_mgt_ind_handler
//      llc_auth_payl_nearly_to_ind_handler
//      llc_util_dicon_procedure
//      llc_pdu_llcp_tx_ack_defer
//      lld_stop_ind_handler
//      hci_le_rem_con_param_req_neg_reply_cmd_handler
//      hci_le_rem_con_param_req_reply_cmd_handler
//      hci_le_start_enc_cmd_handler
//      hci_le_rd_rem_used_feats_cmd_handler
//      hci_rd_rem_ver_info_cmd_handler
//      hci_le_test_end_cmd_handler
//      hci_le_create_con_cancel_cmd_handler
Eq_2 ble_ke_state_set(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_138800 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_138800 & a4Out, struct Eq_138804 & a5Out, struct Eq_138805 & s2Out, struct Eq_138806 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	uint32 s0_22;
	Eq_138800 s1_23;
	Eq_2 ra_24;
	ptr32 a0_25;
	struct Eq_138805 * s2_31;
	struct Eq_138806 * s3_32;
	ptr32 s4_33;
	ptr32 mstatus_34;
	Eq_138800 a4_28;
	struct Eq_138804 * a5_21;
	a5_5();
	if (a0_25 == 0x00)
	{
		a4_28 = s0_22 & 0x00FF;
		if ((s0_22 & 0x00FF) <= 0x04)
		{
			a5_21 = (struct Eq_138804 *) *((char *) g_a42026540 + (s0_22 & 0x00FF) * 0x04);
			a4_28 = (word32) a5_21->w000E;
			if (s0_22 >> 0x08 < a4_28)
			{
				a5_21 = a5_21->dw0008 + (s0_22 >> 0x08);
				a4_28 = (word32) a5_21->b0000;
				if (a4_28 != s1_23)
				{
					a5_21->b0000 = (byte) s1_23;
					ptr32 a0_63;
					ptr32 a2_65;
					Eq_138800 a4_67;
					struct Eq_138804 * a5_68;
					ptr32 mstatus_70;
					Eq_2 s0_72;
					Eq_138800 s1_73;
					struct Eq_138805 * s2_74;
					struct Eq_138806 * s3_75;
					ptr32 s4_76;
					Eq_2 ra_71 = ble_ke_task_saved_update(ra_24, s0, s1_23, s0_22, s2_31, s3_32, s4_33, dwArg0108, out s0_72, out s1_73, out a0_63, out a2_65, out a4_67, out a5_68, out s2_74, out s3_75, out s4_76, out mstatus_70);
					s0Out = s0_72;
					s1Out = s1_73;
					a0Out = a0_63;
					a2Out = a2_65;
					a4Out = a4_67;
					a5Out = a5_68;
					s2Out = s2_74;
					s3Out = s3_75;
					s4Out = s4_76;
					mstatusOut = mstatus_70;
					return ra_71;
				}
			}
		}
		else
		{
			a5_21 = (word32) *(union Eq_2 *) 0x0E;
			__ebreak();
		}
	}
	s0Out = s0;
	s1Out = s1_23;
	a0Out = a0_25;
	a2Out = dwArg10;
	a4Out = a4_28;
	a5Out = a5_21;
	s2Out = s2_31;
	s3Out = s3_32;
	s4Out = s4_33;
	mstatusOut = mstatus_34;
	return ra_24;
}

