pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23035412: Register Eq_2 ble_ke_state_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register out (ptr32 byte) s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_138962 a4Out, Register out ptr32 s8Out)
// Called from:
//      llc_reset
//      llc_con_update_finished
//      llc_map_update_finished
//      llm_end_evt_defer
//      llm_pdu_defer
//      llm_con_req_ind
//      llm_con_req_tx_cfm
//      llm_set_adv_en
//      llm_set_scan_en
//      llm_create_con
//      hci_fc_acl_en
//      llcp_ping_rsp_handler
//      llcp_enc_rsp_handler
//      llc_llcp_reject_ind
//      llcp_pause_enc_req_handler
//      llcp_start_enc_req_handler
//      llcp_enc_req_handler
//      llcp_unknown_rsp_handler
//      llcp_vers_ind_handler
//      llcp_pause_enc_rsp_handler
//      llcp_start_enc_rsp_handler
//      llcp_length_rsp_handler
//      llcp_con_param_rsp_handler
//      llcp_feats_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
//      llcp_con_param_req_handler
//      llc_llcp_terminate_ind_pdu_send
//      llm_enc_ind_handler
//      llc_llcp_recv_ind_handler
//      llc_chmap_update_req_ind_handler
//      llc_auth_payl_real_to_ind_handler
//      llc_con_upd_req_ind_handler
//      llc_length_req_ind_handler
//      llc_enc_mgt_ind_handler
//      llc_chnl_assess_timer_handler
//      llc_link_sup_to_ind_handler
//      llc_auth_payl_nearly_to_ind_handler
//      llc_data_ind_handler
//      lld_stop_ind_handler
//      llc_util_get_free_conhdl
//      llc_util_get_nb_active_link
//      llc_end_evt_defer
//      llc_pdu_llcp_tx_ack_defer
//      lld_stop_ind_handler
//      hci_le_set_data_len_cmd_handler
//      hci_le_rem_con_param_req_neg_reply_cmd_handler
//      hci_le_rem_con_param_req_reply_cmd_handler
//      hci_le_ltk_req_neg_reply_cmd_handler
//      hci_le_ltk_req_reply_cmd_handler
//      hci_disconnect_cmd_handler
//      hci_le_start_enc_cmd_handler
//      hci_le_rd_rem_used_feats_cmd_handler
//      hci_le_rd_chnl_map_cmd_handler
//      hci_rd_auth_payl_to_cmd_handler
//      hci_rd_rssi_cmd_handler
//      hci_rd_tx_pwr_lvl_cmd_handler
//      hci_le_con_update_cmd_handler
//      hci_wr_auth_payl_to_cmd_handler
//      hci_rd_rem_ver_info_cmd_handler
//      llc_hci_acl_data_tx_handler
//      hci_le_tx_test_cmd_handler
//      hci_le_rx_test_cmd_handler
//      hci_le_wl_mngt_cmd_handler
//      hci_le_create_con_cmd_handler
//      hci_le_set_scan_en_cmd_handler
//      hci_le_set_scan_param_cmd_handler
//      hci_le_set_scan_rsp_data_cmd_handler
//      hci_le_set_adv_en_cmd_handler
//      hci_le_set_adv_data_cmd_handler
//      hci_le_set_adv_param_cmd_handler
//      hci_le_set_rand_add_cmd_handler
//      hci_le_test_end_cmd_handler
//      hci_le_create_con_cancel_cmd_handler
Eq_2 ble_ke_state_get(Eq_2 ra, Eq_2 s0, Eq_2 a0, byte & s0Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_138962 & a4Out, ptr32 & s8Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 ra_18;
	word32 a0_19;
	ptr32 a1_20;
	Eq_138962 a4_23;
	byte * s0_17;
	a5_5();
	byte bLoc11_54 = SLICE(s0, byte, 24);
	if (a0_19 == 0x00)
	{
		bLoc11_54 = ~0x00;
		if ((s0_17 & 0x00FF) > 0x04)
			__ebreak();
		struct Eq_163789 * a5_33 = *((char *) g_a42026540 + (s0_17 & 0x00FF) * 0x04);
		s0_17 >>= 8;
		a4_23 = (word32) a5_33->w000E;
		if (s0_17 >> 8 < a4_23)
		{
			s0_17 = (s0_17 >> 8) + a5_33->dw0008;
			bLoc11_54 = (byte) (word32) *s0_17;
		}
	}
	s0Out = s0_17;
	a0Out = (word32) bLoc11_54;
	a1Out = a1_20;
	a4Out = a4_23;
	s8Out = dwLoc1C;
	return ra_18;
}

// 23035474: Register Eq_2 llc_llcp_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register ptr32 a1, Register ptr32 a2, Stack word32 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgEC, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      ble_ke_state_get
//      llc_llcp_version_ind_pdu_send
//      llc_llcp_ch_map_update_pdu_send
//      llc_llcp_pause_enc_req_pdu_send
//      llc_llcp_pause_enc_rsp_pdu_send
//      llc_llcp_enc_req_pdu_send
//      llc_llcp_enc_rsp_pdu_send
//      llc_llcp_start_enc_rsp_pdu_send
//      llc_llcp_reject_ind_pdu_send
//      llc_llcp_con_update_pdu_send
//      llc_llcp_con_param_req_pdu_send
//      llc_llcp_con_param_rsp_pdu_send
//      llc_llcp_feats_req_pdu_send
//      llc_llcp_feats_rsp_pdu_send
//      llc_llcp_start_enc_req_pdu_send
//      llc_llcp_terminate_ind_pdu_send
//      llc_llcp_unknown_rsp_send_pdu
//      llc_llcp_ping_req_pdu_send
//      llc_llcp_ping_rsp_pdu_send
//      llc_llcp_length_req_pdu_send
//      llc_llcp_length_rsp_pdu_send
Eq_2 llc_llcp_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, ptr32 a1, ptr32 a2, word32 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArgEC, Eq_2 dwArg0108, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	ptr32 a0_28;
	Eq_2 s0_38;
	Eq_2 s1_39;
	ptr32 a0_47;
	ptr32 a4_51;
	ptr32 mstatus_55;
	word32 s4_59;
	word32 a3_263;
	word32 a4_264;
	word32 a5_265;
	word32 a6_266;
	word32 s4_267;
	word32 s8_268;
	word32 mstatus_269;
	word32 s0_270;
	word32 a3_271;
	word32 a5_272;
	word32 a6_273;
	word32 s8_274;
	ptr32 s1_206;
	Eq_2 ra_56 = ble_ke_malloc(ble_ke_malloc(ra, s0, s1, 0x1A, 0x00, out s0_38, out s1_39, out a0_28, out a3_263, out a4_264, out a5_265, out a6_266, out s4_267, out s8_268, out mstatus_269), s0_38, s1_39, 0x10, 0x00, out s0_270, out s1_206, out a0_47, out a3_271, out a4_51, out a5_272, out a6_273, out s4_59, out s8_274, out mstatus_55);
	if (a0_28 != 0x00)
	{
		s1_206 = a0_47;
		if (a0_47 != 0x00)
		{
			<anonymous> * a5_82 = g_ptr4200F3D0;
			word32 s4_86;
			word32 s3_90;
			word32 s5_91;
			Eq_2 ra_92;
			Eq_2 s0_93;
			Eq_2 s1_94;
			Eq_2 s2_95;
			ptr32 mstatus_98;
			Eq_128173 a3_103;
			word32 s10_180;
			word32 s11_181;
			word32 s7_182;
			word32 s9_183;
			word32 t0_184;
			word32 t4_185;
			a5_82();
			*((word32) s1_94 + 8) = s3_90;
			*((word32) s1_94 + 4) = (word16) s4_86;
			*((word32) s1_94 + 0x0C) = (byte) s5_91;
			__csrrs(mstatus_98, 0x00);
			__csrrc(mstatus_98, 0x08);
			Eq_2 a0_114;
			word32 s1_275;
			word32 a5_276;
			Eq_2 ra_118 = ble_co_list_push_back(ra_92, s0_93, s1_94, s2_95, s1_94, out s1_275, out a0_114, out a5_276);
			__csrrw(mstatus_98, 0x00);
			0x00 = (int8) dwArgA8;
			ptr32 a4_133;
			Eq_2 s0_136;
			Eq_2 s4_137;
			ptr32 s1_142;
			ptr32 s2_143;
			ptr32 s3_144;
			ptr32 s5_147;
			ptr32 mstatus_149;
			ptr32 s6_152;
			ptr32 s7_153;
			Eq_2 ra_146 = lld_evt_schedule_next(ra_118, a0_114, a3_103, mstatus_98, dwArg04, dwArg08, dwArg10, dwArg18, dwArg58, dwArg78, dwArg98, dwArg9C, dwArgC4, dwArgE0, dwArgE4, dwArgEC, dwArg0108, out s0_136, out s1_142, out a4_133, out s2_143, out s3_144, out s4_137, out s5_147, out s6_152, out s7_153, out mstatus_149);
			s0Out = s0_136;
			s1Out = s1_142;
			a4Out = a4_133;
			s2Out = s2_143;
			s3Out = s3_144;
			s4Out = s4_137;
			s5Out = s5_147;
			s6Out = s6_152;
			s7Out = s7_153;
			mstatusOut = mstatus_149;
			return ra_146;
		}
	}
	0x00 = (int8) dwArgA8;
	s0Out = s1;
	s1Out = s1_206;
	a4Out = a4_51;
	s2Out = s2;
	s3Out = a0_28;
	s4Out = dwArg04;
	s5Out = a2;
	s6Out = a1;
	s7Out = s7;
	mstatusOut = mstatus_55;
	return ra_56;
}

// 2303551C: void llcp_ping_rsp_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s5, Stack word32 dwArg38, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void llcp_ping_rsp_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s5, word32 dwArg38, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	ui32 a0_17;
	Eq_2 s0_22;
	word32 a1_138;
	word32 a4_139;
	word32 s8_140;
	Eq_2 ra_21 = ble_ke_state_get(ra, a1, a1, out s0_22, out a0_17, out a1_138, out a4_139, out s8_140);
	if (((word32) *((word32) s1 + 0x00A5) & 0x08) != 0x00)
	{
		word32 s1_141;
		word32 a4_142;
		word32 s2_143;
		word32 s3_144;
		word32 s4_145;
		word32 s5_146;
		word32 mstatus_147;
		llc_util_dicon_procedure(ra_21, s0_22, a0, 61, s5, s2, dwArgE8, out s1_141, out a4_142, out s2_143, out s3_144, out s4_145, out s5_146, out mstatus_147);
	}
	else if ((a0_17 & 1) != 0x00 && (word32) (*((word32) s1 + 0x00A3)) == 0x05)
	{
		Eq_2 s1_45;
		Eq_2 s2_46;
		Eq_2 s3_47;
		Eq_2 s0_53;
		word32 a0_148;
		word32 a2_149;
		word32 a4_150;
		word32 a5_151;
		word32 s4_152;
		word32 mstatus_153;
		Eq_2 ra_44 = ble_ke_state_set(ra_21, s0_22, s1, s0_22, a0_17 & 0x00FE, dwArgF8, out s0_53, out s1_45, out a0_148, out a2_149, out a4_150, out a5_151, out s2_46, out s3_47, out s4_152, out mstatus_153);
		*((word32) s1_45 + 0x00A3) = 0x00;
		word32 s0_154;
		word32 s1_155;
		word32 a0_156;
		word32 a1_157;
		word32 a2_158;
		word32 a3_159;
		word32 a4_160;
		word32 s2_161;
		word32 s3_162;
		word32 s4_163;
		word32 s5_164;
		word32 s8_165;
		word32 mstatus_166;
		ble_ke_timer_clear(ra_44, s0_53, s1_45, 258, s0_53, s2_46, s3_47, s5, s0, dwArgF8, out s0_154, out s1_155, out a0_156, out a1_157, out a2_158, out a3_159, out a4_160, out s2_161, out s3_162, out s4_163, out s5_164, out s8_165, out mstatus_166);
	}
	0x00 = dwArg38;
}

// 2303558A: void llcp_terminate_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack word32 dwArg38, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void llcp_terminate_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, word32 dwArg38, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 s0_30;
	Eq_2 s1_31;
	Eq_2 s2_32;
	Eq_2 s5_35;
	word32 a0_129;
	word32 a1_130;
	word32 a2_131;
	word32 a3_132;
	word32 a4_133;
	word32 s3_134;
	word32 s4_135;
	word32 s8_136;
	word32 mstatus_137;
	Eq_2 ra_29 = ble_ke_timer_clear(ra, a0, a3, 258, a1, a1, s3, s5, s0, dwArgF8, out s0_30, out s1_31, out a0_129, out a1_130, out a2_131, out a3_132, out a4_133, out s2_32, out s3_134, out s4_135, out s5_35, out s8_136, out mstatus_137);
	struct Eq_164147 * a5_44 = *((char *) &g_t42026428 + s0_30 * 0x04);
	a5_44->b00A1 = (byte) (word32) *((word32) s1_31 + 1);
	a5_44->w005C = (word16) ((word32) a5_44->w005C | 0x0200);
	struct Eq_164170 * s1_61;
	Eq_2 s0_69;
	word32 a0_138;
	word32 a2_139;
	word32 a4_140;
	word32 a5_141;
	word32 s2_142;
	word32 s3_143;
	word32 s4_144;
	word32 mstatus_145;
	Eq_2 ra_60 = ble_ke_state_set(ra_29, s0_30, s1_31, s2_32, 0x0F, dwArgF8, out s0_69, out s1_61, out a0_138, out a2_139, out a4_140, out a5_141, out s2_142, out s3_143, out s4_144, out mstatus_145);
	if (lld_get_mode(s0_69) == 0x04)
	{
		word32 s1_146;
		word32 a4_147;
		word32 s2_148;
		word32 s3_149;
		word32 s4_150;
		word32 s5_151;
		word32 mstatus_152;
		llc_util_dicon_procedure(ra_60, s0_69, s0_69, (word32) s1_61->b0001, s5_35, s2, dwArgE8, out s1_146, out a4_147, out s2_148, out s3_149, out s4_150, out s5_151, out mstatus_152);
	}
	0x00 = dwArg38;
}

