pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230355F2: void llcp_enc_rsp_handler(Register Eq_2 ra, Register (ptr32 Eq_164220) s1, Register Eq_2 a0, Register Eq_2 a1, Register word32 a3, Stack Eq_2 dwArgC8, Stack word32 dwArgF8, Stack word32 dwArg0128)
void llcp_enc_rsp_handler(Eq_2 ra, struct Eq_164220 * s1, Eq_2 a0, Eq_2 a1, word32 a3, Eq_2 dwArgC8, word32 dwArgF8, word32 dwArg0128)
{
	ui32 a0_30;
	Eq_2 s0_35;
	word32 a1_347;
	word32 s8_349;
	word32 a4_348;
	Eq_2 ra_34 = ble_ke_state_get(ra, a0, a1, out s0_35, out a0_30, out a1_347, out a4_348, out s8_349);
	Eq_2 s4_27 = a1;
	word32 s3_29 = a3;
	ui32 s5_117 = s0_35 << 0x02;
	word32 s2_42 = 0x42026428;
	if (((word32) s1->b00A5 & 0x08) != 0x00 && (word32) s1->b00A3 != 0x0D)
	{
		word32 a4_350;
		word32 mstatus_351;
		ra_34 = llc_util_dicon_procedure(ra_34, s0_35, s0_35, 61, s0_35 << 0x02, dwLoc30, dwArgC8, out s1, out a4_350, out s2_42, out s3_29, out s4_27, out s5_117, out mstatus_351);
	}
	if ((a0_30 & 1) == 0x00 || (word32) s1->b00A3 == 0x0D)
	{
		word32 a0_91;
		word32 a3_94;
		word32 s0_101;
		word32 s1_102;
		word32 s2_103;
		word32 s3_104;
		word32 s4_105;
		word32 s0_119;
		word32 s1_122;
		word32 s2_123;
		word32 s3_124;
		word32 s4_125;
		word32 s5_126;
		word32 s6_127;
		word32 ra_128;
		struct Eq_164294 * s7_129;
		word32 a3_130;
		g_ptr4200F3D0();
		word32 s0_146;
		word32 s1_149;
		word32 s2_150;
		word32 s3_151;
		word32 s4_152;
		word32 s5_153;
		word32 s6_154;
		word32 ra_155;
		struct Eq_164306 * s7_156;
		word32 a3_157;
		s7_129->ptr03D0();
		struct Eq_164311 * sp_172;
		Eq_2 s0_173;
		Eq_2 s1_176;
		word32 s2_177;
		Eq_2 s3_178;
		Eq_2 s4_179;
		Eq_2 s5_180;
		Eq_2 s6_181;
		Eq_2 ra_182;
		s7_156->ptr03D0();
		ptr32 mstatus_202;
		Eq_2 s1_204;
		struct Eq_164325 * s0_207;
		word32 a5_365;
		word32 a2_362;
		word32 a4_364;
		word32 a3_363;
		word32 tp_359;
		word32 a0_361;
		word32 t1_360;
		Eq_2 ra_203 = ble_ke_msg_send(ra_182, s0_173, s1_176, s6_181, sp_172->t0010, out tp_359, out t1_360, out s0_207, out s1_204, out a0_361, out a2_362, out a3_363, out a4_364, out a5_365, out mstatus_202);
		s0_207->w28008124 = (word16) ((word32) *((word32) s3_178 + 0x0A) << 8 | (word32) (*((word32) s3_178 + 9)));
		s0_207->w28008126 = (word16) ((word32) *((word32) s3_178 + 0x0C) << 8 | (word32) (*((word32) s3_178 + 11)));
		__csrrs(mstatus_202, 0x00);
		__csrrc(mstatus_202, 0x08);
		Eq_2 s2_227 = (word32) s5_180 + s2_177;
		struct Eq_164387 * a4_228 = *s2_227;
		a4_228->b00A5 = (byte) ((word32) a4_228->b00A5 | 8);
		__csrrw(mstatus_202, 0x00);
		*((word32) s1_204 + 0x00A3) = 0x0E;
		word32 mstatus_246;
		word32 s6_373;
		word32 s4_371;
		word32 s5_372;
		word32 a5_368;
		word32 s3_370;
		word32 s2_369;
		word32 s1_367;
		word32 s0_366;
		ble_ke_timer_set(ra_203, &s0_207->w28008126, s1_204, 258, s4_179, 0x00FFFFA0, s2_227, s3_178, s4_179, s5_180, s6_181, sp_172->t0010, sp_172->t00A8, sp_172->t0108, out s0_366, out s1_367, out a5_368, out s2_369, out s3_370, out s4_371, out s5_372, out s6_373, out mstatus_246);
	}
	0x00 = dwArg0128;
}

// 23035722: void llc_llcp_reject_ind(Register Eq_2 ra, Register ui32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack word32 dwArg0198)
// Called from:
//      llcp_reject_ind_ext_handler
//      llcp_reject_ind_handler
void llc_llcp_reject_ind(Eq_2 ra, ui32 a0, Eq_2 a1, Eq_2 a2, Eq_2 s4, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158, word32 dwArg0198)
{
	struct Eq_164469 * a5_104;
	Eq_2 s5_43 = (a0 << 0x02) + 0x42026428;
	Eq_2 a0_33;
	Eq_2 s0_38;
	Eq_2 a0_47;
	Eq_2 a1_48;
	Eq_2 a3_50;
	struct Eq_164480 * s0_56;
	Eq_2 s2_58;
	Eq_2 s4_60;
	Eq_2 s8_62;
	word32 mstatus_934;
	word32 a4_933;
	word32 a2_932;
	word32 s8_931;
	word32 a4_930;
	word32 a1_929;
	Eq_2 s5_488;
	Eq_2 s3_588;
	Eq_2 s1_57;
	Eq_2 ra_55 = ble_ke_timer_clear(ble_ke_state_get(ra, 0x42026000, a1, out s0_38, out a0_33, out a1_929, out a4_930, out s8_931), s0_38, a1, 258, a1, *s5_43, a0_33, s5_43, dwLoc3C, dwArgC8, out s0_56, out s1_57, out a0_47, out a1_48, out a2_932, out a3_50, out a4_933, out s2_58, out s3_588, out s4_60, out s5_488, out s8_62, out mstatus_934);
	Eq_2 s0_585 = s0_56->a0428;
	if ((s3_588 & 1) == 0x00)
	{
		a5_104 = s3_588 & 2;
		if ((s3_588 & 2) == 0x00 || a3_50 == 0x00)
			goto l230358E8;
		ui32 a5_71 = (word32) *((word32) *s5_488 + 0x00A5);
		a5_104 = a5_71 & 0x08;
		if ((a5_71 & 0x08) != 0x00)
			goto l230358E8;
		if ((word32) *((word32) s2_58 + 0x00A4) == 0x03)
		{
			struct Eq_164855 * s2_87;
			word32 s1_954;
			word32 s0_953;
			word32 a0_955;
			word32 a2_956;
			word32 a4_957;
			word32 a5_958;
			word32 s3_959;
			word32 s4_960;
			word32 mstatus_961;
			ble_ke_state_set(ra_55, s0_56->a0428, s1_57, s1_57, s3_588 & 0x00FD, dwArgC8, out s0_953, out s1_954, out a0_955, out a2_956, out a4_957, out a5_958, out s2_87, out s3_959, out s4_960, out mstatus_961);
			s2_87->b00A4 = 0x00;
		}
		goto l2303588A;
	}
	else
	{
		a5_104 = (word32) *((word32) s2_58 + 0x00A3) + ~0x03 & 0x00FF;
		if (a5_104 > (struct Eq_164469 *) 0x0C)
			goto l230358E8;
		a5_104 = (struct Eq_164469 *) *((char *) g_a230B5FCC + a5_104 * 0x04);
		switch (a5_104)
		{
		case 0x00:
			ui32 a5_621 = (word32) s0_56->a0428[a0]->b00A5;
			a5_104 = a5_621 & 0x08;
			if ((a5_621 & 0x08) != 0x00)
				goto l230358E8;
			word32 a0_1002;
			word32 a1_1003;
			word32 a2_1004;
			word32 a3_1005;
			word32 a4_1006;
			word32 s2_1007;
			word32 s4_1008;
			word32 s5_1009;
			word32 s8_1010;
			word32 mstatus_1011;
			ra_55 = ble_ke_timer_clear(ra_55, s0_56->a0428, s1_57, 258, s1_57, s2_58, s3_588, s5_488, dwLoc3C, dwArgC8, out s0_585, out s1_57, out a0_1002, out a1_1003, out a2_1004, out a3_1005, out a4_1006, out s2_1007, out s3_588, out s4_1008, out s5_1009, out s8_1010, out mstatus_1011);
			goto l2303587C;
		case 0x01:
l2303587C:
			struct Eq_164570 * s2_701;
			word32 a5_940;
			word32 s3_941;
			word32 s4_942;
			word32 mstatus_943;
			word32 a4_939;
			word32 a2_938;
			word32 a0_937;
			word32 s1_936;
			word32 s0_935;
			ble_ke_state_set(ra_55, s0_585, s1_57, s1_57, s3_588 & 0x00FE, dwArgC8, out s0_935, out s1_936, out a0_937, out a2_938, out a4_939, out a5_940, out s2_701, out s3_941, out s4_942, out mstatus_943);
			s2_701->b00A3 = 0x00;
			goto l2303588A;
		case 0x02:
		case 0x05:
l2303588A:
			0x00 = dwArg0198;
			return;
		case 0x03:
			if (a3_50 == 0x00)
				goto l230358E8;
			s5_488 = s0_56->a0428 + (a0 << 0x02) / 4;
			ui32 a5_490 = (word32) *((word32) *s5_488 + 0x00A5);
			a5_104 = a5_490 & 0x08;
			if ((a5_490 & 0x08) != 0x00)
				goto l230358E8;
			word32 a0_962;
			word32 a1_963;
			word32 a2_964;
			word32 a3_965;
			word32 a4_966;
			word32 s8_967;
			word32 mstatus_968;
			Eq_2 s4_507;
			Eq_2 s0_503;
			Eq_2 s1_504;
			Eq_2 s2_505;
			Eq_2 s3_506;
			Eq_2 s5_508;
			Eq_2 ra_502 = ble_ke_timer_clear(ra_55, s0_56->a0428, s1_57, 258, s1_57, s2_58, s3_588, s5_488, dwLoc3C, dwArgC8, out s0_503, out s1_504, out a0_962, out a1_963, out a2_964, out a3_965, out a4_966, out s2_505, out s3_506, out s4_507, out s5_508, out s8_967, out mstatus_968);
			if (a2 != 0x1A)
				goto l2303584A;
			Eq_2 a0_515 = lld_get_mode(s4_507);
			if (a0_515 != 0x03)
			{
l2303584A:
				ui32 a5_520 = (word32) *((word32) s2_505 + 92);
				if ((a5_520 & 64) != 0x00)
				{
					*((word32) s2_505 + 92) = (word16) (a5_520 & -65);
					if (llm_util_check_evt_mask(0x02) != 0x00)
						ra_502 = llc_con_update_complete_send(ra_502, s0_503, a2, s4_507, (word32) *((word32) s2_505 + 16) + 40, s3_506, s5_508, s6, s4, dwLoc08, dwArgD8, out s0_503, out s1_504, out s2_505, out s3_506, out s4_507, out s5_508);
				}
				word32 s2_999;
				word32 s4_1000;
				word32 s5_1001;
				ra_55 = llc_util_clear_operation_ptr(ra_502, s0_503, s1_504, s4_507, s2_505, s3_506, s4_507, s5_508, out s0_585, out s1_57, out s2_999, out s3_588, out s4_1000, out s5_1001);
				goto l2303587C;
			}
			else
			{
				*a0_515 = 0x02;
				0x00 = dwArg0198;
				word32 tp_969;
				word32 t1_970;
				word32 s0_971;
				word32 s1_972;
				word32 a0_973;
				word32 a2_974;
				word32 a3_975;
				word32 a4_976;
				word32 a5_977;
				word32 mstatus_978;
				ble_ke_msg_send(ra_502, dwArg0158, s1_504, a0_515, dwArg10, out tp_969, out t1_970, out s0_971, out s1_972, out a0_973, out a2_974, out a3_975, out a4_976, out a5_977, out mstatus_978);
				return;
			}
		case 0x04:
		case 0x06:
		case 0x07:
		case 0x08:
l230358E8:
			if (((word32) a5_104->b00A5 & 0x08) == 0x00)
				goto l2303588A;
			0x00 = dwArg0198;
			word32 s1_1012;
			word32 a4_1013;
			word32 s2_1014;
			word32 s3_1015;
			word32 s4_1016;
			word32 s5_1017;
			word32 mstatus_1018;
			llc_util_dicon_procedure(ra_55, dwArg0158, dwArgF4, 61, s5_488, dwArg00, dwArgF8, out s1_1012, out a4_1013, out s2_1014, out s3_1015, out s4_1016, out s5_1017, out mstatus_1018);
			return;
		case 0x09:
		case 0x0A:
		case 11:
		case 0x0C:
			struct Eq_164601 * a4_382;
			Eq_2 s1_388;
			Eq_2 s4_391;
			Eq_2 s5_392;
			word32 s0_944;
			word32 a0_945;
			word32 a1_946;
			word32 a2_947;
			word32 a3_948;
			word32 s2_949;
			word32 s8_951;
			word32 s3_950;
			word32 mstatus_952;
			Eq_2 ra_386 = ble_ke_timer_clear(ra_55, s0_56->a0428, s1_57, 258, s1_57, s2_58, s3_588, s5_488, dwLoc3C, dwArgC8, out s0_944, out s1_388, out a0_945, out a1_946, out a2_947, out a3_948, out a4_382, out s2_949, out s3_950, out s4_391, out s5_392, out s8_951, out mstatus_952);
			if (lld_get_mode(s4_391) != 0x03 || ((word32) a4_382->b00A5 & 0x10) != 0x00)
				goto l2303588A;
			a4_382->b00A5 = 0x00;
			Eq_2 s0_420;
			Eq_2 s1_421;
			int32 s3_425;
			Eq_2 s1_449;
			struct Eq_164990 * s2_450;
			ui32 s3_451;
			word32 s2_979;
			word32 s4_980;
			word32 s5_981;
			word32 s0_982;
			word32 a0_983;
			word32 a2_984;
			word32 a4_985;
			word32 a5_986;
			word32 s4_987;
			word32 mstatus_988;
			Eq_2 ra_448 = ble_ke_state_set(llc_common_enc_change_evt_send(ra_386, s1_388, s4_391, 0x00, a2, s4_391, s5_392, a2, dwLoc3C, s6, s4, dwLoc08, dwArg48, dwArgA8, dwArgC8, out s0_420, out s1_421, out s2_979, out s3_425, out s4_980, out s5_981), s0_420, s1_421, s1_421, s3_425 >> 0x18 & 0x00FE, dwArgC8, out s0_982, out s1_449, out a0_983, out a2_984, out a4_985, out a5_986, out s2_450, out s3_451, out s4_987, out mstatus_988);
			s2_450->b00A3 = 0x00;
			0x00 = dwArg0198;
			word32 s0_989;
			word32 s1_990;
			word32 a0_991;
			word32 a2_992;
			word32 a4_993;
			word32 a5_994;
			word32 s2_995;
			word32 s3_996;
			word32 s4_997;
			word32 mstatus_998;
			ble_ke_state_set(ra_448, dwArg0158, s1_449, s1_449, s3_451 & 0x00FA, dwArg0108, out s0_989, out s1_990, out a0_991, out a2_992, out a4_993, out a5_994, out s2_995, out s3_996, out s4_997, out mstatus_998);
			return;
		case 0x0D:
			fn23035C5E(ra_55, s0_56->a0428, s1_57, a3_50, s2_58, s3_588, s5_488, dwLoc40, dwLoc3C, s6, s4, dwLoc18, dwLoc08, dwArg08, dwArgC8);
			return;
		case 0x0E:
			0x00 = (int8) dwArg0118;
			return;
		case 0x0F:
			0x00 = (int8) dwArg0118;
			return;
		case 0x10:
			fn23035CEA(ra_55, s0_56->a0428, s1_57, a3_50, s2_58, s3_588, s5_488, dwLoc3C, s6, s4, dwLoc08, dwArgC8, dwArgE8);
			return;
		case 0x11:
			fn23035D62(ra_55, s0_56->a0428, s1_57, a3_50, s3_588, s5_488, dwLoc3C, dwArgC8);
			return;
		case 0x12:
			0x00 = (int8) dwArg0118;
			return;
		case 0x13:
			fn23035C80(ra_55, s0_56->a0428, s1_57, a3_50, s2_58, s3_588, s5_488, dwLoc3C, s6, s4, dwLoc08, dwArgC8, dwArgD8);
			return;
		case 0x14:
			0x00 = (int8) dwArg0118;
			return;
		case 0x15:
			0x00 = (int8) dwArg0118;
			return;
		case 22:
			0x00 = (int8) dwArg0118;
			return;
		case 0x17:
			0x00 = (int8) dwArg0118;
			return;
		case 0x18:
			0x00 = (int8) dwArg0118;
			return;
		case 0x19:
			fn23035C3C(ra_55, s0_56->a0428, s1_57, 587947980, s2_58, s4_60, s5_488, a2, dwLoc3C, s6, s4, dwLoc08, dwArg48, dwArgA8, dwArgC8, dwArg0118);
			return;
		case 0x1A:
			fn2303696E(ra_55, s0_56->a0428, s1_57, s2_58, s4_60, dwArgC8);
			return;
		case 0x1B:
			fn2303699C();
			return;
		case 0x1C:
			fn23036990(ra_55, s0_56->a0428, s5_488, a2, dwLoc40, dwArgB8, dwArg0118);
			return;
		case 0x1D:
			fn230368C2(ra_55, s0_56->a0428, s5_488, a2, dwLoc40, dwArgB8, dwArg0118);
			return;
		case 0x1E:
			fn23036930(ra_55, s0_56->a0428, s5_488, a2, dwLoc40, dwArgB8, dwArg0118);
			return;
		case 0x1F:
			fn23036ADA(ra_55, s0_56->a0428, s1_57, s2_58, s3_588, s4_60, s5_488, dwLoc3C, dwArgC8);
			return;
		case 0x20:
			fn23036A6A();
			return;
		case 33:
			fn23036B66(ra_55, s0_56->a0428, s5_488, dwLoc40, dwArgB8, dwArg0118);
			return;
		case 0x22:
			fn23036A30(ra_55, s0_56->a0428, s5_488, dwLoc40, dwArgB8, dwArg0118);
			return;
		case 0x23:
			fn23036A90();
			return;
		case 0x24:
			llcp_con_upd_ind_handler(ra_55, s0_56->a0428, a0_47, a1_48, dwArg64, a3_50, s8_62, dwLoc40, dwLoc08, dwArgB8, dwArgC8, dwArg0118);
			return;
		}
	}
}

// 23035912: void llcp_reject_ind_ext_handler(Register Eq_2 ra, Register ui32 a0, Register Eq_2 a1, Register (ptr32 Eq_165141) a3, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack word32 dwArg0188)
void llcp_reject_ind_ext_handler(Eq_2 ra, ui32 a0, Eq_2 a1, struct Eq_165141 * a3, Eq_2 s4, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0148, word32 dwArg0188)
{
	llc_llcp_reject_ind(ra, a0, a1, (word32) a3->b0002, s4, s6, dwLoc10, dwLoc08, dwArg00, dwArg38, dwArg54, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArgE8, dwArgF8, dwArg0108, dwArg0148, dwArg0188);
}

// 23035928: void llcp_reject_ind_handler(Register Eq_2 ra, Register ui32 a0, Register Eq_2 a1, Register (ptr32 Eq_165170) a3, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack word32 dwArg0188)
void llcp_reject_ind_handler(Eq_2 ra, ui32 a0, Eq_2 a1, struct Eq_165170 * a3, Eq_2 s4, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0148, word32 dwArg0188)
{
	llc_llcp_reject_ind(ra, a0, a1, (word32) a3->b0001, s4, s6, dwLoc10, dwLoc08, dwArg00, dwArg38, dwArg54, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArgE8, dwArgF8, dwArg0108, dwArg0148, dwArg0188);
}

// 2303593E: void llcp_pause_enc_req_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void llcp_pause_enc_req_handler(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s4, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	ui32 a0_23;
	Eq_2 s0_28;
	word32 a1_255;
	word32 a4_256;
	word32 s8_257;
	Eq_2 ra_27 = ble_ke_state_get(ra, a1, a1, out s0_28, out a0_23, out a1_255, out a4_256, out s8_257);
	if (((word32) *((char *) *((char *) &g_t42026428 + a0 * 0x04) + 0x00A5) & 0x08) != 0x00)
	{
		word32 s1_258;
		word32 a4_259;
		word32 s2_260;
		word32 s3_261;
		word32 s4_262;
		word32 s5_263;
		word32 mstatus_264;
		llc_util_dicon_procedure(ra_27, s0_28, a0, 61, s5, dwLoc20, dwArgD8, out s1_258, out a4_259, out s2_260, out s3_261, out s4_262, out s5_263, out mstatus_264);
	}
	else if (lld_get_mode(a0) == 0x04 && (a0_23 & 2) == 0x00)
	{
		Eq_2 s1_46 = (a0_23 | 2) & 0x00FF;
		Eq_2 s2_59;
		Eq_2 s3_60;
		ui32 s4_61;
		word32 a0_265;
		word32 a2_266;
		word32 a4_267;
		word32 a5_268;
		word32 mstatus_269;
		Eq_2 s1_58;
		Eq_2 s0_66;
		Eq_2 ra_57 = ble_ke_state_set(ra_27, s0_28, s1_46, s0_28, s1_46, dwArgE8, out s0_66, out s1_58, out a0_265, out a2_266, out a4_267, out a5_268, out s2_59, out s3_60, out s4_61, out mstatus_269);
		if ((s4_61 & 1) != 0x00)
		{
			word32 a0_282;
			word32 a1_283;
			word32 a2_284;
			word32 a3_285;
			word32 a4_286;
			word32 s2_287;
			word32 s3_288;
			word32 s4_289;
			word32 s5_290;
			word32 s8_291;
			word32 mstatus_292;
			ra_57 = ble_ke_timer_clear(ra_57, s0_66, s1_58, 258, s0_66, s2_59, s3_60, 0x42026428, s4, dwArgE8, out s0_66, out s1_58, out a0_282, out a1_283, out a2_284, out a3_285, out a4_286, out s2_287, out s3_288, out s4_289, out s5_290, out s8_291, out mstatus_292);
		}
		Eq_2 s1_105;
		ui32 s4_108;
		Eq_2 s0_113;
		struct Eq_165290 * a4_121;
		ptr32 mstatus_124;
		Eq_2 s2_127;
		Eq_2 s3_128;
		Eq_2 s0_134;
		word32 a0_270;
		word32 a2_271;
		word32 a4_272;
		word32 a5_273;
		word32 s2_274;
		word32 s3_275;
		word32 mstatus_276;
		word32 s1_277;
		word32 a0_278;
		word32 a2_279;
		word32 a5_280;
		word32 s4_281;
		Eq_2 ra_125 = ble_ke_state_set(ble_ke_state_set(ra_57, s0_66, s1_58, s0_66, s1_58, dwArgE8, out s0_113, out s1_105, out a0_270, out a2_271, out a4_272, out a5_273, out s2_274, out s3_275, out s4_108, out mstatus_276), s0_113, s1_105, s0_113, (s4_108 | 6) & 0x00FF, dwArgE8, out s0_134, out s1_277, out a0_278, out a2_279, out a4_121, out a5_280, out s2_127, out s3_128, out s4_281, out mstatus_124);
		((word32) s2_127 + 0x00A4)->u0 = 0x05;
		Eq_2 s1_137 = __csrrs(mstatus_124, 0x00);
		__csrrc(mstatus_124, 0x08);
		a4_121->b00A5 = (byte) ((word32) a4_121->b00A5 | 0x0C);
		struct Eq_151647 * a0_144 = lld_util_get_tx_pkt_cnt(*((word32) s2_127 + 16));
		__csrrw(mstatus_124, 0x00);
		if (a0_144 != null)
			*((word32) s2_127 + 92) = (word16) ((word32) *((word32) s2_127 + 92) | 4);
		else
		{
			word32 t1_293;
			word32 s0_294;
			word32 s1_295;
			word32 a0_296;
			word32 a3_297;
			word32 a4_298;
			word32 a6_299;
			word32 a7_300;
			word32 s2_301;
			word32 s3_302;
			word32 s4_303;
			word32 mstatus_304;
			ble_ke_msg_send_basic(ra_125, s0_134, s1_137, 262, s0_134, s0_134, s2_127, s3_128, dwLoc10, dwArg18, dwArgF8, out t1_293, out s0_294, out s1_295, out a0_296, out a3_297, out a4_298, out a6_299, out a7_300, out s2_301, out s3_302, out s4_303, out mstatus_304);
		}
	}
}

// 23035A28: void llcp_start_enc_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8)
void llcp_start_enc_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgD8, Eq_2 dwArgF8)
{
	ui32 a0_19;
	Eq_2 s0_24;
	word32 s8_194;
	word32 a4_193;
	word32 a1_192;
	Eq_2 ra_23 = ble_ke_state_get(ra, s0, a1, out s0_24, out a0_19, out a1_192, out a4_193, out s8_194);
	Eq_2 s3_51 = a0;
	Eq_2 s2_18 = a1;
	ui32 s1_31 = a0_19;
	if (((word32) *((word32) s0_24 + 0x00A5) & 0x08) != 0x00 && ((word32) (*((word32) s0_24 + 0x00A3)) + ~0x0D & 0x00FD) != 0x00)
	{
		word32 mstatus_198;
		word32 s5_197;
		word32 s4_196;
		word32 a4_195;
		ra_23 = llc_util_dicon_procedure(ra_23, s0_24, a0, 61, s5, dwLoc20, dwArgD8, out s1_31, out a4_195, out s2_18, out s3_51, out s4_196, out s5_197, out mstatus_198);
	}
	Eq_2 s1_59 = s1_31 & 0x01;
	word32 a5_62 = (word32) *((word32) s0_24 + 0x00A3);
	if (s1_59 != 0x00)
	{
		if (a5_62 != 0x0E)
		{
			if (a5_62 != 0x10)
				return;
l23035A82:
			*((word32) s0_24 + 0x00A3) = 0x11;
			word32 t1_199;
			word32 s0_200;
			word32 s1_201;
			word32 a0_202;
			word32 a4_204;
			word32 a3_203;
			word32 a6_205;
			word32 a7_206;
			word32 s2_207;
			word32 s3_208;
			word32 s4_209;
			word32 mstatus_210;
			ble_ke_msg_send_basic(ra_23, s0_24, s1_59, 262, s2_18, s2_18, s2_18, s3_51, dwLoc10, dwArg18, dwArgF8, out t1_199, out s0_200, out s1_201, out a0_202, out a3_203, out a4_204, out a6_205, out a7_206, out s2_207, out s3_208, out s4_209, out mstatus_210);
			return;
		}
	}
	else if (a5_62 != 0x0E)
		goto l23035A82;
	*((word32) s0_24 + 0x00A3) = 0x0F;
}

