pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23035AB0: void llcp_enc_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack word32 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void llcp_enc_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s4, Eq_2 s6, Eq_2 dwArg18, word32 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 a0_27;
	Eq_2 s0_32;
	word32 a1_301;
	word32 s8_303;
	word32 a4_302;
	Eq_2 ra_31 = ble_ke_state_get(ra, s0, a1, out s0_32, out a0_27, out a1_301, out a4_302, out s8_303);
	if (((word32) *((word32) s0_32 + 0x00A5) & 0x08) != 0x00 && (word32) (*((word32) s0_32 + 0x00A4)) != 0x07)
	{
		word32 s1_304;
		word32 a4_305;
		word32 s3_307;
		word32 s2_306;
		word32 s4_308;
		word32 s5_309;
		word32 mstatus_310;
		llc_util_dicon_procedure(ra_31, s0_32, a0, 61, a0 << 0x02, s6, dwArgD8, out s1_304, out a4_305, out s2_306, out s3_307, out s4_308, out s5_309, out mstatus_310);
	}
	else if (lld_get_mode(a0) == 0x04 && ((a0_27 & 2) == 0x00 || (word32) (*((word32) s0_32 + 0x00A4)) == 0x07))
	{
		word32 a2_312;
		word32 a5_314;
		word32 a0_311;
		word32 a4_313;
		word32 s4_316;
		word32 s3_315;
		Eq_2 s1_78;
		Eq_2 s2_79;
		Eq_2 s0_86;
		Eq_2 s1_99;
		Eq_2 s2_100;
		word32 s3_101;
		Eq_2 s0_107;
		word32 mstatus_317;
		word32 a0_318;
		word32 a2_319;
		word32 a4_320;
		word32 a5_321;
		word32 s4_322;
		word32 mstatus_323;
		Eq_2 ra_98 = ble_ke_state_set(ble_ke_state_set(ra_31, s0_32, a0_27, a1, (a0_27 | 2) & 0x00FF, dwArgE8, out s0_86, out s1_78, out a0_311, out a2_312, out a4_313, out a5_314, out s2_79, out s3_315, out s4_316, out mstatus_317), s0_86, s1_78, s2_79, (s1_78 | 6) & 0x00FF, dwArgE8, out s0_107, out s1_99, out a0_318, out a2_319, out a4_320, out a5_321, out s2_100, out s3_101, out s4_322, out mstatus_323);
		((word32) s0_107 + 0x00A4)->u0 = 0x08;
		Eq_2 s5_113 = (a0 << 0x02) + 0x42026428;
		*((word32) *s5_113 + 8) = s3_101 + ~0x01;
		struct Eq_151647 * a0_120;
		ptr32 mstatus_127;
		Eq_2 s1_130;
		Eq_2 s2_131;
		struct Eq_165717 ** s5_134;
		word32 s0_324;
		word32 a1_325;
		word32 a2_326;
		word32 a3_327;
		word32 a4_328;
		word32 s3_329;
		word32 s4_330;
		word32 s8_331;
		Eq_2 ra_128 = ble_ke_timer_clear(ra_98, s0_107, s1_99, 258, s2_100, s2_100, s3_101 + ~0x01, s5_113, s4, dwArgE8, out s0_324, out s1_130, out a0_120, out a1_325, out a2_326, out a3_327, out a4_328, out s2_131, out s3_329, out s4_330, out s5_134, out s8_331, out mstatus_127);
		Eq_2 s3_139 = __csrrs(mstatus_127, 0x00);
		__csrrc(mstatus_127, 0x08);
		struct Eq_165717 * a4_141 = *s5_134;
		a4_141->b00A5 = (byte) ((word32) a4_141->b00A5 | 0x0C);
		Eq_2 s0_145 = a0_120->t0010;
		struct Eq_151647 * a0_146 = lld_util_get_tx_pkt_cnt(a0_120);
		__csrrw(mstatus_127, 0x00);
		if (a0_146 != null)
			*((word32) s0_145 + 92) = (word16) ((word32) *((word32) s0_145 + 92) | 4);
		else
		{
			word32 t1_332;
			word32 s0_333;
			word32 s1_334;
			word32 a0_335;
			word32 a3_336;
			word32 a4_337;
			word32 a6_338;
			word32 a7_339;
			word32 s2_340;
			word32 s3_341;
			word32 s4_342;
			word32 mstatus_343;
			ble_ke_msg_send_basic(ra_128, s0_145, s1_130, 262, s2_131, s2_131, s2_131, s3_139, dwLoc10, dwArg18, dwArgF8, out t1_332, out s0_333, out s1_334, out a0_335, out a3_336, out a4_337, out a6_338, out a7_339, out s2_340, out s3_341, out s4_342, out mstatus_343);
		}
	}
	0x00 = dwArgA8;
}

// 23035BB0: void llcp_unknown_rsp_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128)
void llcp_unknown_rsp_handler(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128)
{
	Eq_2 s2;
	Eq_2 a0;
	Eq_2 a1;
	Eq_2 s0;
	Eq_2 s5;
	Eq_2 a3;
	Eq_2 ra;
	Eq_2 s6;
	Eq_2 dwArgB8;
	Eq_2 dwArgD8;
	word32 dwLoc2C;
	Eq_2 dwArg08;
	Eq_2 dwArg0128;
	Eq_2 dwArgC8;
	word32 dwLoc30;
	Eq_2 dwArgE8;
	Eq_2 dwArgF8;
	word32 dwLoc08;
	Eq_2 dwArg18;
	ra_295 = ble_ke_state_get(ra, s0, a1, out s0_296, out a0_291, out a1_292, out a4_808, out s8_297);
	a4_305 = (word32) *((word32) s0_296 + 0x00A5);
	if ((a4_305 & 8) == 0x00 || (word32) (*((word32) s0_296 + 0x00A3)) == 0x0D)
	{
		if ((a0_291 & 1) == 0x00)
			fn23035C3C(ra_295, s0_296, a1, a4_305, a0, 0x42026428, a0 << 0x02, s6, dwLoc2C, s2, s0, dwArg08, s5, dwArgB8, dwArgD8, dwArg0128);
		else
		{
			a5_354 = (word32) *((word32) s0_296 + 0x00A3) + ~0x00 & 0x00FF;
			if (a5_354 > 0x0C)
				fn23035C3C(ra_295, s0_296, a1, a4_305, a0, 0x42026428, a0 << 0x02, s6, dwLoc2C, s2, s0, dwArg08, s5, dwArgB8, dwArgD8, dwArg0128);
			else
			{
				switch (g_a230B6000[a5_354 * 0x04])
				{
				case 0x00:
					fn23035C5E(ra_295, s0_296, a1, a3, a0, a0_291, a0 << 0x02, dwLoc30, dwLoc2C, s2, s0, dwLoc08, dwArg08, dwArg18, dwArgD8);
					return;
				case 0x01:
				case 0x02:
				case 0x05:
				case 0x07:
				case 0x08:
				case 0x09:
				case 0x0A:
				case 11:
					fn23035C3C(ra_295, s0_296, a1, a4_305, a0, 0x42026428, a0 << 0x02, s6, dwLoc2C, s2, s0, dwArg08, s5, dwArgB8, dwArgD8, dwArg0128);
					return;
				case 0x03:
					fn23035CEA(ra_295, s0_296, a1, a3, a0, a0_291, a0 << 0x02, dwLoc2C, s2, s0, dwArg08, dwArgD8, dwArgF8);
					return;
				case 0x04:
					fn23035D62(ra_295, s0_296, a1, a3, a0_291, a0 << 0x02, dwLoc2C, dwArgD8);
					return;
				case 0x06:
					fn23035C80(ra_295, s0_296, a1, a3, a0, a0_291, a0 << 0x02, dwLoc2C, s2, s0, dwArg08, dwArgD8, dwArgE8);
					return;
				case 0x0C:
					fn23035C3C(ra_295, s0_296, a1, a4_305, a0, 0x42026428, a0 << 0x02, s6, dwLoc2C, s2, s0, dwArg08, s5, dwArgB8, dwArgD8, dwArg0128);
					return;
				case 0x0D:
					fn2303696E(ra_295, s0_296, a1, a0, 0x42026428, dwArgD8);
					return;
				case 0x0E:
					fn2303699C();
					return;
				case 0x0F:
					fn23036990(ra_295, s0_296, a0 << 0x02, s6, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 0x10:
					fn230368C2(ra_295, s0_296, a0 << 0x02, s6, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 0x11:
					fn23036930(ra_295, s0_296, a0 << 0x02, s6, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 0x12:
					fn23036ADA(ra_295, s0_296, a1, a0, a0_291, 0x42026428, a0 << 0x02, dwLoc2C, dwArgD8);
					return;
				case 0x13:
					fn23036A6A();
					return;
				case 0x14:
					fn23036B66(ra_295, s0_296, a0 << 0x02, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 0x15:
					fn23036A30(ra_295, s0_296, a0 << 0x02, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 22:
					fn23036A90();
					return;
				case 0x17:
					llcp_con_upd_ind_handler(ra_295, s0_296, a0_291, a1_292, 0x230B6000, a3, s8_297, dwLoc30, dwArg08, dwArgC8, dwArgD8, dwArg0128);
					return;
				}
			}
		}
	}
	else
	{
		ra_629 = llc_util_dicon_procedure(ra_295, s0_296, a0, 61, a0 << 0x02, dwLoc30, dwArgC8, out s1_630, out a4_625, out s2_631, out s3_809, out s4_633, out s5_634, out mstatus_810);
		fn23035C3C(ra_629, s0_296, s1_630, a4_625, s2_631, s4_633, s5_634, s6, dwLoc2C, s2, s0, dwArg08, s5, dwArgB8, dwArgD8, dwArg0128);
	}
}

// 23035C3C: void fn23035C3C(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register ui32 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0158)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
void fn23035C3C(Eq_2 ra, Eq_2 s0, Eq_2 s1, ui32 a4, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0158)
{
	if ((a4 & 0x10) == 0x00)
	{
		*((word32) s0 + 0x00A5) = 0x00;
		Eq_2 s0_26;
		Eq_2 s1_27;
		ui32 s3_31;
		word32 s2_129;
		word32 s4_130;
		word32 s5_131;
		Eq_2 ra_25 = llc_common_enc_change_evt_send(ra, s1, s2, 0x00, 0x1A, s4, s5, s6, dwArg04, dwArg10, dwArg14, dwArg38, dwArg88, dwArgE8, dwArg0108, out s0_26, out s1_27, out s2_129, out s3_31, out s4_130, out s5_131);
		struct Eq_165987 * s0_62;
		word32 s1_132;
		word32 a0_133;
		word32 a2_134;
		word32 a4_135;
		word32 a5_136;
		word32 s2_137;
		word32 s3_138;
		word32 s4_139;
		word32 mstatus_140;
		ble_ke_state_set(ra_25, s0_26, s1_27, s1_27, s3_31 & 0x00FE, dwArg0108, out s0_62, out s1_132, out a0_133, out a2_134, out a4_135, out a5_136, out s2_137, out s3_138, out s4_139, out mstatus_140);
		s0_62->b00A3 = 0x00;
	}
	0x00 = (int8) dwArg0158;
}

// 23035C5E: void fn23035C5E(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg0108)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
void fn23035C5E(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg0108)
{
	if ((word32) *((word32) a3 + 1) != 0x0E)
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg4 = <invalid>;
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
	}
	else
	{
		Eq_2 s0_24;
		Eq_2 s2_26;
		Eq_2 s5_29;
		word32 s1_118;
		word32 a0_119;
		word32 a1_120;
		word32 a2_121;
		word32 a3_122;
		word32 a4_123;
		word32 s3_124;
		word32 s4_125;
		word32 s8_126;
		word32 mstatus_127;
		word32 s0_128;
		word32 s1_129;
		word32 s2_130;
		word32 s3_131;
		llc_feats_rd_event_send(ble_ke_timer_clear(ra, s0, s1, 258, s1, s2, s3, s5, dwArg04, dwArg0108, out s0_24, out s1_118, out a0_119, out a1_120, out a2_121, out a3_122, out a4_123, out s2_26, out s3_124, out s4_125, out s5_29, out s8_126, out mstatus_127), s0_24, 0x1A, s2_26, (word32) s0_24 + 0x0069, s5_29, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, dwArg0108, out s0_128, out s1_129, out s2_130, out s3_131);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg4 = <invalid>;
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
	}
}

// 23035C80: void fn23035C80(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
void fn23035C80(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	if ((word32) *((word32) a3 + 1) != 0x0F)
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg4 = <invalid>;
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
	}
	else
	{
		struct Eq_166094 * a2_17;
		word32 a0_184;
		word32 a1_185;
		word32 a3_186;
		word32 a4_187;
		word32 s8_188;
		word32 mstatus_189;
		Eq_2 s2_26;
		Eq_2 s0_24;
		Eq_2 s1_25;
		Eq_2 s3_27;
		Eq_2 s4_28;
		Eq_2 s5_29;
		Eq_2 ra_23 = ble_ke_timer_clear(ra, s0, s1, 258, s1, s2, s3, s5, dwArg04, dwArg0108, out s0_24, out s1_25, out a0_184, out a1_185, out a2_17, out a3_186, out a4_187, out s2_26, out s3_27, out s4_28, out s5_29, out s8_188, out mstatus_189);
		*((word32) s0_24 + 166) = 0x00;
		Eq_2 a0_36 = lld_get_mode(s2_26);
		if (a0_36 != 0x03)
		{
			ui32 a5_39 = (word32) *((word32) s0_24 + 92);
			if ((a5_39 & 64) != 0x00)
			{
				*((word32) s0_24 + 92) = (word16) (a5_39 & -65);
				if (llm_util_check_evt_mask(0x02) != 0x00)
					ra_23 = llc_con_update_complete_send(ra_23, a2_17->t0010, 0x1A, s2_26, (char *) &a2_17->t0010 + 24, s3_27, s5_29, dwArg10, dwArg14, dwArg38, dwArg0118, out s0_24, out s1_25, out s2_26, out s3_27, out s4_28, out s5_29);
			}
			word32 s0_209;
			word32 s1_210;
			word32 s2_211;
			word32 s3_212;
			word32 s4_213;
			word32 s5_214;
			llc_util_clear_operation_ptr(ra_23, s0_24, s1_25, s2_26, s2_26, s3_27, s4_28, s5_29, out s0_209, out s1_210, out s2_211, out s3_212, out s4_213, out s5_214);
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg4 = <invalid>;
			Eq_2 stackArg16 = <invalid>;
			Eq_2 stackArg20 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg232 = <invalid>;
			Eq_2 stackArg264 = <invalid>;
			Eq_2 stackArg344 = <invalid>;
			fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
		}
		else
		{
			*a0_36 = 0x02;
			word32 tp_190;
			word32 t1_191;
			word32 s0_192;
			word32 s1_193;
			word32 a0_194;
			word32 a2_195;
			word32 a3_196;
			word32 a4_197;
			word32 a5_198;
			word32 mstatus_199;
			ble_ke_msg_send(ra_23, s0_24, s1_25, a0_36, dwArg10, out tp_190, out t1_191, out s0_192, out s1_193, out a0_194, out a2_195, out a3_196, out a4_197, out a5_198, out mstatus_199);
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg4 = <invalid>;
			Eq_2 stackArg16 = <invalid>;
			Eq_2 stackArg20 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg232 = <invalid>;
			Eq_2 stackArg264 = <invalid>;
			Eq_2 stackArg344 = <invalid>;
			fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
		}
	}
}

