pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23035CEA: void fn23035CEA(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
void fn23035CEA(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	if ((word32) *((word32) a3 + 1) != 0x14)
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg4 = <invalid>;
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
	}
	else
	{
		Eq_2 s0_24;
		Eq_2 s1_25;
		Eq_2 s2_26;
		Eq_2 s3_27;
		Eq_2 s5_29;
		word32 a0_159;
		word32 a1_160;
		word32 a2_161;
		word32 a3_162;
		word32 a4_163;
		word32 s4_164;
		word32 s8_165;
		word32 mstatus_166;
		Eq_2 ra_23 = ble_ke_timer_clear(ra, s0, s1, 258, s1, s2, s3, s5, dwArg04, dwArg0108, out s0_24, out s1_25, out a0_159, out a1_160, out a2_161, out a3_162, out a4_163, out s2_26, out s3_27, out s4_164, out s5_29, out s8_165, out mstatus_166);
		*((word32) s0_24 + 82) = 0x01;
		if (llm_util_check_evt_mask(0x06) == 0x00)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg4 = <invalid>;
			Eq_2 stackArg16 = <invalid>;
			Eq_2 stackArg20 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg232 = <invalid>;
			Eq_2 stackArg264 = <invalid>;
			Eq_2 stackArg344 = <invalid>;
			fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
		}
		else if (((word32) *((word32) s0_24 + 83) & 0x02) != 0x00)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg4 = <invalid>;
			Eq_2 stackArg16 = <invalid>;
			Eq_2 stackArg20 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg232 = <invalid>;
			Eq_2 stackArg264 = <invalid>;
			Eq_2 stackArg344 = <invalid>;
			fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
		}
		else
		{
			Eq_2 a0_47;
			Eq_2 s0_57;
			Eq_2 s2_59;
			Eq_2 s3_60;
			Eq_2 s4_61;
			word32 s1_167;
			word32 a1_168;
			word32 a2_169;
			word32 a3_170;
			word32 a4_171;
			word32 a6_172;
			word32 a7_173;
			word32 s8_174;
			word32 mstatus_175;
			Eq_2 ra_56 = ble_ke_msg_alloc(ra_23, s0_24, s1_25, 0x00FFF804, s2_26, 62, 0x0C, s2_26, s3_27, dwArg0128, out s0_57, out s1_167, out a0_47, out a1_168, out a2_169, out a3_170, out a4_171, out a6_172, out a7_173, out s2_59, out s3_60, out s4_61, out s8_174, out mstatus_175);
			*a0_47 = 0x07;
			*((word32) a0_47 + 2) = (word16) s2_59;
			*((word32) a0_47 + 8) = (word16) (word32) *((word32) s0_57 + 72);
			*((word32) a0_47 + 0x0A) = (word16) (word32) *((word32) s0_57 + 80);
			*((word32) a0_47 + 4) = (word16) (word32) *((word32) s0_57 + 70);
			*((word32) a0_47 + 6) = (word16) (word32) *((word32) s0_57 + 78);
			struct Eq_166367 * s0_87;
			word32 tp_176;
			word32 s1_177;
			word32 a0_178;
			word32 a2_179;
			word32 a3_180;
			word32 a4_181;
			word32 s2_182;
			word32 s3_183;
			word32 s4_184;
			word32 s5_185;
			word32 s6_186;
			word32 s7_187;
			word32 s9_188;
			word32 s10_189;
			word32 mstatus_190;
			hci_send_2_host(ra_56, s0_57, a0_47, s2_59, s3_60, s4_61, s5_29, dwArg10, dwArg14, dwArg38, out tp_176, out s0_87, out s1_177, out a0_178, out a2_179, out a3_180, out a4_181, out s2_182, out s3_183, out s4_184, out s5_185, out s6_186, out s7_187, out s9_188, out s10_189, out mstatus_190);
			s0_87->b0053 = (byte) ((word32) s0_87->b0053 | 2);
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg4 = <invalid>;
			Eq_2 stackArg16 = <invalid>;
			Eq_2 stackArg20 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg232 = <invalid>;
			Eq_2 stackArg264 = <invalid>;
			Eq_2 stackArg344 = <invalid>;
			fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
		}
	}
}

// 23035D62: void fn23035D62(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0108)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
void fn23035D62(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s3, Eq_2 s5, Eq_2 dwArg04, Eq_2 dwArg0108)
{
	if ((word32) *((word32) a3 + 1) != 0x12)
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg4 = <invalid>;
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
	}
	else
	{
		Eq_2 s1_22;
		Eq_2 s2_23;
		Eq_2 s3_24;
		Eq_2 s0_30;
		word32 a0_87;
		word32 a2_88;
		word32 a4_89;
		word32 a5_90;
		word32 s4_91;
		word32 mstatus_92;
		Eq_2 ra_21 = ble_ke_state_set(ra, s0, s1, s1, s3 & 0x00FE, dwArg0108, out s0_30, out s1_22, out a0_87, out a2_88, out a4_89, out a5_90, out s2_23, out s3_24, out s4_91, out mstatus_92);
		*((word32) s0_30 + 0x00A3) = 0x00;
		word32 s0_93;
		word32 s1_94;
		word32 a0_95;
		word32 a1_96;
		word32 a2_97;
		word32 a3_98;
		word32 a4_99;
		word32 s2_100;
		word32 s3_101;
		word32 s4_102;
		word32 s5_103;
		word32 s8_104;
		word32 mstatus_105;
		ble_ke_timer_clear(ra_21, s0_30, s1_22, 258, s1_22, s2_23, s3_24, s5, dwArg04, dwArg0108, out s0_93, out s1_94, out a0_95, out a1_96, out a2_97, out a3_98, out a4_99, out s2_100, out s3_101, out s4_102, out s5_103, out s8_104, out mstatus_105);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg4 = <invalid>;
		Eq_2 stackArg16 = <invalid>;
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23035C3C(ra, s0, s1, a4, s2, s4, s5, s6, stackArg4, stackArg16, stackArg20, stackArg56, stackArg136, stackArg232, stackArg264, stackArg344);
	}
}

// 23035D86: Register Eq_2 llc_llcp_version_ind_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      llcp_vers_ind_handler
//      hci_rd_rem_ver_info_cmd_handler
Eq_2 llc_llcp_version_ind_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 s0_27;
	ptr32 s1_28;
	ptr32 s3_29;
	ptr32 s4_30;
	ptr32 s5_31;
	ptr32 s6_32;
	ptr32 s2_39;
	word32 a4_74;
	word32 s7_75;
	word32 mstatus_76;
	Eq_2 ra_26 = llc_llcp_send(ra, s0, s1, fp + ~0x17, 0x0C, dwLoc20, 128911628, dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_27, out s1_28, out a4_74, out s2_39, out s3_29, out s4_30, out s5_31, out s6_32, out s7_75, out mstatus_76);
	s0Out = s0_27;
	s1Out = s1_28;
	s2Out = s2_39;
	s3Out = s3_29;
	s4Out = s4_30;
	s5Out = s5_31;
	s6Out = s6_32;
	return ra_26;
}

// 23035DAE: void llcp_vers_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_166602) a3, Register Eq_2 s2, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArg0128)
void llcp_vers_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, struct Eq_166602 * a3, Eq_2 s2, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArg0128)
{
	Eq_2 a0_21;
	Eq_2 s0_26;
	word32 s8_290;
	word32 a4_289;
	word32 a1_288;
	Eq_2 ra_25 = ble_ke_state_get(ra, s0, a1, out s0_26, out a0_21, out a1_288, out a4_289, out s8_290);
	if (((word32) *((word32) s0_26 + 0x00A5) & 0x08) != 0x00)
	{
		word32 mstatus_297;
		word32 s5_296;
		word32 s4_295;
		word32 s3_294;
		word32 s2_293;
		word32 a4_292;
		word32 s1_291;
		llc_util_dicon_procedure(ra_25, s0_26, a0, 61, s5, dwLoc30, dwArgC8, out s1_291, out a4_292, out s2_293, out s3_294, out s4_295, out s5_296, out mstatus_297);
	}
	else
	{
		int32 a5_37 = (word32) *((word32) s0_26 + 92);
		*((word32) s0_26 + 60) = (byte) (word32) a3->b0001;
		*((word32) s0_26 + 62) = (word16) (word32) a3->w0002;
		word32 a3_44 = (word32) a3->w0004;
		*((word32) s0_26 + 92) = (word16) (a5_37 | 2);
		*((word32) s0_26 + 64) = (word16) a3_44;
		ui32 a4_48 = a5_37 >> 0x01 & 0x01;
		if ((a0_21 & 1) != 0x00 && (word32) (*((word32) s0_26 + 0x00A3)) == 0x02)
		{
			Eq_2 s0_97;
			Eq_2 s1_98;
			Eq_2 s2_99;
			Eq_2 s3_100;
			Eq_2 s5_102;
			Eq_2 s0_119;
			Eq_2 s1_120;
			Eq_2 s2_123;
			ui32 s3_124;
			word32 a2_300;
			word32 a3_301;
			word32 a4_302;
			word32 s4_303;
			word32 s8_304;
			word32 a1_299;
			word32 a0_298;
			word32 mstatus_305;
			word32 s4_306;
			word32 s5_307;
			Eq_2 ra_118 = llc_version_rd_event_send(ble_ke_timer_clear(ra_25, s0_26, a0, 258, a1, a1, a0_21, s5, dwLoc2C, dwArgD8, out s0_97, out s1_98, out a0_298, out a1_299, out a2_300, out a3_301, out a4_302, out s2_99, out s3_100, out s4_303, out s5_102, out s8_304, out mstatus_305), s0_97, 0x00, s1_98, s2_99, s3_100, s5_102, s2, s0, dwArg08, dwArgE8, out s0_119, out s1_120, out s2_123, out s3_124, out s4_306, out s5_307);
			*((word32) s0_119 + 0x00A3) = 0x00;
			word32 s0_308;
			word32 s1_309;
			word32 a0_310;
			word32 a2_311;
			word32 a4_312;
			word32 a5_313;
			word32 s2_314;
			word32 s3_315;
			word32 s4_316;
			word32 mstatus_317;
			ble_ke_state_set(ra_118, s0_119, s1_120, s2_123, s3_124 & 0x00FE, dwArgD8, out s0_308, out s1_309, out a0_310, out a2_311, out a4_312, out a5_313, out s2_314, out s3_315, out s4_316, out mstatus_317);
		}
		else if (a4_48 == 0x00)
		{
			word32 s0_318;
			word32 s1_319;
			word32 s2_320;
			word32 s3_321;
			word32 s4_322;
			word32 s5_323;
			word32 s6_324;
			llc_llcp_version_ind_pdu_send(ra_25, s0_26, a0, dwLoc28, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg74, dwArg90, dwArg94, dwArg9C, dwArgB8, out s0_318, out s1_319, out s2_320, out s3_321, out s4_322, out s5_323, out s6_324);
		}
	}
	0x00 = dwArg0128;
}

// 23035E62: void llc_llcp_ch_map_update_pdu_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8)
// Called from:
//      llc_chmap_update_req_ind_handler
void llc_llcp_ch_map_update_pdu_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8)
{
	word32 s1_17 = *((word32) a0 + 16);
	word32 a0_21 = lld_util_instant_get((word32) a0 + 40, 0x02);
	<anonymous> * a5_25 = g_ptr4200F3D0;
	Eq_2 ra_34;
	Eq_2 s0_35;
	Eq_2 s1_36;
	a5_25();
	word32 s0_118;
	word32 s1_119;
	word32 a4_120;
	word32 s2_121;
	word32 s3_122;
	word32 s4_123;
	word32 s5_124;
	word32 s6_125;
	word32 s7_126;
	word32 mstatus_127;
	llc_llcp_send(ra_34, s0_35, s1_36, fp - 24, 0x01, dwLoc20, dwLoc1C, SEQ(nLoc17, 0x01), dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_118, out s1_119, out a4_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s7_126, out mstatus_127);
}

// 23035EBE: void llc_llcp_pause_enc_req_pdu_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8)
// Called from:
//      llc_enc_mgt_ind_handler
void llc_llcp_pause_enc_req_pdu_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8)
{
	Eq_2 s0_35;
	Eq_2 s1_36;
	word32 a5_101;
	word32 s2_102;
	word32 s3_103;
	word32 s4_104;
	word32 s5_105;
	word32 s6_106;
	word32 mstatus_107;
	word32 s0_108;
	word32 s1_109;
	word32 a4_110;
	word32 s2_111;
	word32 s3_112;
	word32 s4_113;
	word32 s5_114;
	word32 s6_115;
	word32 s7_116;
	word32 mstatus_117;
	llc_llcp_send(ble_ke_timer_set(ra, a0, s1, 258, (word32) (word16) (a0 << 0x08 | 1), 0x00FFFFA0, s2, s3, s4, s5, s6, dwLoc10, dwArg88, dwArgE8, out s0_35, out s1_36, out a5_101, out s2_102, out s3_103, out s4_104, out s5_105, out s6_106, out mstatus_107), s0_35, s1_36, fp + ~0x13, 0x0A, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_108, out s1_109, out a4_110, out s2_111, out s3_112, out s4_113, out s5_114, out s6_115, out s7_116, out mstatus_117);
}

