pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23035EFC: Register Eq_2 llc_llcp_pause_enc_rsp_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      llcp_pause_enc_rsp_handler
//      llc_enc_mgt_ind_handler
Eq_2 llc_llcp_pause_enc_rsp_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	((word32) a0 + 0x280080EE)->u2 = (word16) (word32) (word16) ((word32) (word16) (word32) *((word32) a0 + 0x280080EE) & -0x0101);
	((Eq_582857[]) 0x00A5)[a0].b0000 = (byte) ((word32) ((Eq_582856[]) 0x00A5)[a0].b0000 & ~0x02);
	ptr32 mstatus_41;
	ptr32 s0_43;
	ptr32 s1_44;
	ptr32 s3_45;
	ptr32 s4_46;
	ptr32 s5_47;
	ptr32 s6_48;
	ptr32 s2_55;
	word32 a4_91;
	word32 s7_92;
	Eq_2 ra_42 = llc_llcp_send(ra, s0, s1, fp + ~0x13, 11, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_43, out s1_44, out a4_91, out s2_55, out s3_45, out s4_46, out s5_47, out s6_48, out s7_92, out mstatus_41);
	s0Out = s0_43;
	s1Out = s1_44;
	s2Out = s2_55;
	s3Out = s3_45;
	s4Out = s4_46;
	s5Out = s5_47;
	s6Out = s6_48;
	mstatusOut = mstatus_41;
	return ra_42;
}

// 23035F58: void llcp_pause_enc_rsp_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void llcp_pause_enc_rsp_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	uint32 a0_23;
	word32 a4_338;
	word32 s8_339;
	word32 a1_337;
	word32 s0_336;
	Eq_2 ra_27 = ble_ke_state_get(ra, s0, a1, out s0_336, out a0_23, out a1_337, out a4_338, out s8_339);
	Eq_2 s2_36 = *((char *) &g_t42026428 + a0 * 0x04);
	if ((a0_23 & 1) != 0x00 && (word32) (*((word32) s2_36 + 0x00A3)) == 11)
	{
		word32 mstatus_349;
		Eq_2 s0_159;
		Eq_2 s1_160;
		struct Eq_167093 * s2_161;
		word32 s8_348;
		word32 s5_347;
		word32 s4_346;
		word32 s3_345;
		word32 a4_344;
		word32 a3_343;
		word32 a2_342;
		word32 a1_341;
		word32 a0_340;
		Eq_2 ra_158 = ble_ke_timer_clear(ra_27, 0x42026428, a0, 258, a1, s2_36, a1, a0 << 0x02, s4, dwArgE8, out s0_159, out s1_160, out a0_340, out a1_341, out a2_342, out a3_343, out a4_344, out s2_161, out s3_345, out s4_346, out s5_347, out s8_348, out mstatus_349);
		((word32) s1_160 + 0x280080EE)->u2 = (word16) (word32) (word16) ((word32) (word16) (word32) *((word32) s1_160 + 0x280080EE) & -769);
		s2_161->b00A3 = 0x0C;
		word32 s1_351;
		word32 s0_350;
		ptr32 mstatus_192;
		struct Eq_167165 ** s4_200;
		word32 s3_353;
		word32 s2_352;
		word32 s5_354;
		word32 s6_355;
		llc_llcp_pause_enc_rsp_pdu_send(ra_158, s0_159, s1_160, s1_160, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_350, out s1_351, out s2_352, out s3_353, out s4_200, out s5_354, out s6_355, out mstatus_192);
		__csrrs(mstatus_192, 0x00);
		__csrrc(mstatus_192, 0x08);
		struct Eq_167165 * a4_213 = *s4_200;
		a4_213->b00A5 = (byte) ((word32) a4_213->b00A5 & ~0x03 | 8);
		__csrrw(mstatus_192, 0x00);
	}
	else if ((word32) *((word32) s2_36 + 0x00A4) == ~0x05 && (a0_23 >> 1 & 0x01) != 0x00)
	{
		Eq_2 s0_93;
		Eq_2 s1_94;
		Eq_2 s2_95;
		Eq_2 s3_96;
		Eq_2 s4_97;
		Eq_2 s5_98;
		word32 a0_356;
		word32 a2_358;
		word32 a4_360;
		word32 a1_357;
		word32 a3_359;
		word32 s8_361;
		word32 mstatus_362;
		Eq_2 ra_92 = ble_ke_timer_clear(ra_27, 0x42026428, a0, 258, a1, s2_36, a1, a0 << 0x02, s4, dwArgE8, out s0_93, out s1_94, out a0_356, out a1_357, out a2_358, out a3_359, out a4_360, out s2_95, out s3_96, out s4_97, out s5_98, out s8_361, out mstatus_362);
		((word32) s1_94 + 0x280080EE)->u2 = (word16) (word32) (word16) ((word32) (word16) (word32) *((word32) s1_94 + 0x280080EE) & -769);
		*(byte *) 671121719 = (byte) ((word32) *(byte *) 671121719 & -36);
		((word32) s2_95 + 0x00A4)->u0 = 0x07;
		word32 s0_363;
		word32 s1_364;
		word32 a5_365;
		word32 s2_366;
		word32 s3_367;
		word32 s4_368;
		word32 s5_369;
		word32 s6_370;
		word32 mstatus_371;
		ble_ke_timer_set(ra_92, s0_93, s1_94, 258, s3_96, 0x00FFFFA0, s2_95, s3_96, s4_97, s5_98, s6, dwLoc10, dwArg88, dwArgE8, out s0_363, out s1_364, out a5_365, out s2_366, out s3_367, out s4_368, out s5_369, out s6_370, out mstatus_371);
	}
	else if (((word32) *((word32) s2_36 + 0x00A5) & 0x08) != 0x00)
	{
		word32 s1_372;
		word32 a4_373;
		word32 s2_374;
		word32 s3_375;
		word32 s4_376;
		word32 s5_377;
		word32 mstatus_378;
		llc_util_dicon_procedure(ra_27, 0x42026428, a0, 61, a0 << 0x02, dwLoc20, dwArgD8, out s1_372, out a4_373, out s2_374, out s3_375, out s4_376, out s5_377, out mstatus_378);
	}
}

// 23036082: Register Eq_2 llc_llcp_enc_req_pdu_send(Register Eq_2 ra, Register uint32 s0, Register Eq_2 s1, Register uint32 a0, Register (ptr32 Eq_167302) a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack word32 dwArg0198, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      llc_enc_mgt_ind_handler
Eq_2 llc_llcp_enc_req_pdu_send(Eq_2 ra, uint32 s0, Eq_2 s1, uint32 a0, struct Eq_167302 * a1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, word32 dwArg0198, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	uint32 a5_28 = (word32) a1->w000A;
	byte bLoc2F_251 = (byte) a5_28;
	byte bLoc2E_252 = (byte) (a5_28 >> 8);
	ui32 s1_24 = (a0 << 0x02) + 0x42026428;
	<anonymous> * a5_34 = g_ptr4200F3D0;
	Eq_2 dwLoc30_248_255 = SEQ(SLICE(s6, byte, 24), bLoc2E_252, bLoc2F_251, (byte) s6);
	word32 sp_40;
	word32 s1_41;
	word32 ra_44;
	word32 s2_46;
	word32 s3_47;
	struct Eq_167353 * s4_48;
	word32 s6_49;
	word32 s5_50;
	a5_34();
	word32 sp_63;
	word32 s1_64;
	word32 ra_67;
	word32 s0_68;
	word32 s2_69;
	word32 s3_70;
	struct Eq_167362 * s4_71;
	word32 s6_72;
	word32 s5_73;
	s4_48->ptr03D0();
	struct Eq_167368 * sp_86;
	word32 s1_87;
	word32 ra_90;
	struct Eq_167371 * s0_91;
	word32 s2_92;
	struct Eq_167373 * s4_94;
	word32 s6_95;
	word32 s5_96;
	s4_71->ptr03D0();
	s0_91->w280080C4 = (word16) ((word32) sp_86->b001C << 8 | (word32) sp_86->b001B);
	s0_91->w280080C6 = (word16) ((word32) sp_86->b001E << 8 | (word32) sp_86->b001D);
	<anonymous> * a5_120 = s4_94->ptr03D0;
	word32 sp_123;
	word32 s1_124;
	word32 ra_127;
	word32 s0_128;
	word32 s2_129;
	word32 s3_130;
	struct Eq_167419 * s4_131;
	word32 s6_132;
	word32 s5_133;
	a5_120();
	Eq_2 ra_150;
	word32 s0_151;
	Eq_2 s2_152;
	Eq_2 s3_153;
	Eq_2 s4_154;
	Eq_2 s6_155;
	Eq_2 s5_156;
	struct Eq_167429 * a4_159;
	s4_131->ptr03D0();
	Eq_2 s0_164 = (word32) s3_153 + s0_151;
	s0_164->u2 = (word16) (word32) (word16) ((word32) (word16) (word32) *s0_164 & -0x0101);
	Eq_2 s1_174 = a4_159->t0000;
	a4_159->b00A5 = (byte) ((word32) a4_159->b00A5 & ~0x02);
	Eq_2 s0_193;
	Eq_2 s1_194;
	ptr32 s1_218;
	ptr32 s3_219;
	ptr32 s5_221;
	ptr32 s2_229;
	word32 a5_337;
	word32 s2_338;
	word32 s3_339;
	word32 s4_340;
	word32 s5_341;
	word32 s6_342;
	word32 mstatus_343;
	word32 s0_344;
	word32 a4_345;
	word32 s4_346;
	word32 s6_347;
	word32 s7_348;
	word32 mstatus_349;
	Eq_2 ra_216 = llc_llcp_send(ble_ke_timer_set(ra_150, s0_164, s1_174, 258, (word32) (word16) (s2_152 << 0x08 | 1), 0x00FFFFA0, s2_152, s3_153, s4_154, s5_156, s6_155, dwLoc30_248_255, dwArg68, dwArgC8, out s0_193, out s1_194, out a5_337, out s2_338, out s3_339, out s4_340, out s5_341, out s6_342, out mstatus_343), s0_193, s1_194, fp - 56, 0x03, dwLoc40, dwLoc3C, SEQ(nLoc37, 0x03), dwLoc30_248_255, s2, dwLoc18, dwArg08, dwArg18, dwArg38, dwArg48, s1, ra, dwArg68, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_344, out s1_218, out a4_345, out s2_229, out s3_219, out s4_346, out s5_221, out s6_347, out s7_348, out mstatus_349);
	0x00 = dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_218;
	s2Out = s2_229;
	s3Out = s3_219;
	s4Out = dwArgF4;
	s5Out = s5_221;
	return ra_216;
}

// 230361AA: Register Eq_2 llc_llcp_enc_rsp_pdu_send(Register Eq_2 ra, Register (ptr32 Eq_167528) s0, Register Eq_2 s1, Register (ptr32 Eq_167528) a0, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      llc_enc_mgt_ind_handler
Eq_2 llc_llcp_enc_rsp_pdu_send(Eq_2 ra, struct Eq_167528 * s0, Eq_2 s1, struct Eq_167528 * a0, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	<anonymous> * a5_20 = g_ptr4200F3D0;
	word32 sp_25;
	word32 ra_29;
	word32 s0_30;
	struct Eq_167554 * s2_31;
	word32 s1_32;
	a5_20();
	struct Eq_167556 * sp_44;
	word32 ra_48;
	struct Eq_167558 * s0_49;
	struct Eq_167559 * s2_50;
	word32 s1_51;
	s2_31->ptr03D0();
	s0_49->w28008124 = (word16) ((word32) sp_44->b000A << 8 | (word32) sp_44->b0009);
	ui32 a4_76 = (word32) sp_44->b000C << 8 | (word32) sp_44->b000B;
	s0_49->w28008126 = (word16) a4_76;
	<anonymous> * a5_78 = s2_50->ptr03D0;
	Eq_2 ra_84;
	Eq_2 s0_85;
	Eq_2 s1_87;
	ptr32 s3_163;
	ptr32 s5_164;
	a5_78();
	ptr32 s0_108;
	ptr32 s2_120;
	word32 s1_198;
	word32 a4_199;
	word32 s3_200;
	word32 s4_201;
	word32 s5_202;
	word32 s6_203;
	word32 s7_204;
	word32 mstatus_205;
	Eq_2 ra_107 = llc_llcp_send(ra_84, s0_85, s1_87, fp - 32, 0x04, SEQ(nLoc1F, 0x04), dwLoc1C, s2, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_108, out s1_198, out a4_199, out s2_120, out s3_200, out s4_201, out s5_202, out s6_203, out s7_204, out mstatus_205);
	s0Out = s0_108;
	s2Out = s2_120;
	s3Out = s3_163;
	s5Out = s5_164;
	return ra_107;
}

// 23036252: Register Eq_2 llc_llcp_start_enc_rsp_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      llcp_start_enc_rsp_handler
//      llc_enc_mgt_ind_handler
Eq_2 llc_llcp_start_enc_rsp_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	((word32) a0 + 0x280080EE)->u2 = (word16) ((word32) *((word32) a0 + 0x280080EE) | 0x0300);
	struct Eq_167672 * a5_24 = *((char *) &g_t42026428 + a0 * 0x04);
	Eq_151521 a1_27 = (word32) a5_24->w004E;
	*((word32) *((word32) a0 + 16) + 0x00A5) = (byte) ((word32) a5_24->b00A5 | 3);
	lld_util_compute_ce_max(a0, a1_27);
	ptr32 a4_47;
	ptr32 mstatus_51;
	ptr32 s0_53;
	ptr32 s1_54;
	ptr32 s3_55;
	ptr32 s4_56;
	ptr32 s5_57;
	ptr32 s6_58;
	ptr32 s2_65;
	word32 s7_105;
	Eq_2 ra_52 = llc_llcp_send(ra, a0, s1, fp + ~0x13, (word32) (byte) s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_53, out s1_54, out a4_47, out s2_65, out s3_55, out s4_56, out s5_57, out s6_58, out s7_105, out mstatus_51);
	s0Out = s0_53;
	s1Out = s1_54;
	a4Out = a4_47;
	s2Out = s2_65;
	s3Out = s3_55;
	s4Out = s4_56;
	s5Out = s5_57;
	s6Out = s6_58;
	mstatusOut = mstatus_51;
	return ra_52;
}

