pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230362BE: void llcp_start_enc_rsp_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void llcp_start_enc_rsp_handler(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 a0_24;
	struct Eq_167753 * s0_29;
	word32 a1_453;
	word32 a4_454;
	word32 s8_455;
	Eq_2 ra_28 = ble_ke_state_get(ra, 0x42026000, a1, out s0_29, out a0_24, out a1_453, out a4_454, out s8_455);
	Eq_2 s3_35 = s0_29->a0428[a0];
	if (((word32) *((word32) s3_35 + 0x00A5) & 0x08) != 0x00 && ((word32) (*((word32) s3_35 + 0x00A3)) != 0x12 && (word32) (*((word32) s3_35 + 0x00A4)) != 11))
	{
		word32 s1_456;
		word32 a4_457;
		word32 s2_458;
		word32 s3_459;
		word32 s4_460;
		word32 s5_461;
		word32 mstatus_462;
		llc_util_dicon_procedure(ra_28, s0_29->a0428, a0, 61, a1, dwLoc20, dwArgD8, out s1_456, out a4_457, out s2_458, out s3_459, out s4_460, out s5_461, out mstatus_462);
	}
	else if ((a0_24 & 0x0F) == 0x0F)
	{
		if (lld_get_mode(a0) == 0x04)
		{
			struct Eq_167861 * a4_276 = (word32) *((word32) s3_35 + 0x00A4);
			if (a4_276 == (struct Eq_167861 *) 11)
			{
				((word32) a0 + 0x280080EE)->u2 = (word16) ((word32) *((word32) a0 + 0x280080EE) | 0x0300);
				a4_276->b00A5 = (byte) ((word32) a4_276->b00A5 | 3);
			}
		}
	}
	else
	{
		Eq_2 s3_121;
		Eq_2 s1_119;
		Eq_2 ra_118;
		Eq_2 s4_122;
		Eq_2 s2_120;
		struct Eq_167821 * a4_114;
		ui32 s1_66;
		Eq_2 s3_68;
		Eq_2 s4_69;
		word32 s8_468;
		word32 mstatus_469;
		word32 a3_466;
		word32 a4_467;
		word32 a1_464;
		word32 a2_465;
		word32 a0_463;
		Eq_2 s2_149;
		Eq_2 s0_147;
		Eq_2 s5_182;
		Eq_2 ra_146 = ble_ke_timer_clear(ra_28, s0_29->a0428, a0_24, 258, a1, a0, s3_35, a1, s4, dwArgE8, out s0_147, out s1_66, out a0_463, out a1_464, out a2_465, out a3_466, out a4_467, out s2_149, out s3_68, out s4_69, out s5_182, out s8_468, out mstatus_469);
		if (lld_get_mode(s2_149) == 0x04)
		{
			((word32) s3_68 + 0x00A4)->u0 = 0x0C;
			Eq_2 s1_130 = s1_66 & 0x01;
			if ((s1_66 & 0x01) != 0x00)
			{
				word32 s5_484;
				word32 s6_485;
				word32 mstatus_486;
				word32 s3_482;
				word32 s4_483;
				word32 a5_481;
				ra_146 = ble_ke_timer_set(ra_146, s0_147, s1_66 & 0x01, 258, s5_182, 0x00FFFFA0, s2_149, s3_68, s4_69, s5_182, s6, dwLoc10, dwArg88, dwArgE8, out s0_147, out s1_130, out a5_481, out s2_149, out s3_482, out s4_483, out s5_484, out s6_485, out mstatus_486);
			}
			ptr32 mstatus_173;
			word32 s0_480;
			ra_118 = llc_llcp_start_enc_rsp_pdu_send(ra_146, s0_147, s1_130, s2_149, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_480, out s1_119, out a4_114, out s2_120, out s3_121, out s4_122, out s5_182, out s6, out mstatus_173);
			__csrrs(mstatus_173, 0x00);
			__csrrc(mstatus_173, 0x08);
			a4_114->b00A5 = (byte) ((word32) a4_114->b00A5 & ~0x08);
			__csrrw(mstatus_173, 0x00);
		}
		else
		{
			Eq_2 s1_80 = (int32) (byte) s1_66;
			struct Eq_167890 * a4_87;
			ptr32 mstatus_90;
			Eq_2 s1_92;
			struct Eq_167893 * s3_94;
			Eq_2 s0_100;
			word32 s4_474;
			word32 a5_472;
			word32 s2_473;
			word32 a0_470;
			word32 a2_471;
			Eq_2 ra_91 = ble_ke_state_set(ra_146, s0_147, s1_80, s5_182, s1_80 & 0x00FE, dwArgE8, out s0_100, out s1_92, out a0_470, out a2_471, out a4_87, out a5_472, out s2_473, out s3_94, out s4_474, out mstatus_90);
			s3_94->b00A3 = 0x00;
			__csrrs(mstatus_90, 0x00);
			__csrrc(mstatus_90, 0x08);
			a4_87->b00A5 = (byte) ((word32) a4_87->b00A5 & -45);
			__csrrw(mstatus_90, 0x00);
			word32 a5_478;
			word32 mstatus_479;
			word32 a0_476;
			word32 a2_477;
			word32 s0_475;
			ra_118 = ble_ke_state_set(ra_91, s0_100, s1_92, s5_182, s1_92 & 0x00FA, dwArgE8, out s0_475, out s1_119, out a0_476, out a2_477, out a4_114, out a5_478, out s2_120, out s3_121, out s4_122, out mstatus_479);
		}
		Eq_2 s0_200 = a4_114->t0000;
		ui32 a5_201 = (word32) a4_114->b00A5;
		if ((a5_201 & 16) != 0x00)
		{
			a4_114->b00A5 = (byte) (a5_201 & ~0x10);
			word32 s0_493;
			word32 s2_494;
			word32 s4_495;
			word32 s5_496;
			llc_common_enc_key_ref_comp_evt_send(ra_118, s0_200, s2_120, 0x00, s2_120, s3_121, s5_182, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_493, out s2_494, out s4_495, out s5_496);
		}
		else
		{
			word32 s0_487;
			word32 s1_488;
			word32 s2_489;
			word32 s3_490;
			word32 s4_491;
			word32 s5_492;
			llc_common_enc_change_evt_send(ra_118, s1_119, s2_120, 0x01, 0x00, s4_122, s5_182, s6, s4, dwLoc10, dwLoc0C, dwArg18, s1, dwArgC8, dwArgE8, out s0_487, out s1_488, out s2_489, out s3_490, out s4_491, out s5_492);
		}
	}
}

// 23036432: Register Eq_2 llc_llcp_reject_ind_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register up32 a1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out (ptr32 Eq_168087) s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      llcp_length_rsp_handler
//      llcp_con_param_rsp_handler
//      llcp_feats_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
//      llcp_con_param_req_handler
//      llc_enc_mgt_ind_handler
//      hci_le_rem_con_param_req_neg_reply_cmd_handler
//      hci_le_ltk_req_neg_reply_cmd_handler
Eq_2 llc_llcp_reject_ind_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, up32 a1, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, struct Eq_168087 & s0Out, ptr32 & s1Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	ptr32 a2_29;
	struct Eq_168094 * a5_11 = *((char *) &g_t42026428 + a0 * 0x04);
	if (((word32) a5_11->w005C & 0x01) != 0x00 && ((word32) a5_11->b0069 & 0x04) != 0x00 || a1 > 0x0D)
		a2_29 = 0x11;
	else
	{
		if ((a1 + ~0x02 & 0x00FD) == 0x00)
			a5_11->b00A5 = 0x00;
		a2_29 = 0x0D;
	}
	struct Eq_168087 * s0_68;
	ptr32 s1_69;
	ptr32 s3_70;
	ptr32 s4_71;
	ptr32 s5_72;
	union Eq_2 * s2_80;
	word32 s7_196;
	word32 mstatus_197;
	word32 a4_194;
	word32 s6_195;
	Eq_2 ra_67 = llc_llcp_send(ra, s0, s1, fp + ~0x13, a2_29, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_68, out s1_69, out a4_194, out s2_80, out s3_70, out s4_71, out s5_72, out s6_195, out s7_196, out mstatus_197);
	s0Out = s0_68;
	s1Out = s1_69;
	s2Out = s2_80;
	s3Out = s3_70;
	s4Out = s4_71;
	s5Out = s5_72;
	return ra_67;
}

// 23036494: void llcp_length_rsp_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack word32 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
void llcp_length_rsp_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, word32 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	Eq_2 a0_27;
	Eq_2 s0_32;
	word32 a4_591;
	word32 a1_590;
	word32 s8_592;
	Eq_2 ra_31 = ble_ke_state_get(ra, s0, a1, out s0_32, out a0_27, out a1_590, out a4_591, out s8_592);
	if (((word32) *((word32) s0_32 + 0x00A5) & 0x08) != 0x00)
	{
		word32 a4_602;
		word32 s2_603;
		word32 s4_605;
		word32 s1_601;
		word32 s5_606;
		word32 mstatus_607;
		word32 s3_604;
		llc_util_dicon_procedure(ra_31, s0_32, a0, 61, s5, s6, dwArgD8, out s1_601, out a4_602, out s2_603, out s3_604, out s4_605, out s5_606, out mstatus_607);
		goto l230364D4;
	}
	Eq_2 s2_55;
	ui32 s3_56;
	word32 a0_593;
	word32 a2_595;
	word32 a1_594;
	word32 a3_596;
	word32 a4_597;
	word32 s8_599;
	word32 s5_598;
	word32 mstatus_600;
	Eq_2 s1_271;
	Eq_2 s4_278;
	Eq_2 s0_285;
	Eq_2 ra_282 = ble_ke_timer_clear(ra_31, s0_32, a3, 258, a1, a1, a0_27, s5, s4, dwArgE8, out s0_285, out s1_271, out a0_593, out a1_594, out a2_595, out a3_596, out a4_597, out s2_55, out s3_56, out s4_278, out s5_598, out s8_599, out mstatus_600);
	if ((s3_56 & 1) != 0x00 && (word32) (*((word32) s0_285 + 0x00A3)) == 0x04)
	{
		*((word32) s0_285 + 0x00A3) = 0x00;
		Eq_2 a0_70;
		ptr32 mstatus_77;
		word32 a4_609;
		word32 a2_608;
		word32 s2_611;
		word32 s3_612;
		word32 a5_610;
		ra_282 = ble_ke_state_set(ra_282, s0_285, s1_271, s2_55, s3_56 & 0x00FE, dwArgE8, out s0_285, out s1_271, out a0_70, out a2_608, out a4_609, out a5_610, out s2_611, out s3_612, out s4_278, out mstatus_77);
		uint32 a3_88 = (word32) *((word32) s1_271 + 2);
		if (a3_88 > 0x1A)
		{
			uint32 a1_90 = (word32) *((word32) s1_271 + 6);
			if (a1_90 > 0x1A)
			{
				Eq_168302 a4_91 = (word32) *((word32) s1_271 + 4);
				if (a4_91 > 327)
				{
					Eq_168309 a2_93 = (word32) *((word32) s1_271 + 8);
					if (a2_93 > 327)
					{
						uint32 a5_94 = (word32) *((word32) s0_285 + 0x0044);
						if (a1_90 < a5_94)
							a5_94 = a1_90;
						Eq_168309 s3_103 = (word32) *((word32) s0_285 + 76);
						uint32 s5_100 = a5_94 << 0x10;
						if (a2_93 < s3_103)
							s3_103 = a2_93;
						uint32 s2_106 = (word32) *((word32) s0_285 + 66);
						uint32 s3_108 = s3_103 << 16;
						if (a3_88 < s2_106)
							s2_106 = a3_88;
						Eq_168302 s1_115 = (word32) *((word32) s0_285 + 74);
						uint32 s2_117 = s2_106 << 16;
						if (a4_91 < s1_115)
							s1_115 = a4_91;
						uint32 s1_124 = s1_115 << 16;
						Eq_2 s0_130 = *((word32) a0_70 + 16);
						lld_util_compute_ce_max(a0_70, s1_124 >> 16);
						if ((word32) *((word32) s0_130 + 72) != s5_100 >> 0x10 || ((word32) (*((word32) s0_130 + 80)) != s3_108 >> 0x10 || ((word32) (*((word32) s0_130 + 70)) != s2_117 >> 0x10 || (word32) (*((word32) s0_130 + 78)) != s1_124 >> 16)))
						{
							__csrrs(mstatus_77, 0x00);
							__csrrc(mstatus_77, 0x08);
							s0_130 = *((word32) a0_70 + 16);
							*((word32) s0_130 + 72) = (word16) (s5_100 >> 0x10);
							*((word32) s0_130 + 80) = (word16) (s3_108 >> 0x10);
							*((word32) s0_130 + 70) = (word16) (s2_117 >> 0x10);
							*((word32) s0_130 + 78) = (word16) (s1_124 >> 16);
							lld_util_eff_tx_time_set(a0_70, s1_124 >> 16, s2_117 >> 0x10);
							__csrrw(mstatus_77, 0x00);
							*((word32) s0_130 + 83) = (byte) ((word32) *((word32) s0_130 + 83) & ~0x02);
						}
						if (llm_util_check_evt_mask(0x06) != 0x00 && ((word32) (*((word32) s0_130 + 83)) & 0x02) == 0x00)
						{
							Eq_2 a0_209;
							Eq_2 s0_219;
							Eq_2 s2_221;
							Eq_2 s3_222;
							Eq_2 s4_223;
							word32 s1_619;
							word32 a4_623;
							word32 a6_624;
							word32 a2_621;
							word32 a7_625;
							word32 a1_620;
							word32 a3_622;
							word32 mstatus_627;
							word32 s8_626;
							Eq_2 ra_218 = ble_ke_msg_alloc(ra_282, s0_130, s1_124 >> 16, 0x00FFF804, s4_278, 62, 0x0C, s2_117 >> 0x10, s3_108 >> 0x10, dwArg0108, out s0_219, out s1_619, out a0_209, out a1_620, out a2_621, out a3_622, out a4_623, out a6_624, out a7_625, out s2_221, out s3_222, out s4_223, out s8_626, out mstatus_627);
							*a0_209 = 0x07;
							*((word32) a0_209 + 2) = (word16) s4_223;
							*((word32) a0_209 + 8) = (word16) (word32) *((word32) s0_219 + 72);
							*((word32) a0_209 + 0x0A) = (word16) (word32) *((word32) s0_219 + 80);
							*((word32) a0_209 + 4) = (word16) (word32) *((word32) s0_219 + 70);
							*((word32) a0_209 + 6) = (word16) (word32) *((word32) s0_219 + 78);
							struct Eq_168543 * s0_250;
							word32 mstatus_642;
							word32 s7_639;
							word32 s10_641;
							word32 s9_640;
							word32 s6_638;
							word32 s5_637;
							word32 a0_630;
							word32 a2_631;
							word32 s2_634;
							word32 s1_629;
							word32 tp_628;
							word32 a3_632;
							word32 a4_633;
							word32 s3_635;
							word32 s4_636;
							hci_send_2_host(ra_218, s0_219, a0_209, s2_221, s3_222, s4_223, s5_100 >> 0x10, dwLoc10, dwLoc0C, dwArg18, out tp_628, out s0_250, out s1_629, out a0_630, out a2_631, out a3_632, out a4_633, out s2_634, out s3_635, out s4_636, out s5_637, out s6_638, out s7_639, out s9_640, out s10_641, out mstatus_642);
							s0_250->b0053 = (byte) ((word32) s0_250->b0053 | 2);
						}
l230364D4:
						0x00 = dwArgA8;
						return;
					}
				}
			}
		}
	}
	word32 s0_613;
	word32 s1_614;
	word32 s2_615;
	word32 s4_617;
	word32 s5_618;
	word32 s3_616;
	llc_llcp_reject_ind_pdu_send(ra_282, s0_285, s1_271, s4_278, (word32) *s1_271, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_613, out s1_614, out s2_615, out s3_616, out s4_617, out s5_618);
	goto l230364D4;
}

// 2303664C: void llcp_con_param_rsp_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void llcp_con_param_rsp_handler(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	struct Eq_168612 * a4_26;
	Eq_2 s0_29;
	word32 s8_434;
	word32 a0_432;
	word32 a1_433;
	Eq_2 ra_28 = ble_ke_state_get(ra, a0, a1, out s0_29, out a0_432, out a1_433, out a4_26, out s8_434);
	Eq_2 s1_34 = a4_26->t0000;
	if (((word32) a4_26->b00A5 & 0x08) != 0x00)
	{
		word32 a4_436;
		word32 s2_437;
		word32 s4_439;
		word32 s3_438;
		word32 mstatus_441;
		word32 s5_440;
		word32 s1_435;
		llc_util_dicon_procedure(ra_28, s0_29, s0_29, 61, s5, dwLoc20, dwArgD8, out s1_435, out a4_436, out s2_437, out s3_438, out s4_439, out s5_440, out mstatus_441);
	}
	else if ((word32) a4_26->b00A3 != 0x07)
	{
		word32 s0_453;
		word32 s1_454;
		word32 s2_455;
		word32 s3_456;
		word32 s4_457;
		word32 s5_458;
		llc_llcp_reject_ind_pdu_send(ra_28, s0_29, s1_34, s0_29, (word32) *a3, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_453, out s1_454, out s2_455, out s3_456, out s4_457, out s5_458);
	}
	else
	{
		Eq_2 s0_52;
		struct Eq_168662 * s2_54;
		word32 s1_442;
		word32 a0_443;
		word32 a3_446;
		word32 a2_445;
		word32 a1_444;
		word32 a4_447;
		word32 s3_448;
		word32 s4_449;
		word32 s5_450;
		word32 s8_451;
		word32 mstatus_452;
		Eq_2 ra_51 = ble_ke_timer_clear(ra_28, s0_29, s1_34, 258, a1, a3, a1, s5, s4, dwArgE8, out s0_52, out s1_442, out a0_443, out a1_444, out a2_445, out a3_446, out a4_447, out s2_54, out s3_448, out s4_449, out s5_450, out s8_451, out mstatus_452);
		Eq_2 a0_63 = lld_get_mode(s0_52);
		if (a0_63 == 0x03)
		{
			Eq_2 s1_68 = *a0_63;
			if ((word32) *((word32) a0_63 + 4) >= (word32) s2_54->w0002 && (word32) s2_54->w0004 >= (word32) (*((word32) a0_63 + 2)))
			{
				a0_63->u0 = 0x04;
				up32 a4_198 = (word32) *((word32) a0_63 + 6);
				((word32) a0_63 + 2)->u2 = (word16) (word32) s2_54->w0002;
				((word32) a0_63 + 4)->u2 = (word16) (word32) s2_54->w0004;
				up32 a5_202 = (word32) s2_54->w0006;
				if (a5_202 < a4_198)
					a5_202 = a4_198;
				*((word32) a0_63 + 6) = (word16) a5_202;
				struct Eq_168796 * a4_207 = (word32) *((word32) a0_63 + 8);
				struct Eq_168796 * a5_209 = (word32) s2_54->w0008;
				if (a5_209 < a4_207)
					a5_209 = a4_207;
				((word32) a0_63 + 8)->u2 = (word16) a5_209;
				*((word32) a0_63 + 0x0A) = (word16) ((word32) a5_209->w0012 >> 625);
				Eq_2 s1_219 = a5_209->t0010;
				*((word32) a0_63 + 0x0C) = (word16) ((word32) a5_209->w0012 >> 625);
				word32 tp_471;
				word32 t1_472;
				word32 s0_473;
				word32 s1_474;
				word32 a0_475;
				word32 a2_476;
				word32 a3_477;
				word32 a4_478;
				word32 a5_479;
				word32 mstatus_480;
				ble_ke_msg_send(ra_51, s0_52, s1_219, a0_63, dwLoc10, out tp_471, out t1_472, out s0_473, out s1_474, out a0_475, out a2_476, out a3_477, out a4_478, out a5_479, out mstatus_480);
			}
			else
			{
				word32 s2_95;
				ui32 s4_135;
				Eq_2 s3_134;
				Eq_2 s0_129;
				Eq_2 s1_130;
				Eq_2 s5_136;
				Eq_2 ra_128 = llc_llcp_reject_ind_pdu_send(ra_51, s0_52, s1_68, s0_52, 0x10, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_129, out s1_130, out s2_95, out s3_134, out s4_135, out s5_136);
				ui32 a5_108 = (word32) *((word32) s1_130 + 92);
				if ((a5_108 & 64) != 0x00)
				{
					*((word32) s1_130 + 92) = (word16) (a5_108 & -65);
					if (llm_util_check_evt_mask(0x02) != 0x00)
					{
						word32 s2_470;
						ra_128 = llc_con_update_complete_send(ra_128, s0_129, 32, s0_129, s2_95 + 40, s3_134, s5_136, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_129, out s1_130, out s2_470, out s3_134, out s4_135, out s5_136);
					}
				}
				Eq_2 s1_164;
				Eq_2 s2_165;
				Eq_2 s3_166;
				Eq_2 s4_167;
				Eq_2 s0_172;
				word32 a0_459;
				word32 a2_460;
				word32 a4_461;
				word32 a5_462;
				word32 mstatus_463;
				Eq_2 ra_163 = ble_ke_state_set(ra_128, s0_129, s1_130, s3_134, s4_135 & 0x00FE, dwArgE8, out s0_172, out s1_164, out a0_459, out a2_460, out a4_461, out a5_462, out s2_165, out s3_166, out s4_167, out mstatus_463);
				*((word32) s1_164 + 0x00A3) = 0x00;
				word32 s0_464;
				word32 s1_465;
				word32 s2_466;
				word32 s3_467;
				word32 s4_468;
				word32 s5_469;
				llc_util_clear_operation_ptr(ra_163, s0_172, s1_164, s0_172, s2_165, s3_166, s4_167, s5_136, out s0_464, out s1_465, out s2_466, out s3_467, out s4_468, out s5_469);
			}
		}
	}
}

