pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23036796: void llcp_feats_rsp_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 byte) a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void llcp_feats_rsp_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, byte * a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	Eq_2 a0_23;
	Eq_2 s0_28;
	word32 s8_295;
	word32 a4_294;
	word32 a1_293;
	Eq_2 ra_27 = ble_ke_state_get(ra, s0, a1, out s0_28, out a0_23, out a1_293, out a4_294, out s8_295);
	if (((word32) *((word32) s0_28 + 0x00A5) & 0x08) != 0x00)
	{
		word32 s1_296;
		word32 a4_297;
		word32 s2_298;
		word32 s3_299;
		word32 s4_300;
		word32 s5_301;
		word32 mstatus_302;
		llc_util_dicon_procedure(ra_27, s0_28, a0, 61, s5, dwLoc20, dwArgD8, out s1_296, out a4_297, out s2_298, out s3_299, out s4_300, out s5_301, out mstatus_302);
	}
	else if ((a0_23 & 1) != 0x00 && (word32) (*((word32) s0_28 + 0x00A3)) == 0x01)
	{
		Eq_2 s0_92;
		Eq_2 s1_93;
		word32 s4_96;
		Eq_2 s5_97;
		word32 a0_309;
		word32 a1_310;
		word32 a2_311;
		word32 a3_312;
		word32 a4_313;
		word32 s2_314;
		word32 s3_315;
		word32 s8_316;
		word32 mstatus_317;
		Eq_2 ra_91 = ble_ke_timer_clear(ra_27, s0_28, a0, 258, (word32) (word16) (a0 << 0x08 | 1), a1, a0_23, s5, s4, dwArgE8, out s0_92, out s1_93, out a0_309, out a1_310, out a2_311, out a3_312, out a4_313, out s2_314, out s3_315, out s4_96, out s5_97, out s8_316, out mstatus_317);
		byte * a3_102 = s4_96 + 1;
		struct Eq_169054 * a5_103 = (word32) s0_92 + 0x0069;
		do
		{
			++a5_103;
			a5_103[0x0FFF] = (struct Eq_169054) (byte) ((word32) a5_103->b0000 & (word32) (*a3_102));
			++a3_102;
		} while (a5_103 != (word32) s0_92 + 113);
		*((word32) s0_92 + 92) = (word16) ((word32) *((word32) s0_92 + 92) | 1);
		Eq_2 s1_132;
		Eq_2 s2_133;
		ui32 s3_134;
		Eq_2 s0_143;
		Eq_2 ra_142 = llc_feats_rd_event_send(ra_91, s0_92, 0x00, s1_93, s4_96 + 1, s5_97, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8, out s0_143, out s1_132, out s2_133, out s3_134);
		*((word32) s0_143 + 0x00A3) = 0x00;
		word32 s0_318;
		word32 s1_319;
		word32 a0_320;
		word32 a2_321;
		word32 a4_322;
		word32 a5_323;
		word32 s2_324;
		word32 s3_325;
		word32 s4_326;
		word32 mstatus_327;
		ble_ke_state_set(ra_142, s0_143, s1_132, s2_133, s3_134 & 0x00FE, dwArgE8, out s0_318, out s1_319, out a0_320, out a2_321, out a4_322, out a5_323, out s2_324, out s3_325, out s4_326, out mstatus_327);
	}
	else
	{
		word32 s0_303;
		word32 s1_304;
		word32 s2_305;
		word32 s3_306;
		word32 s4_307;
		word32 s5_308;
		llc_llcp_reject_ind_pdu_send(ra_27, s0_28, a0, a0, (word32) *a3, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_303, out s1_304, out s2_305, out s3_306, out s4_307, out s5_308);
	}
}

// 23036860: void llcp_channel_map_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_169135) a3, Register Eq_2 s8, Stack Eq_2 dwArg08, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0128)
void llcp_channel_map_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, struct Eq_169135 * a3, Eq_2 s8, Eq_2 dwArg08, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0128)
{
	ui32 s3_25 = (word32) (a2 != 0x00);
	Eq_2 a0_37;
	Eq_2 a1_38;
	Eq_2 s0_42;
	Eq_2 s8_43;
	word32 a4_587;
	Eq_2 ra_41 = ble_ke_state_get(ra, s0, a1, out s0_42, out a0_37, out a1_38, out a4_587, out s8_43);
	if (a2 != 0x00)
		a3->bFFFFFFFF = 0x00;
	else
	{
		word32 a5_52 = (word32) a3->bFFFFFFFF;
		if (a5_52 != 0x00)
		{
			uint32 a5_54 = a5_52 + ~0x00 & 0x00FF;
			if (a5_54 > 0x04)
			{
				fn23036990(ra_41, s0_42, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
				return;
			}
			else
			{
				switch (g_a230B6034[a5_54 * 0x04])
				{
				case 0x00:
					fn2303696E(ra_41, s0_42, a2, a0_37, a1, dwArgD8);
					return;
				case 0x01:
					fn2303699C();
					return;
				case 0x02:
					fn23036990(ra_41, s0_42, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 0x03:
					fn230368C2(ra_41, s0_42, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 0x04:
					fn23036930(ra_41, s0_42, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 0x05:
					fn23036ADA(ra_41, s0_42, a2, a0_37, s3_25 << 1, a1, (char *) a3 - 2, s8, dwArgD8);
					return;
				case 0x06:
					fn23036A6A();
					return;
				case 0x07:
					fn23036B66(ra_41, s0_42, (char *) a3 - 2, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 0x08:
					fn23036A30(ra_41, s0_42, (char *) a3 - 2, dwLoc30, dwArgC8, dwArg0128);
					return;
				case 0x09:
					fn23036A90();
					return;
				case 0x0A:
					llcp_con_upd_ind_handler(ra_41, s0_42, a0_37, a1_38, a2, a0 << 0x02, s8_43, dwLoc30, dwArg08, dwArgC8, dwArgD8, dwArg0128);
					return;
				}
			}
		}
	}
	if (((word32) *((char *) *((char *) &g_t42026428 + a0 * 0x04) + 0x00A5) & 0x08) == 0x00)
	{
		Eq_2 s0_253 = *((word32) a0_37 + 16);
		if (lld_util_instant_ongoing(a0_37) == 0x00)
		{
			if (lld_get_mode(a0) != 0x04 || (a0_37 & 2) != 0x00)
			{
				a3->bFFFFFFFF = 0x05;
				if (a2 != 0x00)
					fn23036990(ra_41, s0_253, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
				else
					fn23036930(ra_41, s0_253, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
			}
			else
			{
				struct Eq_155377 * s8_262 = *((word32) s0_253 + 16);
				word32 s9_264 = (word32) a3->w0006;
				if ((word32) (word16) (s9_264 - (word32) s8_262->w0060) > 0x07FFFFFE)
				{
					a3->bFFFFFFFF = 0x03;
					if (a2 != 0x00)
						fn23036990(ra_41, s0_253, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
					else
						fn23036990(ra_41, s0_253, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
				}
				else
				{
					word32 a7_594;
					word32 a6_593;
					word32 a5_592;
					word32 a4_591;
					word32 a3_590;
					word32 a2_589;
					word32 a1_588;
					memcpy((word32) s0_253 + 99, &a3->bFFFFFFFF + 2, 0x05, out a1_588, out a2_589, out a3_590, out a4_591, out a5_592, out a6_593, out a7_594);
					Eq_2 s2_343 = lld_ch_map_ind(a2, s8_262, s9_264, dwLoc08);
					a3->bFFFFFFFF = 0x01;
					if (a2 != 0x00)
						fn23036990(ra_41, s0_253, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
					else
						fn2303696E(ra_41, s0_253, a2, s2_343, a1, dwArgD8);
				}
			}
		}
		else
		{
			a3->bFFFFFFFF = 0x02;
			if (a2 == 0x00)
				fn2303699C();
			else
				fn23036990(ra_41, s0_253, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
		}
	}
	else
	{
		a3->bFFFFFFFF = 0x04;
		if (a2 != 0x00)
			fn23036990(ra_41, s0_42, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
		else
			fn230368C2(ra_41, s0_42, (char *) a3 - 2, a0, dwLoc30, dwArgC8, dwArg0128);
	}
}

// 230368C2: void fn230368C2(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
void fn230368C2(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArgF8, Eq_2 dwArg0158)
{
	fn23036990(ra, s0, s5, s6, dwArg00, dwArgF8, dwArg0158);
}

// 23036930: void fn23036930(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
void fn23036930(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArgF8, Eq_2 dwArg0158)
{
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg104 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg124 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg164 = <invalid>;
	Eq_2 stackArg192 = <invalid>;
	Eq_2 stackArg196 = <invalid>;
	Eq_2 stackArg204 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	word32 s0_51;
	word32 s1_52;
	word32 s2_53;
	word32 s3_54;
	word32 s4_55;
	word32 s5_56;
	llc_llcp_reject_ind_pdu_send(ra, s0, s1, a0, a1, stackArg8, stackArg40, stackArg56, stackArg88, stackArg104, stackArg120, stackArg124, stackArg136, stackArg164, stackArg192, stackArg196, stackArg204, stackArg232, out s0_51, out s1_52, out s2_53, out s3_54, out s4_55, out s5_56);
	fn23036990(ra, s0, s5, s6, dwArg00, dwArgF8, dwArg0158);
}

// 2303696E: void fn2303696E(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Stack Eq_2 dwArg0108)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
void fn2303696E(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s4, Eq_2 dwArg0108)
{
	ui32 a5_5 = (word32) *((word32) s0 + 92);
	if (a5_5 << 0x14 >= 0x00)
	{
		*((word32) s0 + 92) = (word16) (a5_5 | 0x0400);
		((word32) s0 + 0x00A4)->u0 = 0x01;
		word32 s0_76;
		word32 s1_77;
		word32 a0_78;
		word32 a2_79;
		word32 a4_80;
		word32 a5_81;
		word32 s2_82;
		word32 s3_83;
		word32 s4_84;
		word32 mstatus_85;
		ble_ke_state_set(ra, s0, s1, s4, (s2 | 2) & 0x00FF, dwArg0108, out s0_76, out s1_77, out a0_78, out a2_79, out a4_80, out a5_81, out s2_82, out s3_83, out s4_84, out mstatus_85);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg0 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23036990(ra, s0, s5, s6, stackArg0, stackArg248, stackArg344);
	}
	else
	{
		*((word32) s0 + 92) = (word16) (a5_5 & ~0x00FFF800);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg0 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23036990(ra, s0, s5, s6, stackArg0, stackArg248, stackArg344);
	}
}

