pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23036990: void fn23036990(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
void fn23036990(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArgF8, Eq_2 dwArg0158)
{
	word32 s1_53;
	word32 a4_54;
	word32 s2_55;
	word32 s3_56;
	word32 s4_57;
	word32 s5_58;
	word32 mstatus_59;
	llc_util_dicon_procedure(ra, s0, s6, 40, s5, dwArg00, dwArgF8, out s1_53, out a4_54, out s2_55, out s3_56, out s4_57, out s5_58, out mstatus_59);
	0x00 = (int8) dwArg0158;
}

// 2303699C: void fn2303699C()
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
void fn2303699C()
{
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg0 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg344 = <invalid>;
	fn23036930(ra, s0, s5, s6, stackArg0, stackArg248, stackArg344);
}

// 230369CA: void llcp_con_upd_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s8, Stack Eq_2 dwArg00, Stack Eq_2 dwArg38, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0158)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
void llcp_con_upd_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s8, Eq_2 dwArg00, Eq_2 dwArg38, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0158)
{
}

// 23036A30: void fn23036A30(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
void fn23036A30(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArgF8, Eq_2 dwArg0158)
{
	fn23036B66(ra, s0, s5, dwArg00, dwArgF8, dwArg0158);
}

// 23036A6A: void fn23036A6A()
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
void fn23036A6A()
{
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg104 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg124 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg164 = <invalid>;
	Eq_2 stackArg192 = <invalid>;
	Eq_2 stackArg196 = <invalid>;
	Eq_2 stackArg204 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	word32 s0_26;
	word32 s1_27;
	word32 s2_28;
	word32 s3_29;
	word32 s4_30;
	word32 s5_31;
	llc_llcp_reject_ind_pdu_send(ra, s0, s1, a0, a1, stackArg8, stackArg40, stackArg56, stackArg88, stackArg104, stackArg120, stackArg124, stackArg136, stackArg164, stackArg192, stackArg196, stackArg204, stackArg232, out s0_26, out s1_27, out s2_28, out s3_29, out s4_30, out s5_31);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg0 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg344 = <invalid>;
	fn23036B66(ra, s0, s5, stackArg0, stackArg248, stackArg344);
}

// 23036A90: void fn23036A90()
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
void fn23036A90()
{
	fn23036A6A();
}

// 23036ADA: void fn23036ADA(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0108)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
void fn23036ADA(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 dwArg04, Eq_2 dwArg0108)
{
	Eq_2 ra_100;
	Eq_2 s0_101;
	Eq_2 s5_75;
	s0_101 = s0;
	ra_100 = ra;
	s5_75 = s5;
	if ((s2 & 1) != 0x00)
	{
		s0_101 = s0;
		ra_100 = ra;
		s5_75 = s5;
		if (((word32) *((word32) s0 + 0x00A3) + ~0x06 & 0x00FF) <= 0x01)
		{
			Eq_2 s0_27;
			Eq_2 s1_28;
			ui32 s2_29;
			Eq_2 s4_31;
			Eq_2 s5_32;
			word32 a1_207;
			word32 a0_206;
			word32 a2_208;
			word32 a3_209;
			word32 a4_210;
			word32 s3_211;
			word32 s8_212;
			word32 mstatus_213;
			Eq_2 ra_26 = ble_ke_timer_clear(ra, s0, s1, 258, s4, s2, s3, s5, dwArg04, dwArg0108, out s0_27, out s1_28, out a0_206, out a1_207, out a2_208, out a3_209, out a4_210, out s2_29, out s3_211, out s4_31, out s5_32, out s8_212, out mstatus_213);
			*((word32) s0_27 + 0x00A3) = 0x00;
			Eq_2 s1_50;
			Eq_2 s2_51;
			Eq_2 s3_52;
			Eq_2 s4_53;
			Eq_2 s0_58;
			word32 a0_214;
			word32 a2_215;
			word32 a4_216;
			word32 a5_217;
			word32 mstatus_218;
			ra_100 = llc_util_clear_operation_ptr(ble_ke_state_set(ra_26, s0_27, s1_28, s4_31, s2_29 & 0x00FE, dwArg0108, out s0_58, out s1_50, out a0_214, out a2_215, out a4_216, out a5_217, out s2_51, out s3_52, out s4_53, out mstatus_218), s0_58, s1_50, s5_32, s2_51, s3_52, s4_53, s5_32, out s0_101, out s1, out s2, out s3, out s4, out s5_75);
		}
	}
	if ((word32) *((word32) s0_101 + 0x00A4) == 0x03)
	{
		word32 a0_219;
		word32 a1_220;
		word32 a2_221;
		word32 a3_222;
		word32 a4_223;
		word32 s3_224;
		word32 s5_225;
		word32 s8_226;
		word32 mstatus_227;
		ra_100 = ble_ke_timer_clear(ra_100, s0_101, s1, 258, s4, s2, s3, s5_75, dwArg04, dwArg0108, out s0_101, out s1, out a0_219, out a1_220, out a2_221, out a3_222, out a4_223, out s2, out s3_224, out s4, out s5_225, out s8_226, out mstatus_227);
	}
	ui32 a5_113 = (word32) *((word32) s0_101 + 92);
	if (a5_113 << 0x14 >= 0x00)
	{
		*((word32) s0_101 + 92) = (word16) (a5_113 | 0x0400);
		((word32) s0_101 + 0x00A4)->u0 = 0x04;
		word32 s0_231;
		word32 s1_232;
		word32 a0_233;
		word32 a2_234;
		word32 a4_235;
		word32 a5_236;
		word32 s2_237;
		word32 s3_238;
		word32 s4_239;
		word32 mstatus_240;
		ble_ke_state_set(ra_100, s0_101, s1, s4, (s2 | 2) & 0x00FF, dwArg0108, out s0_231, out s1_232, out a0_233, out a2_234, out a4_235, out a5_236, out s2_237, out s3_238, out s4_239, out mstatus_240);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg0 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23036B66(ra, s0, s5, stackArg0, stackArg248, stackArg344);
	}
	else
	{
		*((word32) s0_101 + 92) = (word16) (a5_113 & ~0x00FFF800);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg0 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg344 = <invalid>;
		fn23036B66(ra, s0, s5, stackArg0, stackArg248, stackArg344);
	}
}

