pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23036B66: void fn23036B66(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
void fn23036B66(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArgF8, Eq_2 dwArg0158)
{
	word32 s1_52;
	word32 a4_53;
	word32 s2_54;
	word32 s3_55;
	word32 s4_56;
	word32 s5_57;
	word32 mstatus_58;
	llc_util_dicon_procedure(ra, s0, s5, 40, s5, dwArg00, dwArgF8, out s1_52, out a4_53, out s2_54, out s3_55, out s4_56, out s5_57, out mstatus_58);
	0x00 = (int8) dwArg0158;
}

// 23036B90: void llc_llcp_con_update_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_169902) a1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8)
void llc_llcp_con_update_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_169902 * a1, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8)
{
	word32 s0_82;
	word32 s1_83;
	word32 a4_84;
	word32 s2_85;
	word32 s3_86;
	word32 s4_87;
	word32 s5_88;
	word32 s6_89;
	word32 s7_90;
	word32 mstatus_91;
	llc_llcp_send(ra, s0, s1, fp + ~0x1B, 0x00, dwLoc20, SEQ((word16) (word32) a1->w0002, (byte) (word32) a1->b0001, 0x00), SEQ((word16) (word32) a1->w0006, (word16) (word32) a1->w0004), dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_82, out s1_83, out a4_84, out s2_85, out s3_86, out s4_87, out s5_88, out s6_89, out s7_90, out mstatus_91);
}

// 23036BDA: void llc_llcp_con_param_req_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_169971) a1, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8)
void llc_llcp_con_param_req_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_169971 * a1, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgBC, Eq_2 dwArgD8)
{
	word32 s0_102;
	word32 s1_103;
	word32 a4_104;
	word32 s2_105;
	word32 s3_106;
	word32 s4_107;
	word32 s5_108;
	word32 s6_109;
	word32 s7_110;
	word32 mstatus_111;
	llc_llcp_send(ra, s0, s1, fp + -44, 0x0F, dwLoc30, SEQ((word16) (word32) a1->w000E, bLoc2B, 0x0F), SEQ((word16) (word32) a1->w0006, (word16) (word32) a1->w0010), SEQ((word16) (word32) a1->w0016, (word16) (word32) a1->w0014), SEQ((word16) (word32) a1->w001E, (word16) (word32) a1->w001C), dwLoc08, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg94, dwArgB0, dwArgB4, dwArgBC, dwArgD8, out s0_102, out s1_103, out a4_104, out s2_105, out s3_106, out s4_107, out s5_108, out s6_109, out s7_110, out mstatus_111);
}

// 23036C56: Register Eq_2 llc_llcp_con_param_rsp_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      llcp_con_param_req_handler
//      hci_le_rem_con_param_req_reply_cmd_handler
Eq_2 llc_llcp_con_param_rsp_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgBC, Eq_2 dwArgD8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	ptr32 s0_49;
	ptr32 s1_50;
	ptr32 s3_51;
	ptr32 s4_52;
	ptr32 s5_53;
	ptr32 s6_54;
	ptr32 s2_61;
	ptr32 s7_62;
	word32 a4_110;
	word32 mstatus_111;
	Eq_2 ra_48 = llc_llcp_send(ra, s0, s1, fp + -44, 0x10, dwLoc30, SEQ((word16) (word32) *((word32) a1 + 0x0E), bLoc2B, 0x10), SEQ((word16) (word32) *((word32) a1 + 6), (word16) (word32) *((word32) a1 + 16)), SEQ((word16) (word32) *((word32) a1 + 22), (word16) (word32) *((word32) a1 + 20)), SEQ((word16) (word32) *((word32) a1 + 30), (word16) (word32) *((word32) a1 + 28)), dwLoc08, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg94, dwArgB0, dwArgB4, dwArgBC, dwArgD8, out s0_49, out s1_50, out a4_110, out s2_61, out s3_51, out s4_52, out s5_53, out s6_54, out s7_62, out mstatus_111);
	s0Out = s0_49;
	s1Out = s1_50;
	s2Out = s2_61;
	s3Out = s3_51;
	s4Out = s4_52;
	s5Out = s5_53;
	s6Out = s6_54;
	s7Out = s7_62;
	return ra_48;
}

// 23036CD2: void llcp_con_param_req_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8)
void llcp_con_param_req_handler(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8)
{
	ui32 a0_25;
	word32 a1_736;
	word32 s8_738;
	word32 a4_737;
	Eq_2 s0_120;
	Eq_2 ra_29 = ble_ke_state_get(ra, a3, a1, out s0_120, out a0_25, out a1_736, out a4_737, out s8_738);
	Eq_2 s2_37 = *((char *) &g_t42026428 + a0 * 0x04);
	Eq_2 s1_121 = a0;
	if (((word32) *((word32) s2_37 + 0x00A5) & 0x08) != 0x00)
	{
		word32 s1_739;
		word32 a4_740;
		word32 s5_744;
		word32 s2_741;
		word32 s3_742;
		word32 s4_743;
		word32 mstatus_745;
		llc_util_dicon_procedure(ra_29, s0_120, a0, 61, s5, dwLoc50, dwArgA8, out s1_739, out a4_740, out s2_741, out s3_742, out s4_743, out s5_744, out mstatus_745);
		return;
	}
	up32 a1_335;
	if ((a0_25 & 2) != 0x00)
	{
l23036D2E:
		goto l23036D32;
	}
	if (lld_get_mode(a0) == 0x03 && (a0_25 & 1) != 0x00)
	{
		word32 a5_47 = (word32) *((word32) s2_37 + 0x00A3);
		if (a5_47 == 0x07 || a5_47 == 0x09)
			goto l23036D2E;
		if (a5_47 == 0x06)
		{
l23036D32:
			a1_335 = (word32) *s0_120;
			goto l23036D36;
		}
	}
	uint32 a1_53 = (word32) *((word32) s0_120 + 2);
	uint32 a4_54 = (word32) *((word32) s0_120 + 4);
	if (a4_54 >= a1_53)
	{
		Eq_170255 a2_55 = (word32) *((word32) s0_120 + 6);
		if (a2_55 <= 499 && (a4_54 <= 0x00FFFC80 && a1_53 > 0x05))
		{
			ui32 a3_60 = (word32) *((word32) s0_120 + 8);
			if ((word32) (word16) (a3_60 + -0x0A) <= 0x00FFFC76 && ((word32) a2_55.u1 + 1) + a4_54 < a3_60 << 0x02)
			{
				Eq_2 a0_216;
				Eq_2 s1_227;
				Eq_2 ra_225;
				Eq_2 a5_239;
				Eq_2 s0_226;
				Eq_2 dwLoc40_473;
				struct Eq_170289 * a0_69 = *((word32) s2_37 + 16);
				uint32 a5_70 = (word32) a0_69->w0078;
				if (a5_70 >> 1 >= a1_53 && (a4_54 >= a5_70 >> 1 && (a2_55 == (word32) a0_69->w005E + ~0x00 && (word32) (*((word32) s2_37 + 84)) == a3_60)))
				{
					if (lld_get_mode(a0) == 0x03)
					{
						struct Eq_170378 * s2_228;
						word32 a2_764;
						word32 a1_763;
						word32 a4_766;
						word32 a6_767;
						word32 a3_765;
						word32 s3_769;
						word32 a7_768;
						word32 mstatus_772;
						word32 s4_770;
						word32 s8_771;
						ra_225 = ble_ke_msg_alloc(ra_29, s0_120, a0, 265, a1, a1, 0x0022, s2_37, a1, dwArgD8, out s0_226, out s1_227, out a0_216, out a1_763, out a2_764, out a3_765, out a4_766, out a6_767, out a7_768, out s2_228, out s3_769, out s4_770, out s8_771, out mstatus_772);
						*a0_216 = 0x02;
						*((word32) a0_216 + 2) = (word16) (word32) *((word32) s0_226 + 2);
						*((word32) a0_216 + 4) = (word16) (word32) *((word32) s0_226 + 4);
						*((word32) a0_216 + 8) = (word16) (word32) s2_228->w0054;
						*((word32) a0_216 + 0x0A) = (word16) ((word32) s2_228->ptr0010->w0012 >> 625);
						*((word32) a0_216 + 0x0C) = (word16) ((word32) s2_228->ptr0010->w0012 >> 625);
						a5_239 = a0_216;
l23036E02:
						*((word32) a5_239 + 0x0E) = (word16) (word32) *((word32) s0_226 + 2);
						*((word32) a5_239 + 16) = (word16) (word32) *((word32) s0_226 + 4);
						*((word32) a5_239 + 6) = (word16) (word32) *((word32) s0_226 + 6);
						*((word32) a5_239 + 8) = (word16) (word32) *((word32) s0_226 + 8);
						*((word32) a5_239 + 18) = (byte) (word32) *((word32) s0_226 + 0x0A);
						*((word32) a5_239 + 20) = (word16) (word32) *((word32) s0_226 + 0x0C);
						*((word32) a5_239 + 22) = (word16) (word32) *((word32) s0_226 + 0x0E);
						*((word32) a5_239 + 24) = (word16) (word32) *((word32) s0_226 + 16);
						*((word32) a5_239 + 26) = (word16) (word32) *((word32) s0_226 + 18);
						*((word32) a5_239 + 28) = (word16) (word32) *((word32) s0_226 + 20);
						*((word32) a5_239 + 30) = (word16) (word32) *((word32) s0_226 + 22);
						*((word32) a5_239 + 32) = (word16) (word32) *((word32) s0_226 + 24);
						word32 a3_779;
						word32 a5_781;
						word32 mstatus_782;
						word32 a4_780;
						word32 tp_773;
						word32 s0_775;
						word32 t1_774;
						word32 a0_777;
						word32 s1_776;
						word32 a2_778;
						ble_ke_msg_send(ra_225, s0_226, s1_227, a0_216, dwLoc40_473, out tp_773, out t1_774, out s0_775, out s1_776, out a0_777, out a2_778, out a3_779, out a4_780, out a5_781, out mstatus_782);
						return;
					}
					if (lld_get_mode(a0) != 0x04)
						return;
					word16 wLoc36_431 = (word16) (word32) *((word32) s0_120 + 2);
					word16 wLoc3E_433 = (word16) (word32) *((word32) s0_120 + 6);
					word16 wLoc28_440 = (word16) (word32) *((word32) s0_120 + 20);
					word16 wLoc26_441 = (word16) (word32) *((word32) s0_120 + 22);
					word32 a0_112;
					struct Eq_170605 * s2_122;
					ui32 s4_123;
					word32 s8_783;
					s0_120 = lld_con_param_rsp(fp + -0x0044, out s1_121, out a0_112, out s2_122, out s4_123, out s8_783);
					Eq_2 dwLoc38_447 = SEQ(wLoc36_431, wLoc38);
					dwLoc28 = SEQ(wLoc26_441, wLoc28_440);
					dwLoc40_473 = SEQ(wLoc3E_433, wLoc40);
					if (a0_112 == 0x00)
					{
						s2_122->b00A4 = 0x03;
						Eq_2 s1_149;
						Eq_2 s0_157;
						Eq_2 s0_170;
						Eq_2 s1_171;
						Eq_2 s2_174;
						Eq_2 s3_175;
						Eq_2 s4_176;
						Eq_2 s5_177;
						Eq_2 s6_178;
						word32 s5_799;
						word32 s6_800;
						word32 mstatus_801;
						word32 s7_792;
						word32 s3_797;
						word32 s4_798;
						word32 s0_793;
						word32 a5_795;
						word32 s2_796;
						word32 s1_794;
						word32 a2_785;
						word32 s4_790;
						word32 mstatus_791;
						word32 a4_786;
						word32 s2_788;
						word32 s3_789;
						word32 a5_787;
						word32 a0_784;
						ble_ke_timer_set(llc_llcp_con_param_rsp_pdu_send(ble_ke_state_set(ra_29, s0_120, s1_121, a1, (s4_123 | 2) & 0x00FF, dwArgB8, out s0_157, out s1_149, out a0_784, out a2_785, out a4_786, out a5_787, out s2_788, out s3_789, out s4_790, out mstatus_791), s0_157, s1_149, fp + -0x0044, dwLoc38_447, dwLoc28, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg44, dwArg60, dwArg64, dwArg6C, dwArg88, out s0_170, out s1_171, out s2_174, out s3_175, out s4_176, out s5_177, out s6_178, out s7_792), s0_170, s1_171, 258, s3_175, 0x00FFFFA0, s2_174, s3_175, s4_176, s5_177, s6_178, dwLoc40_473, dwArg58, dwArgB8, out s0_793, out s1_794, out a5_795, out s2_796, out s3_797, out s4_798, out s5_799, out s6_800, out mstatus_801);
						return;
					}
				}
				else if (llm_util_check_evt_mask(0x05) != 0x00)
				{
					word32 a7_757;
					word32 a2_753;
					word32 a1_752;
					word32 a4_755;
					word32 a3_754;
					word32 a6_756;
					word32 s2_758;
					word32 mstatus_762;
					word32 s8_761;
					word32 s3_759;
					word32 s4_760;
					ra_225 = ble_ke_msg_alloc(ra_29, s0_120, a0, 265, a1, a1, 0x0022, s2_37, a1, dwArgD8, out s0_226, out s1_227, out a0_216, out a1_752, out a2_753, out a3_754, out a4_755, out a6_756, out a7_757, out s2_758, out s3_759, out s4_760, out s8_761, out mstatus_762);
					*a0_216 = 0x03;
					a5_239 = a0_216;
					goto l23036E02;
				}
l23036DBA:
				a1_335 = 0x0F;
l23036D36:
				word32 s0_746;
				word32 s2_748;
				word32 s1_747;
				word32 s5_751;
				word32 s4_750;
				word32 s3_749;
				llc_llcp_reject_ind_pdu_send(ra_29, s0_120, s1_121, s1_121, a1_335, dwLoc48, dwLoc28, dwLoc18, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg38, ra, dwArg70, dwArg74, dwArg7C, dwArg98, out s0_746, out s1_747, out s2_748, out s3_749, out s4_750, out s5_751);
				return;
			}
		}
	}
	goto l23036DBA;
}

// 23036F7A: Register Eq_2 llc_llcp_feats_req_pdu_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      hci_le_rd_rem_used_feats_cmd_handler
Eq_2 llc_llcp_feats_req_pdu_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	word32 a5_13 = 0x0E;
	if (lld_get_mode(a0) == 0x03)
		a5_13 = 0x08;
	llm_util_get_supp_features();
	byte bLoc1C_62 = (byte) a5_13;
	ptr32 s0_40;
	ptr32 s1_41;
	ptr32 s3_42;
	ptr32 s4_43;
	ptr32 s5_44;
	ptr32 s6_45;
	ptr32 s2_52;
	word32 mstatus_111;
	word32 s7_110;
	word32 a4_109;
	Eq_2 ra_39 = llc_llcp_send(ra, a0, s1, fp + ~0x1B, (word32) bLoc1C_62, dwLoc20, SEQ(nLoc1B, bLoc1C_62), dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_40, out s1_41, out a4_109, out s2_52, out s3_42, out s4_43, out s5_44, out s6_45, out s7_110, out mstatus_111);
	s0Out = s0_40;
	s1Out = s1_41;
	s2Out = s2_52;
	s3Out = s3_42;
	s4Out = s4_43;
	s5Out = s5_44;
	s6Out = s6_45;
	return ra_39;
}

// 23036FB2: void llc_llcp_feats_rsp_pdu_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8)
// Called from:
//      llcp_slave_feature_req_handler
void llc_llcp_feats_rsp_pdu_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8)
{
	llm_util_get_supp_features();
	word32 s0_82;
	word32 s1_83;
	word32 a4_84;
	word32 s2_85;
	word32 s3_86;
	word32 s4_87;
	word32 s5_88;
	word32 s6_89;
	word32 s7_90;
	word32 mstatus_91;
	llc_llcp_send(ra, a0, s1, fp + ~0x1B, 0x09, dwLoc20, SEQ(wLoc1A, (byte) (word32) *((char *) *((char *) &g_t42026428 + a0 * 0x04) + 0x0069), 0x09), dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_82, out s1_83, out a4_84, out s2_85, out s3_86, out s4_87, out s5_88, out s6_89, out s7_90, out mstatus_91);
}

// 23036FF6: Register Eq_2 llc_llcp_start_enc_req_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_170831) a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      llc_enc_mgt_ind_handler
Eq_2 llc_llcp_start_enc_req_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_170831 * a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	a0->w280080EE = (word16) ((word32) a0->w280080EE | 0x0100);
	((Eq_582870[]) 0x00A5)[a0].b0000 = (byte) ((word32) ((Eq_582869[]) 0x00A5)[a0].b0000 | 2);
	a0->w28008128 = 0x00;
	a0->w2800812A = 0x00;
	a0->w2800812C = 0x00;
	a0->w2800812E = 0x00;
	a0->w28008130 = 0x00;
	a0->w28008132 = 0x00;
	ptr32 s0_57;
	ptr32 s1_58;
	ptr32 s3_59;
	ptr32 s4_60;
	ptr32 s5_61;
	ptr32 s6_62;
	ptr32 s2_69;
	word32 a4_104;
	word32 s7_105;
	word32 mstatus_106;
	Eq_2 ra_56 = llc_llcp_send(ra, s0, s1, fp + ~0x13, 0x05, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_57, out s1_58, out a4_104, out s2_69, out s3_59, out s4_60, out s5_61, out s6_62, out s7_105, out mstatus_106);
	s0Out = s0_57;
	s1Out = s1_58;
	s2Out = s2_69;
	s3Out = s3_59;
	s4Out = s4_60;
	s5Out = s5_61;
	s6Out = s6_62;
	return ra_56;
}

