pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23037088: Register Eq_2 llc_llcp_terminate_ind_pdu_send(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out (ptr32 uint16) s1Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      llc_enc_mgt_ind_handler
//      hci_le_ltk_req_neg_reply_cmd_handler
//      hci_disconnect_cmd_handler
Eq_2 llc_llcp_terminate_ind_pdu_send(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgBC, Eq_2 dwArgD8, word32 dwArg0128, ptr32 & s0Out, uint16 & s1Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 s0_13 = (word32) (word16) (a0 << 0x08 | 1);
	struct Eq_170958 * s2_25 = *((char *) &g_t42026428 + a0 * 0x04);
	ui32 a0_26;
	word32 a1_27;
	Eq_2 s0_31;
	word32 s8_187;
	word32 a4_186;
	Eq_2 ra_30 = ble_ke_state_get(ra, s0_13, s0_13, out s0_31, out a0_26, out a1_27, out a4_186, out s8_187);
	word32 a5_36 = 22;
	if (a1_27 != 0x13)
		a5_36 = a1_27;
	s2_25->b00A1 = (byte) a5_36;
	Eq_2 s1_62;
	Eq_2 s0_70;
	Eq_2 s0_84;
	Eq_2 s1_85;
	Eq_2 s3_86;
	Eq_2 s4_87;
	Eq_2 s5_88;
	Eq_2 s6_89;
	Eq_2 s2_96;
	uint16 * s1_115;
	union Eq_2 * s2_116;
	ptr32 s3_117;
	ptr32 s4_118;
	ptr32 s5_119;
	word32 s6_201;
	word32 a5_200;
	word32 s0_199;
	word32 mstatus_198;
	word32 s7_197;
	word32 a4_196;
	word32 mstatus_195;
	word32 s4_194;
	word32 s3_193;
	word32 s2_192;
	word32 a5_191;
	word32 a4_190;
	word32 a2_189;
	word32 a0_188;
	word32 mstatus_202;
	Eq_2 ra_113 = ble_ke_timer_set(llc_llcp_send(ble_ke_state_set(ra_30, s0_31, a0, s0_31, (a0_26 | 0x0F) & 0x00FF, dwArgD8, out s0_70, out s1_62, out a0_188, out a2_189, out a4_190, out a5_191, out s2_192, out s3_193, out s4_194, out mstatus_195), s0_70, s1_62, fp + -20, 0x02, dwLoc30, dwLoc2C, dwLoc28, s2, dwLoc18, dwLoc08, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg94, dwArgB0, dwArgB4, dwArgBC, dwArgD8, out s0_84, out s1_85, out a4_196, out s2_96, out s3_86, out s4_87, out s5_88, out s6_89, out s7_197, out mstatus_198), s0_84, s1_85, 258, s0_84, (word32) *((word32) s2_96 + 84), s2_96, s3_86, s4_87, s5_88, s6_89, s2, dwArg78, dwArgD8, out s0_199, out s1_115, out a5_200, out s2_116, out s3_117, out s4_118, out s5_119, out s6_201, out mstatus_202);
	0x00 = dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_115;
	s2Out = s2_116;
	s3Out = s3_117;
	s4Out = s4_118;
	s5Out = s5_119;
	return ra_113;
}

// 2303710A: void llc_llcp_unknown_rsp_send_pdu(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8)
// Called from:
//      llc_llcp_recv_ind_handler
void llc_llcp_unknown_rsp_send_pdu(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8)
{
	word32 s0_67;
	word32 s1_68;
	word32 a4_69;
	word32 s2_70;
	word32 s3_71;
	word32 s4_72;
	word32 s5_73;
	word32 s6_74;
	word32 s7_75;
	word32 mstatus_76;
	llc_llcp_send(ra, s0, s1, fp + ~0x13, 0x07, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_67, out s1_68, out a4_69, out s2_70, out s3_71, out s4_72, out s5_73, out s6_74, out s7_75, out mstatus_76);
}

// 2303712A: void llc_llcp_unknown_ind_handler.isra.1(Register Eq_2 a0)
// Called from:
//      llcp_slave_feature_req_handler
//      llc_llcp_recv_handler
void llc_llcp_unknown_ind_handler.isra.1(Eq_2 a0)
{
	if (((word32) *((char *) *((char *) &g_t42026428 + a0 * 0x04) + 0x00A5) & 0x08) != 0x00)
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg0 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		word32 s1_31;
		word32 a4_32;
		word32 s2_33;
		word32 s3_34;
		word32 s4_35;
		word32 s5_36;
		word32 mstatus_37;
		llc_util_dicon_procedure(ra, s0, a0, a1, s5, stackArg0, stackArg248, out s1_31, out a4_32, out s2_33, out s3_34, out s4_35, out s5_36, out mstatus_37);
	}
	else
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg8 = <invalid>;
		Eq_2 stackArg40 = <invalid>;
		Eq_2 stackArg56 = <invalid>;
		Eq_2 stackArg88 = <invalid>;
		Eq_2 stackArg104 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg124 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg164 = <invalid>;
		Eq_2 stackArg192 = <invalid>;
		Eq_2 stackArg196 = <invalid>;
		Eq_2 stackArg204 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		llc_llcp_unknown_rsp_send_pdu(ra, s0, s1, stackArg8, stackArg40, stackArg56, stackArg88, stackArg104, stackArg120, stackArg124, stackArg136, stackArg164, stackArg192, stackArg196, stackArg204, stackArg232);
	}
}

// 2303715C: void llcp_feats_req_handler(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 byte) a3, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack word32 dwArg0128)
// Called from:
//      llcp_slave_feature_req_handler
void llcp_feats_req_handler(Eq_2 ra, Eq_2 a0, byte * a3, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, word32 dwArg0128)
{
	struct Eq_171185 * s2_21 = *((char *) &g_t42026428 + a0 * 0x04);
	struct Eq_171190 * a5_25 = (struct Eq_171190 *) 0x04;
	if (lld_get_mode(a0) != 0x04)
	{
		a5_25 = (struct Eq_171190 *) 0x08;
		if ((word32) *a3 == 0x08)
		{
			llc_llcp_unknown_ind_handler.isra.1(a0);
			goto l230371A0;
		}
	}
	Eq_2 s0_32 = a5_25->t0000;
	if (((word32) a5_25->b00A5 & 0x08) != 0x00)
	{
		word32 a4_235;
		word32 s2_236;
		word32 s3_237;
		word32 s4_238;
		word32 s5_239;
		word32 mstatus_240;
		word32 s1_234;
		llc_util_dicon_procedure(ra, s0_32, a0, 61, s5, dwLoc30, dwArgC8, out s1_234, out a4_235, out s2_236, out s3_237, out s4_238, out s5_239, out mstatus_240);
	}
	else
	{
		struct Eq_171237 * a5_36 = (char *) &s2_21->w005C + 0x0D;
		byte * a3_38 = a3 + 1;
		do
		{
			++a5_36;
			a5_36[0x0FFF] = (struct Eq_171237) (byte) ((word32) a5_36->b0000 & (word32) (*a3_38));
			++a3_38;
		} while (a5_36 != (char *) (&s2_21->w005C) + 21);
		s2_21->w005C = (word16) ((word32) s2_21->w005C | 1);
		llc_llcp_feats_rsp_pdu_send(ra, a0, a0, dwLoc28, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg74, dwArg90, dwArg94, dwArg9C, dwArgB8);
	}
l230371A0:
	0x00 = dwArg0128;
}

// 230371FC: void llcp_slave_feature_req_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 byte) a3, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack word32 dwArg0128)
void llcp_slave_feature_req_handler(Eq_2 ra, Eq_2 a0, Eq_2 a1, byte * a3, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, word32 dwArg0128)
{
	if (lld_get_mode(a0) != 0x03)
		llc_llcp_unknown_ind_handler.isra.1(a1);
	else
		llcp_feats_req_handler(ra, a1, a3, s5, dwArg08, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg74, dwArg90, dwArg94, dwArg9C, dwArgB8, dwArgC8, dwArg0128);
}

// 23037238: Register Eq_2 llc_llcp_ping_req_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      llc_auth_payl_nearly_to_ind_handler
Eq_2 llc_llcp_ping_req_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 s0_24;
	ptr32 s1_25;
	ptr32 s3_26;
	ptr32 s4_27;
	ptr32 s5_28;
	ptr32 s6_29;
	ptr32 s2_36;
	word32 a4_71;
	word32 s7_72;
	word32 mstatus_73;
	Eq_2 ra_23 = llc_llcp_send(ra, s0, s1, fp + ~0x13, 0x12, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_24, out s1_25, out a4_71, out s2_36, out s3_26, out s4_27, out s5_28, out s6_29, out s7_72, out mstatus_73);
	s0Out = s0_24;
	s1Out = s1_25;
	s2Out = s2_36;
	s3Out = s3_26;
	s4Out = s4_27;
	s5Out = s5_28;
	s6Out = s6_29;
	return ra_23;
}

// 23037254: void llc_llcp_ping_rsp_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8)
// Called from:
//      llcp_ping_req_handler
void llc_llcp_ping_rsp_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8)
{
	word32 s0_64;
	word32 s1_65;
	word32 a4_66;
	word32 s2_67;
	word32 s3_68;
	word32 s4_69;
	word32 s5_70;
	word32 s6_71;
	word32 s7_72;
	word32 mstatus_73;
	llc_llcp_send(ra, s0, s1, fp + ~0x13, 0x13, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_64, out s1_65, out a4_66, out s2_67, out s3_68, out s4_69, out s5_70, out s6_71, out s7_72, out mstatus_73);
}

