pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23037270: void llcp_ping_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void llcp_ping_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	if (((word32) *((char *) *((char *) &g_t42026428 + a0 * 0x04) + 0x00A5) & 0x08) != 0x00)
	{
		word32 s1_119;
		word32 a4_120;
		word32 s2_121;
		word32 s3_122;
		word32 s4_123;
		word32 s5_124;
		word32 mstatus_125;
		llc_util_dicon_procedure(ra, s0, a0, 61, s5, dwLoc10, dwArgE8, out s1_119, out a4_120, out s2_121, out s3_122, out s4_123, out s5_124, out mstatus_125);
	}
	else
		llc_llcp_ping_rsp_pdu_send(ra, s0, s1, dwLoc08, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg94, dwArgB0, dwArgB4, dwArgBC, dwArgD8);
}

// 230372A2: Register Eq_2 llc_llcp_length_req_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register ui32 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      llc_length_req_ind_handler
Eq_2 llc_llcp_length_req_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, ui32 a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	struct Eq_171483 * a5_11 = *((char *) &g_t42026428 + a0 * 0x04);
	ptr32 s0_37;
	ptr32 s1_38;
	ptr32 s3_39;
	ptr32 s4_40;
	ptr32 s5_41;
	ptr32 s6_42;
	ptr32 s2_49;
	word32 a4_89;
	word32 s7_90;
	word32 mstatus_91;
	Eq_2 ra_36 = llc_llcp_send(ra, s0, s1, fp + ~0x1B, 0x14, dwLoc20, SEQ((word16) (word32) a5_11->w0044, bLoc1B, 0x14), SEQ((word16) (word32) a5_11->w0042, (word16) (word32) a5_11->w004C), dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_37, out s1_38, out a4_89, out s2_49, out s3_39, out s4_40, out s5_41, out s6_42, out s7_90, out mstatus_91);
	s0Out = s0_37;
	s1Out = s1_38;
	s2Out = s2_49;
	s3Out = s3_39;
	s4Out = s4_40;
	s5Out = s5_41;
	s6Out = s6_42;
	return ra_36;
}

// 230372EE: Register Eq_2 llc_llcp_length_rsp_pdu_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      llcp_length_req_handler
Eq_2 llc_llcp_length_rsp_pdu_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgCC, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	struct Eq_171559 * a5_11 = *((char *) &g_t42026428 + a0 * 0x04);
	ptr32 s0_37;
	ptr32 s1_38;
	ptr32 s3_39;
	ptr32 s5_41;
	ptr32 s2_49;
	word32 a4_87;
	word32 s4_88;
	word32 s6_89;
	word32 s7_90;
	word32 mstatus_91;
	Eq_2 ra_36 = llc_llcp_send(ra, s0, s1, fp + ~0x1B, 0x15, dwLoc20, SEQ((word16) (word32) a5_11->w0044, bLoc1B, 0x15), SEQ((word16) (word32) a5_11->w0042, (word16) (word32) a5_11->w004C), dwLoc10, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArgA4, dwArgC0, dwArgC4, dwArgCC, dwArgE8, out s0_37, out s1_38, out a4_87, out s2_49, out s3_39, out s4_88, out s5_41, out s6_89, out s7_90, out mstatus_91);
	s0Out = s0_37;
	s1Out = s1_38;
	s2Out = s2_49;
	s3Out = s3_39;
	s5Out = s5_41;
	return ra_36;
}

// 2303733A: void llcp_length_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_171617) a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack word32 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108)
void llcp_length_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, struct Eq_171617 * a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, word32 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108)
{
	*((word32) s0 + 83) = (byte) ((word32) *((word32) s0 + 83) | 1);
	if (((word32) *((word32) s0 + 0x00A5) & 0x08) != 0x00)
	{
		word32 s4_466;
		word32 s5_467;
		word32 mstatus_468;
		word32 s1_462;
		word32 a4_463;
		word32 s2_464;
		word32 s3_465;
		llc_util_dicon_procedure(ra, s0, a0, 61, s5, s6, dwArgD8, out s1_462, out a4_463, out s2_464, out s3_465, out s4_466, out s5_467, out mstatus_468);
	}
	else
	{
		uint32 a4_31 = (word32) a3->w0006;
		uint32 a5_32 = (word32) *((word32) s0 + 0x0044);
		if (a4_31 < a5_32)
			a5_32 = a4_31;
		uint32 s4_36 = a5_32 << 0x10;
		uint32 s3_39 = (word32) *((word32) s0 + 76);
		uint32 a5_41 = (word32) a3->w0008;
		if (a5_41 < s3_39)
			s3_39 = a5_41;
		uint32 a5_46 = (word32) a3->w0002;
		uint32 s2_48 = (word32) *((word32) s0 + 66);
		uint32 s3_50 = s3_39 << 16;
		if (a5_46 < s2_48)
			s2_48 = a5_46;
		uint32 a5_55 = (word32) a3->w0004;
		uint32 s1_57 = (word32) *((word32) s0 + 74);
		uint32 s2_59 = s2_48 << 16;
		if (a5_55 < s1_57)
			s1_57 = a5_55;
		uint32 s1_63 = s1_57 << 16;
		Eq_2 s0_101 = *((word32) a0 + 16);
		lld_util_compute_ce_max(a0, s1_63 >> 16);
		if ((word32) *((word32) s0_101 + 72) != s4_36 >> 0x10 || ((word32) (*((word32) s0_101 + 80)) != s3_50 >> 0x10 || ((word32) (*((word32) s0_101 + 70)) != s2_59 >> 0x10 || (word32) (*((word32) s0_101 + 78)) != s1_63 >> 16)))
		{
			__csrrs(mstatus, 0x00);
			__csrrc(mstatus, 0x08);
			s0_101 = *((word32) a0 + 16);
			*((word32) s0_101 + 72) = (word16) (s4_36 >> 0x10);
			*((word32) s0_101 + 80) = (word16) (s3_50 >> 0x10);
			*((word32) s0_101 + 70) = (word16) (s2_59 >> 0x10);
			*((word32) s0_101 + 78) = (word16) (s1_63 >> 16);
			lld_util_eff_tx_time_set(a0, s1_63 >> 16, s2_59 >> 0x10);
			__csrrw(mstatus, 0x00);
			*((word32) s0_101 + 83) = (byte) ((word32) *((word32) s0_101 + 83) & ~0x02);
		}
		Eq_2 s0_147;
		Eq_2 s1_148;
		Eq_2 s2_151;
		Eq_2 s3_152;
		Eq_2 s5_154;
		Eq_2 ra_146 = llc_llcp_length_rsp_pdu_send(ra, s0_101, s1_63 >> 16, a0, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_147, out s1_148, out s2_151, out s3_152, out s5_154);
		*((word32) s0_147 + 83) = (byte) ((word32) *((word32) s0_147 + 83) & ~0x01);
		if (llm_util_check_evt_mask(0x06) != 0x00 && ((word32) (*((word32) s0_147 + 83)) & 0x02) == 0x00)
		{
			Eq_2 a0_178;
			Eq_2 s0_188;
			Eq_2 s2_190;
			Eq_2 s3_191;
			Eq_2 s4_192;
			word32 a4_473;
			word32 a6_474;
			word32 s8_476;
			word32 mstatus_477;
			word32 a7_475;
			word32 s1_469;
			word32 a1_470;
			word32 a2_471;
			word32 a3_472;
			Eq_2 ra_187 = ble_ke_msg_alloc(ra_146, s0_147, s1_148, 0x00FFF804, s5_154, 62, 0x0C, s2_151, s3_152, dwArg0108, out s0_188, out s1_469, out a0_178, out a1_470, out a2_471, out a3_472, out a4_473, out a6_474, out a7_475, out s2_190, out s3_191, out s4_192, out s8_476, out mstatus_477);
			*a0_178 = 0x07;
			*((word32) a0_178 + 2) = (word16) s5_154;
			*((word32) a0_178 + 8) = (word16) (word32) *((word32) s0_188 + 72);
			*((word32) a0_178 + 0x0A) = (word16) (word32) *((word32) s0_188 + 80);
			*((word32) a0_178 + 4) = (word16) (word32) *((word32) s0_188 + 70);
			*((word32) a0_178 + 6) = (word16) (word32) *((word32) s0_188 + 78);
			struct Eq_171921 * s0_218;
			word32 mstatus_492;
			word32 s4_486;
			word32 s6_488;
			word32 s7_489;
			word32 s9_490;
			word32 s10_491;
			word32 s5_487;
			word32 a0_480;
			word32 a3_482;
			word32 a4_483;
			word32 s2_484;
			word32 s3_485;
			word32 a2_481;
			word32 tp_478;
			word32 s1_479;
			hci_send_2_host(ra_187, s0_188, a0_178, s2_190, s3_191, s4_192, s5_154, dwLoc10, dwLoc0C, dwArg18, out tp_478, out s0_218, out s1_479, out a0_480, out a2_481, out a3_482, out a4_483, out s2_484, out s3_485, out s4_486, out s5_487, out s6_488, out s7_489, out s9_490, out s10_491, out mstatus_492);
			s0_218->b0053 = (byte) ((word32) s0_218->b0053 | 2);
		}
	}
	0x00 = dwArgA8;
}

// 230374A8: Register Eq_2 llc_llcp_recv_handler(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 byte) a1, Register Eq_2 a2, Register word32 a3, Stack word32 dwArg00, Stack Eq_150833 dwArg04, Stack word32 dwArg28, Stack word32 dwArg44, Register out (ptr32 byte) s0Out, Register out Eq_150837 s1Out, Register out Eq_2 s2Out, Register out Eq_150833 s4Out)
// Called from:
//      lld_pdu_rx_handler
//      llc_llcp_recv_ind_handler
Eq_2 llc_llcp_recv_handler(Eq_2 ra, Eq_2 a0, byte * a1, Eq_2 a2, word32 a3, word32 dwArg00, Eq_150833 dwArg04, word32 dwArg28, word32 dwArg44, byte & s0Out, union Eq_150837 & s1Out, union Eq_2 & s2Out, union Eq_150833 & s4Out)
{
	ui32 s1_11 = (word32) (a3 != 0x00);
	ui32 a0_21;
	word32 a1_22;
	word32 a4_174;
	word32 s8_175;
	byte * s0_157;
	Eq_2 ra_25 = ble_ke_state_get(ra, a2, a0, out s0_157, out a0_21, out a1_22, out a4_174, out s8_175);
	if ((a0_21 & 0x007F) != 0x007F)
	{
		s0_157 = a1;
		if (((a0_21 & 0x0F) != 0x0F || ((word32) (*a1) & 0x00FB) == 0x02) && ((word32) (*((char *) (*((char *) (&g_t42026428) + (a0 >> 0x08) * 0x04)) + 92)) & 0x08) == 0x00)
		{
			if (a1_22 == 0x00)
			{
				ui32 a4_65 = (word32) *a1;
				if (dwArg44 == 0x00 || (word32) g_a230B6060[a4_65] != 0x00)
				{
					<anonymous> ** a5_83 = (a4_65 << 3) + 0x230B605C;
					byte * s0_102;
					Eq_150837 s1_103;
					Eq_2 s2_104;
					Eq_2 ra_106;
					Eq_150833 s4_114;
					word32 t1_115;
					(*a5_83)();
					s0Out = s0_102;
					s1Out = s1_103;
					s2Out = s2_104;
					s4Out = s4_114;
					return ra_106;
				}
			}
			else if (a1_22 == 0x19 && dwArg44 == 0x00)
			{
				llc_llcp_unknown_ind_handler.isra.1(a0 >> 0x08);
				s0Out = a1;
				s1Out = s1_11 << 1;
				s2Out = a0;
				s4Out = dwArg04;
				return ra_25;
			}
		}
	}
	s0Out = s0_157;
	s1Out = s1_11 << 1;
	s2Out = a0;
	s4Out = dwArg04;
	return ra_25;
}

