pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23037560: Register uint32 llc_llcp_get_autorize(Register uint32 a0)
// Called from:
//      lld_pdu_tx_prog
uint32 llc_llcp_get_autorize(uint32 a0)
{
	if (a0 > 0x15)
		return 0x00;
	return (word32) g_a230B6061[a0];
}

// 2303757E: void llc_dft_handler()
void llc_dft_handler()
{
}

// 23037582: void llm_enc_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2)
void llm_enc_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2)
{
	struct Eq_172066 * sp_152 = fp + ~0x1F;
	Eq_2 s2_143 = a1;
	Eq_2 s1_133 = a2;
	ui32 a0_21;
	word32 s0_290;
	word32 a1_291;
	word32 s8_293;
	word32 a4_292;
	Eq_2 ra_144 = ble_ke_state_get(ra, s0, a2, out s0_290, out a0_21, out a1_291, out a4_292, out s8_293);
	if ((a0_21 & 0x0F) == 0x0F)
		return;
	Eq_2 s3_149 = *((char *) &g_t42026428 + (a2 >> 0x08) * 0x04);
	Eq_2 s0_141 = a2 >> 0x08;
	if (((word32) *((word32) s3_149 + 0x00A3) != 0x13 || lld_get_mode(a2 >> 0x08) != 0x03) && ((word32) (*((word32) s3_149 + 0x00A4)) != 0x0E || lld_get_mode(a2 >> 0x08) != 0x04))
	{
		if ((lld_get_mode(a2 >> 0x08) != 0x04 || ((a0_21 & 2) == 0x00 || (word32) (*((word32) s3_149 + 0x00A4)) != 0x0A)) && (lld_get_mode(a2 >> 0x08) != 0x03 || ((a0_21 & 1) == 0x00 || ((word32) (*((word32) s3_149 + 0x00A3)) + ~0x0D & 0x00FF) > 0x01)))
			return;
		word16 * a0_117 = (a2 >> 0x08) + 0x28008110;
		ui32 a5_118 = 0x0F;
		do
		{
			struct Eq_172154 * a3_121 = (word32) a1 + a5_118;
			*a0_117 = (word16) ((word32) a3_121->b0000 << 8 | (word32) a3_121->b0001);
			ui32 a5_125 = a5_118 + ~0x01;
			a5_118 = a5_125 & 0x00FF;
			++a0_117;
		} while ((a5_125 & 0x00FF) != 0x00FF);
	}
	else
	{
		<anonymous> * a5_55 = g_ptr4200F3D0;
		word32 a3_83;
		word32 a7_197;
		word32 mstatus_198;
		word32 tp_200;
		word32 t1_199;
		a5_55();
	}
	word32 a3_298;
	word32 s3_303;
	word32 s4_304;
	word32 mstatus_305;
	word32 a4_299;
	word32 a7_301;
	word32 s2_302;
	word32 a6_300;
	word32 s0_295;
	word32 s1_296;
	word32 a0_297;
	word32 t1_294;
	ble_ke_msg_send_basic(ra_144, s0_141, s1_133, 262, s1_133, s1_133, s2_143, s3_149, sp_152->t0010, sp_152->t0038, sp_152->t0118, out t1_294, out s0_295, out s1_296, out a0_297, out a3_298, out a4_299, out a6_300, out a7_301, out s2_302, out s3_303, out s4_304, out mstatus_305);
}

// 23037696: void llc_llcp_recv_ind_handler(Register Eq_2 ra, Register (ptr32 byte) a1, Register Eq_2 a2, Stack word32 dwArg00, Stack Eq_150833 dwArg04, Stack word32 dwArg28, Stack word32 dwArg44)
void llc_llcp_recv_ind_handler(Eq_2 ra, byte * a1, Eq_2 a2, word32 dwArg00, Eq_150833 dwArg04, word32 dwArg28, word32 dwArg44)
{
	byte * a1_8 = (word32) *a1;
	word32 s0_30;
	word32 s1_31;
	word32 s2_32;
	word32 s4_33;
	llc_llcp_recv_handler(ra, a2, a1_8, a1 + 2, 0x00, dwArg00, dwArg04, dwArg28, dwArg44, out s0_30, out s1_31, out s2_32, out s4_33);
}

// 230376A6: void llc_chmap_update_req_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2)
void llc_chmap_update_req_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a2)
{
	ui32 a0_17;
	word32 a4_212;
	word32 s8_213;
	word32 s0_210;
	word32 a1_211;
	Eq_2 ra_21 = ble_ke_state_get(ra, s0, a2, out s0_210, out a0_17, out a1_211, out a4_212, out s8_213);
	if ((a0_17 & 0x0F) == 0x0F || (a0_17 & 4) != 0x00)
		return;
	if ((a0_17 & 1) != 0x00)
		return;
	int32 s3_37 = *((char *) &g_t42026428 + (a2 >> 0x08) * 0x04);
	llc_ch_assess_get_current_ch_map();
	<anonymous> * a5_41 = g_ptr4200F3CC;
	struct Eq_172297 * sp_44;
	word32 a0_46;
	Eq_2 s2_47;
	Eq_2 ra_48;
	Eq_2 s0_49;
	Eq_2 s1_50;
	word32 a3_126;
	word32 mstatus_127;
	word32 t1_128;
	word32 tp_129;
	word32 a7_130;
	word32 s10_131;
	word32 s11_132;
	word32 s5_133;
	word32 s6_134;
	word32 s7_135;
	word32 s9_136;
	word32 t0_137;
	word32 t4_138;
	a5_41();
	if (a0_46 != 0x00)
	{
		Eq_2 s1_71;
		struct Eq_172319 * s3_73;
		word32 a5_218;
		word32 s2_219;
		word32 a2_216;
		word32 a4_217;
		word32 s0_214;
		word32 a0_215;
		word32 s4_220;
		word32 mstatus_221;
		Eq_2 ra_70 = ble_ke_state_set(ra_48, s0_49, s1_50, s2_47, (s0_49 | 1) & 0x00FF, sp_44->t0108, out s0_214, out s1_71, out a0_215, out a2_216, out a4_217, out a5_218, out s2_219, out s3_73, out s4_220, out mstatus_221);
		s3_73->b00A3 = 0x06;
		llc_llcp_ch_map_update_pdu_send(ra_70, s1_71, s1_71, sp_44->t0008, sp_44->t0028, sp_44->t0038, sp_44->t0058, sp_44->t0078, sp_44->t007C, sp_44->t0088, sp_44->t00A4, sp_44->t00C0, sp_44->t00C4, sp_44->t00CC, sp_44->t00E8);
	}
}

// 2303772E: void llc_auth_payl_real_to_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void llc_auth_payl_real_to_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg98, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	ui32 a0_15;
	word32 s0_195;
	word32 a1_196;
	word32 a4_197;
	word32 s8_198;
	Eq_2 ra_19 = ble_ke_state_get(ra, s0, a2, out s0_195, out a0_15, out a1_196, out a4_197, out s8_198);
	if ((a0_15 & 0x0F) != 0x0F)
	{
		struct Eq_172423 * a5_27 = a2 >> 0x08 << 0x02;
		struct Eq_172428 * a5_44;
		Eq_2 s1_50;
		Eq_2 s2_51;
		Eq_2 s3_52;
		Eq_2 s4_53;
		Eq_2 s5_54;
		Eq_2 s6_55;
		Eq_2 s0_74;
		Eq_2 s1_75;
		Eq_2 s2_76;
		Eq_2 s3_77;
		Eq_2 s5_79;
		Eq_2 a0_90;
		Eq_2 s0_100;
		Eq_2 s2_102;
		Eq_2 s3_103;
		Eq_2 s4_104;
		word32 s0_199;
		word32 mstatus_200;
		word32 a5_201;
		word32 s4_202;
		word32 s6_203;
		word32 mstatus_204;
		word32 s1_205;
		word32 a1_206;
		word32 a2_207;
		word32 a3_208;
		word32 a4_209;
		word32 a6_210;
		word32 a7_211;
		word32 s8_212;
		word32 mstatus_213;
		Eq_2 ra_99 = ble_ke_msg_alloc(ble_ke_timer_set(ble_ke_timer_set(ra_19, a5_27->t0000, a2, 259, a2, (uint16) (a5_27->w0058 - a5_27->w005A), a2 >> 0x08, s3, s4, s5, s6, dwArg00, dwArg98, dwArgF8, out s0_199, out s1_50, out a5_44, out s2_51, out s3_52, out s4_53, out s5_54, out s6_55, out mstatus_200), a5_44->t0000, s1_50, 260, s1_50, (word32) a5_44->w0058, s2_51, s3_52, s4_53, s5_54, s6_55, dwArg00, dwArg98, dwArgF8, out s0_74, out s1_75, out a5_201, out s2_76, out s3_77, out s4_202, out s5_79, out s6_203, out mstatus_204), s0_74, s1_75, 0x00FFF803, s2_76, 87, 0x02, s2_76, s3_77, dwArg0118, out s0_100, out s1_205, out a0_90, out a1_206, out a2_207, out a3_208, out a4_209, out a6_210, out a7_211, out s2_102, out s3_103, out s4_104, out s8_212, out mstatus_213);
		*a0_90 = (word16) s2_102;
		word32 tp_214;
		word32 s0_215;
		word32 s1_216;
		word32 a0_217;
		word32 a2_218;
		word32 a3_219;
		word32 a4_220;
		word32 s2_221;
		word32 s3_222;
		word32 s4_223;
		word32 s5_224;
		word32 s6_225;
		word32 s7_226;
		word32 s9_227;
		word32 s10_228;
		word32 mstatus_229;
		hci_send_2_host(ra_99, s0_100, a0_90, s2_102, s3_103, s4_104, s5_79, dwArg00, dwArg04, dwArg28, out tp_214, out s0_215, out s1_216, out a0_217, out a2_218, out a3_219, out a4_220, out s2_221, out s3_222, out s4_223, out s5_224, out s6_225, out s7_226, out s9_227, out s10_228, out mstatus_229);
	}
	0x00 = dwArg38;
}

// 230377A8: void llc_con_upd_req_ind_handler(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Stack word32 dwArg38, Stack word32 dwArg78, Stack word32 dwArg98, Stack word32 dwArgE4, Stack word32 dwArg0100, Stack word32 dwArg0104, Stack word32 dwArg0128)
void llc_con_upd_req_ind_handler(Eq_2 ra, Eq_2 a1, Eq_2 a2, word32 dwArg38, word32 dwArg78, word32 dwArg98, word32 dwArgE4, word32 dwArg0100, word32 dwArg0104, word32 dwArg0128)
{
	ui32 a0_25;
	word32 a1_26;
	byte * s0_30;
	word32 s8_192;
	word32 a4_191;
	Eq_2 ra_29 = ble_ke_state_get(ra, a1, a2, out s0_30, out a0_25, out a1_26, out a4_191, out s8_192);
	if ((a0_25 & 0x0F) != 0x0F && ((a0_25 & 1) == 0x00 || *(*((char *) (&g_t42026428) + (a2 >> 0x08) * 0x04)) != 0x00) && (((a0_25 & 2) == 0x00 || (word32) (*((char *) (*((char *) (&g_t42026428) + (a2 >> 0x08) * 0x04)) + 0x00A4)) != 0x04) && (a0_25 & 4) == 0x00))
	{
		struct Eq_172623 * s6_63 = a2 >> 0x08 << 0x02;
		int32 s4_66 = s6_63->dw42026428;
		uint32 a5_69 = (word32) *s0_30;
		if (a5_69 <= 0x04)
		{
			<anonymous> * a5_77 = *((char *) g_a230B610C + a5_69 * 0x04);
			a5_77();
			return;
		}
	}
	0x00 = dwArg0128;
}

