pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230379C0: void llc_length_req_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8)
void llc_length_req_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8)
{
	Eq_2 a0_17;
	struct Eq_172684 ** s0_22;
	word32 s8_279;
	word32 a4_278;
	word32 a1_277;
	Eq_2 ra_21 = ble_ke_state_get(ra, s0, a2, out s0_22, out a0_17, out a1_277, out a4_278, out s8_279);
	if ((a0_17 & 0x0F) == 0x0F)
		return;
	if ((a0_17 & 5) != 0x00)
		return;
	struct Eq_172684 * a5_34 = *s0_22;
	Eq_2 s0_35 = a5_34->t000C;
	if (a5_34 != null)
	{
		*((word32) s0_35 + 66) = (word16) (word32) a5_34->w0002;
		*((word32) s0_35 + 74) = (word16) (word32) a5_34->w0004;
	}
	Eq_2 s0_60;
	Eq_2 s1_61;
	Eq_2 s2_62;
	word32 s5_282;
	word32 s4_281;
	word32 s3_280;
	Eq_2 ra_59 = llc_util_clear_operation_ptr(ra_21, s0_35, a0_17, a2 >> 0x08, a2, a2 >> 0x08, s4, s5, out s0_60, out s1_61, out s2_62, out s3_280, out s4_281, out s5_282);
	if (((word32) *((word32) s0_60 + 83) & 0x01) == 0x00)
	{
		Eq_2 s1_85;
		ui32 s3_87;
		Eq_2 s0_93;
		word32 a2_284;
		word32 a4_285;
		word32 a0_283;
		word32 a5_286;
		word32 s2_287;
		word32 s4_288;
		word32 mstatus_289;
		Eq_2 ra_84 = ble_ke_state_set(ra_59, s0_60, s1_61, s2_62, (s1_61 | 1) & 0x00FF, dwArgE8, out s0_93, out s1_85, out a0_283, out a2_284, out a4_285, out a5_286, out s2_287, out s3_87, out s4_288, out mstatus_289);
		*((word32) s0_93 + 0x00A3) = 0x04;
		Eq_2 s0_107;
		Eq_2 s1_108;
		Eq_2 s2_111;
		Eq_2 s3_112;
		Eq_2 s4_113;
		Eq_2 s5_114;
		Eq_2 s6_115;
		word32 s0_290;
		word32 s1_291;
		word32 a5_292;
		word32 s2_293;
		word32 s3_294;
		word32 s4_295;
		word32 s5_296;
		word32 s6_297;
		word32 mstatus_298;
		ble_ke_timer_set(llc_llcp_length_req_pdu_send(ra_84, s0_93, s1_85, s3_87, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_107, out s1_108, out s2_111, out s3_112, out s4_113, out s5_114, out s6_115), s0_107, s1_108, 258, s2_111, 0x00FFFFA0, s2_111, s3_112, s4_113, s5_114, s6_115, dwLoc10, dwArg88, dwArgE8, out s0_290, out s1_291, out a5_292, out s2_293, out s3_294, out s4_295, out s5_296, out s6_297, out mstatus_298);
	}
}

// 23037A5C: Register word32 llc_task_random_gen_request(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Register out Eq_2 s3Out)
// Called from:
//      llc_enc_mgt_ind_handler
word32 llc_task_random_gen_request(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 dwArgF8, word32 dwArg0128, union Eq_2 & s3Out)
{
	struct Eq_172817 * sp_104 = fp + -48;
	word32 a4_167;
	word32 a3_166;
	word32 a1_165;
	word32 s1_164;
	word32 s0_163;
	word32 a6_168;
	word32 a7_169;
	word32 s2_170;
	word32 s3_171;
	word32 s4_172;
	word32 s8_173;
	word32 mstatus_174;
	struct Eq_64398 * a2_106;
	Eq_2 a0_105;
	Eq_2 ra_113 = ble_ke_msg_alloc(ra, s0, s1, 0x04, 0x00, a0, 32, s2, s3, dwArgF8, out s0_163, out s1_164, out a0_105, out a1_165, out a2_106, out a3_166, out a4_167, out a6_168, out a7_169, out s2_170, out s3_171, out s4_172, out s8_173, out mstatus_174);
	Eq_2 s0_109 = a0_105;
	Eq_2 s3_112 = (word32) a0_105 + 16;
	struct Eq_172859 * s2_111 = &g_t4200F000;
	do
	{
		word32 a0_45;
		word32 a1_175;
		word32 a2_176;
		word32 a3_177;
		word32 a4_178;
		word32 a5_179;
		word32 s4_180;
		word32 s8_181;
		Eq_2 s1_50 = bl_rand(a0_105, a2_106, out a0_45, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179, out s4_180, out s8_181);
		<anonymous> * a5_58 = s2_111->ptr03D0;
		sp_104->dw0084 = a0_45;
		struct Eq_172887 * sp_67;
		Eq_2 a0_68;
		struct Eq_64398 * a2_69;
		word32 s0_72;
		struct Eq_172891 * s2_74;
		word32 s3_75;
		word32 ra_76;
		a5_58();
		word32 a0_87;
		word32 a1_182;
		word32 a2_183;
		word32 a3_184;
		word32 a4_185;
		word32 a5_186;
		word32 s4_187;
		word32 s8_188;
		Eq_2 s1_92 = bl_rand(a0_68, a2_69, out a0_87, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186, out s4_187, out s8_188);
		<anonymous> * a5_98 = s2_74->ptr03D0;
		sp_67->dw0084 = a0_87;
		Eq_2 s1_110;
		a5_98();
		sp_104 = fp - 48;
	} while (s0_109 != s3_112);
	word32 a5_130;
	word32 tp_189;
	word32 t1_190;
	word32 s0_191;
	word32 s1_192;
	word32 a0_193;
	word32 a2_194;
	word32 a3_195;
	word32 a4_196;
	word32 mstatus_197;
	ble_ke_msg_send(ra_113, s0_109, s1_110, s1_110, s2, out tp_189, out t1_190, out s0_191, out s1_192, out a0_193, out a2_194, out a3_195, out a4_196, out a5_130, out mstatus_197);
	0x00 = dwArg0128;
	s3Out = s3_112;
	return a5_130;
}

// 23037AC4: void llc_enc_mgt_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0108, Stack word32 dwArg0178)
void llc_enc_mgt_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0108, word32 dwArg0178)
{
	Eq_2 a0_21;
	struct Eq_167302 * a1_22;
	word32 s0_1283;
	word32 a4_1284;
	word32 s8_1285;
	Eq_2 ra_25 = ble_ke_state_get(ra, s0, a2, out s0_1283, out a0_21, out a1_22, out a4_1284, out s8_1285);
	if ((a0_21 & 0x0F) == 0x0F)
		return;
	Eq_2 s4_230;
	Eq_2 s3_229;
	Eq_2 s1_225;
	Eq_2 ra_223;
	Eq_2 s6_232;
	Eq_2 s5_231;
	Eq_2 s0_224;
	Eq_2 s2_228;
	Eq_2 s5_106;
	Eq_2 s4_151;
	Eq_2 s3_150;
	Eq_2 s2_149;
	Eq_2 s1_148;
	Eq_2 ra_147;
	Eq_2 s0_156;
	Eq_2 s0_31 = a2 >> 0x08;
	Eq_2 s1_32 = a0_21;
	if (lld_get_mode(a2 >> 0x08) != 0x03)
	{
		if ((a0_21 & 2) == 0x00)
			return;
		Eq_2 s4_40 = a2 >> 0x08 << 0x02;
		Eq_2 a0_42 = *((word32) s4_40 + 0x42026428);
		up32 a5_45 = (word32) *((word32) a0_42 + 0x00A4);
		if (a5_45 != 0x08)
		{
			if (a5_45 <= 0x08)
			{
				if (a5_45 != 0x05)
					return;
				*((word32) a0_42 + 0x00A5) = (byte) ((word32) *((word32) a0_42 + 0x00A5) | 48);
				((word32) a0_42 + 0x00A4)->u0 = 0x06;
				word32 mstatus_1289;
				ra_223 = llc_llcp_pause_enc_rsp_pdu_send(ra_25, a2 >> 0x08, a0_21, a2 >> 0x08, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_224, out s1_225, out s2_228, out s3_229, out s4_230, out s5_231, out s6_232, out mstatus_1289);
				goto l23037C02;
			}
			if (a5_45 == 0x0A)
			{
				ra_223 = llc_llcp_start_enc_req_pdu_send(ra_25, a2 >> 0x08, a0_21, a2 >> 0x08, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_224, out s1_225, out s2_228, out s3_229, out s4_230, out s5_231, out s6_232);
				*((word32) *s3_229 + 0x00A4) = 11;
				goto l23037C02;
			}
			if (a5_45 != 0x0E)
				return;
			struct Eq_173414 * a0_246 = *((word32) a0_21 + 8);
			a0_246->b00A4 = 0x09;
			<anonymous> * a5_249 = g_ptr4200F3D0;
			struct Eq_173425 * sp_253;
			Eq_2 ra_257;
			struct Eq_167528 * s0_258;
			Eq_2 s1_259;
			a5_249();
			s0_258->w28008120 = (word16) ((word32) *((word32) s1_259 + 22) << 8 | (word32) (*((word32) s1_259 + 21)));
			s0_258->w28008122 = (word16) ((word32) *((word32) s1_259 + 24) << 8 | (word32) (*((word32) s1_259 + 23)));
			Eq_2 s0_311;
			Eq_2 s2_315;
			Eq_2 s3_316;
			Eq_2 s5_318;
			word32 a3_333;
			word32 mstatus_338;
			ra_147 = llc_ltk_req_send(llc_llcp_enc_rsp_pdu_send(ra_257, s0_258, s1_259, s0_258, (word32) s1_259 + 2, sp_253->t0008, sp_253->t0028, sp_253->t0038, sp_253->t0058, sp_253->t0078, sp_253->t007C, sp_253->t0088, sp_253->t00A4, sp_253->t00C0, sp_253->t00C4, sp_253->t00CC, sp_253->t00E8, out s0_311, out s2_315, out s3_316, out s5_318), s0_311, s0_311, s2_315, s3_316, s5_318, sp_253->t0010, sp_253->t0014, sp_253->t0038, sp_253->t0118, out s0_156, out s1_148, out a3_333, out s2_149, out s3_150, out s4_151, out s5_106, out mstatus_338);
		}
		else
		{
			if (llm_util_check_evt_mask(0x04) != 0x00)
			{
				struct Eq_173389 ** s3_203;
				llc_task_random_gen_request(ra_25, a2 >> 0x08, a0_21, a2, a2, (word32) s4_40 + 0x42026428, dwArgD8, dwArg0108, out s3_203);
				*((char *) *s3_203 + 0x00A4) = (struct Eq_173389 **) 0x0E;
				return;
			}
			if (((word32) *((word32) *((word32) s4_40 + 0x42026428) + 0x00A5) & 0x10) != 0x00)
				ra_147 = llc_llcp_terminate_ind_pdu_send(ra_25, a2 >> 0x08, a2, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg74, dwArg90, dwArg94, dwArg9C, dwArgB8, dwArg0108, out s0_156, out s1_148, out s2_149, out s3_150, out s4_151, out s5_106);
			else
			{
				if ((a0_21 & 1) != 0x00)
				{
					word32 a5_1319;
					word32 s2_1320;
					word32 s3_1321;
					word32 s4_1322;
					word32 s5_1323;
					word32 s6_1324;
					word32 mstatus_1325;
					ra_25 = ble_ke_timer_set(ra_25, a2 >> 0x08, a0_21, 258, a2, 0x00FFFFA0, a2, (word32) s4_40 + 0x42026428, s4_40, 0x42026428, s6, dwLoc10, dwArg88, dwArgE8, out s0_31, out s1_32, out a5_1319, out s2_1320, out s3_1321, out s4_1322, out s5_1323, out s6_1324, out mstatus_1325);
				}
				word32 a2_1315;
				Eq_2 s0_99;
				int32 s1_100;
				Eq_2 s2_103;
				Eq_2 s1_128;
				Eq_2 s2_129;
				Eq_2 s0_136;
				word32 a0_1307;
				word32 a0_1314;
				word32 a5_1317;
				word32 a4_1316;
				word32 mstatus_1318;
				word32 mstatus_1313;
				word32 s4_1312;
				word32 a5_1310;
				word32 s3_1311;
				word32 a2_1308;
				word32 a4_1309;
				word32 s4_1306;
				word32 s3_1305;
				ra_147 = ble_ke_state_set(ble_ke_state_set(llc_llcp_reject_ind_pdu_send(ra_25, s0_31, s1_32 << 24, s0_31, 0x03, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_99, out s1_100, out s2_103, out s3_1305, out s4_1306, out s5_106), s0_99, s1_100 >> 24, s2_103, s1_100 >> 24 & 0x00FD, dwArgE8, out s0_136, out s1_128, out a0_1307, out a2_1308, out a4_1309, out a5_1310, out s2_129, out s3_1311, out s4_1312, out mstatus_1313), s0_136, s1_128, s2_129, s1_128 & 0x00F9, dwArgE8, out s0_156, out s1_148, out a0_1314, out a2_1315, out a4_1316, out a5_1317, out s2_149, out s3_150, out s4_151, out mstatus_1318);
				Mem159[Mem19[s5_106 + s4_151:word32] + 0x00A4:byte] = 0x00;
			}
		}
l23037B9A:
		word32 s2_1301;
		word32 s5_1304;
		word32 s3_1302;
		word32 s4_1303;
		word32 s1_1300;
		word32 s0_1299;
		llc_util_clear_operation_ptr(ra_147, s0_156, s1_148, s0_156, s2_149, s3_150, s4_151, s5_106, out s0_1299, out s1_1300, out s2_1301, out s3_1302, out s4_1303, out s5_1304);
	}
	else
	{
		if ((a0_21 & 0x01) == 0x00)
			return;
		Eq_2 s3_394 = a2 >> 0x08 << 0x02;
		uint32 a5_400 = (word32) (a0_21 & 0x0F)->b00A3 + ~0x09 & 0x00FF;
		if (a5_400 > 0x09)
			return;
		switch (g_a230B6120[a5_400 * 0x04])
		{
		case 0x00:
			ui32 a5_1013 = (word32) (a0_21 & 0x0F)->b00A5;
			if ((a5_1013 & 3) != 0x03)
				goto l23037B6A;
			(a0_21 & 0x0F)->b00A5 = (byte) (a5_1013 | 48);
			Eq_2 s1_1048 = *(a5_1013 | 48);
			(a5_1013 | 48)->b00A3 = 11;
			llc_llcp_pause_enc_req_pdu_send(ra_25, s1_1048, a2 >> 0x08, a2, s3_394, s4, s5, s6, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8);
			return;
		case 0x01:
		case 0x03:
		case 0x06:
		case 0x08:
			return;
		case 0x02:
l23037B6A:
			word32 s3_1286;
			llc_task_random_gen_request(ra_25, a2 >> 0x08, 0x42026428, a2, a2, s3_394, dwArgD8, dwArg0108, out s3_1286)->b00A3 = 0x13;
			return;
		case 0x04:
			(a0_21 & 0x0F)->b00A3 = 0x10;
			return;
		case 0x05:
		case 0x07:
			struct Eq_173078 * a5_923 = (a2 >> 0x08) + 92;
			a5_923->w280080CC = 0x00;
			a5_923->w280080CE = 0x00;
			a5_923->w280080D0 = 0x00;
			a5_923->w280080D2 = 0x00;
			a5_923->w280080D4 = 0x00;
			a5_923->t280080D6.u0 = 0x00;
			Eq_2 s1_944 = a5_923->t280080D6;
			a5_923->b28008179 = 0x12;
			word32 a4_1287;
			word32 mstatus_1288;
			ra_223 = llc_llcp_start_enc_rsp_pdu_send(ra_25, a2 >> 0x08, s1_944, a2 >> 0x08, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_224, out s1_225, out a4_1287, out s2_228, out s3_229, out s4_230, out s5_231, out s6_232, out mstatus_1288);
			break;
		case 0x09:
			(a0_21 & 0x0F)->b00A3 = 0x0D;
			struct Eq_173133 * a4_861 = a1_22->ptr0008;
			Eq_2 s1_862 = a4_861->t0000;
			a4_861->b00A5 = (byte) ((word32) a4_861->b00A5 & -33);
			ra_147 = llc_llcp_enc_req_pdu_send(ra_25, a2 >> 0x08, s1_862, a2 >> 0x08, a1_22, a2, s3_394, s4, s5, s6, s2, dwLoc08, dwArg18, dwArg28, dwArg48, s3, dwArg80, dwArg84, dwArg8C, dwArgA8, dwArg0178, out s0_156, out s1_148, out s2_149, out s3_150, out s4_151, out s5_106);
			goto l23037B9A;
		case 0x0A:
			fn2303803C(ra_25, a2 >> 0x08, a2, s4, s5, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8);
			return;
		case 11:
			fn23038098(ra_25, a2 >> 0x08, a2, s3_394, s5, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8, dwArgF8);
			return;
		case 0x0C:
			fn23038048();
			return;
		case 0x0D:
			fn23038048();
			return;
		case 0x0E:
			fn23038048();
			return;
		case 0x0F:
			fn23038048();
			return;
		case 0x10:
			fn230380C6(ra_25, a2 >> 0x08, a2, s3_394, s4, s5, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8, dwArgF8);
			return;
		case 0x11:
			fn230380C6(ra_25, a2 >> 0x08, a2, s3_394, s4, s5, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8, dwArgF8);
			return;
		case 0x12:
			fn230380C6(ra_25, a2 >> 0x08, a2, s3_394, s4, s5, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8, dwArgF8);
			return;
		case 0x13:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		case 0x14:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		case 0x15:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		case 22:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		case 0x17:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		case 0x18:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		case 0x19:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		case 0x1A:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		case 0x1B:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		case 0x1C:
			fn230380A2(ra_25, a2 >> 0x08, 0x42026428, a2, s3_394, s4, s5, s6, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
			return;
		}
l23037C02:
		word32 s4_1295;
		word32 mstatus_1298;
		word32 s5_1296;
		word32 s6_1297;
		word32 s1_1291;
		word32 s3_1294;
		word32 s2_1293;
		word32 a5_1292;
		word32 s0_1290;
		ble_ke_timer_set(ra_223, s0_224, s1_225, 258, s2_228, 0x00FFFFA0, s2_228, s3_229, s4_230, s5_231, s6_232, dwLoc10, dwArg88, dwArgE8, out s0_1290, out s1_1291, out a5_1292, out s2_1293, out s3_1294, out s4_1295, out s5_1296, out s6_1297, out mstatus_1298);
	}
}

