pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23037D5A: void llc_chnl_assess_timer_handler(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack word32 dwArg08, Stack word32 dwArg0128)
void llc_chnl_assess_timer_handler(Eq_2 ra, Eq_2 a2, Eq_2 s4, Eq_2 s5, Eq_2 s6, word32 dwArg08, word32 dwArg0128)
{
	Eq_2 s2_131 = *((char *) &g_t42026428 + (a2 >> 0x08) * 0x04);
	struct Eq_173687 * sp_158 = fp + -48;
	Eq_2 s3_132 = a2 >> 0x08;
	ui32 a0_23;
	word32 a1_252;
	word32 a4_253;
	word32 s8_254;
	Eq_2 s0_138;
	Eq_2 ra_129 = ble_ke_state_get(ra, a2, a2, out s0_138, out a0_23, out a1_252, out a4_253, out s8_254);
	if ((a0_23 & 0x0F) != 0x0F)
	{
		Eq_2 s1_130 = 0x42026460;
		if ((word32) *((word32) s2_131 + 0x00A3) != 0x06)
		{
			llm_util_get_channel_map();
			uint32 a0_45;
			word32 s1_54;
			struct Eq_173723 * s2_55;
			word32 ra_53 = llc_ch_assess_get_local_ch_map(ra_129, s0_138, 0x42026460, fp + -48, fp + -40, s2_131, dwArg08, out s1_54, out a0_45, out s2_55);
			ui32 a5_61 = (word32) s2_55->b003A + ~0x00 & 0x00FF;
			s2_55->b003A = (byte) a5_61;
			if (a5_61 == 0x00 || a0_45 <= 0x01)
				llc_ch_assess_reass_ch(a2 >> 0x08, fp + -48, fp + -40, a0_45);
			<anonymous> * a5_83 = g_ptr4200F3D0;
			word32 mstatus_196;
			Eq_2 s3_98;
			Eq_2 s0_102;
			Eq_2 ra_103;
			Eq_2 s1_104;
			Eq_2 s2_105;
			word32 t4_115;
			word32 t5_116;
			a5_83();
			word32 a3_123;
			word32 a6_126;
			word32 a7_127;
			word32 t1_135;
			word32 a0_264;
			word32 a4_265;
			word32 mstatus_266;
			ra_129 = ble_ke_msg_send_basic(ra_103, s0_102, s1_104, 264, s0_102, s0_102, s2_105, s3_98, sp_158->t0010, sp_158->t0038, sp_158->t0118, out t1_135, out s0_138, out s1_130, out a0_264, out a3_123, out a4_265, out a6_126, out a7_127, out s2_131, out s3_132, out s4, out mstatus_266);
		}
		word32 s4_260;
		word32 s5_261;
		word32 s6_262;
		word32 mstatus_263;
		word32 s1_256;
		word32 a5_257;
		word32 s2_258;
		word32 s3_259;
		word32 s0_255;
		ble_ke_timer_set(ra_129, s0_138, s1_130, 261, s0_138, (word32) *((word32) s1_130 + 44), s2_131, s3_132, s4, s5, s6, sp_158->t0010, sp_158->t00A8, sp_158->t0108, out s0_255, out s1_256, out a5_257, out s2_258, out s3_259, out s4_260, out s5_261, out s6_262, out mstatus_263);
	}
	0x00 = dwArg0128;
}

// 23037E0E: void llc_llcp_rsp_to_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register uint32 a2, Register Eq_2 s5, Stack Eq_2 dwArgE8)
void llc_llcp_rsp_to_ind_handler(Eq_2 ra, Eq_2 s0, uint32 a2, Eq_2 s5, Eq_2 dwArgE8)
{
	word32 s1_36;
	word32 a4_37;
	word32 s2_38;
	word32 s3_39;
	word32 s4_40;
	word32 s5_41;
	word32 mstatus_42;
	llc_util_dicon_procedure(ra, s0, a2 >> 0x08, 0x0022, s5, dwLoc10, dwArgE8, out s1_36, out a4_37, out s2_38, out s3_39, out s4_40, out s5_41, out mstatus_42);
}

// 23037E24: void llc_link_sup_to_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg88, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void llc_link_sup_to_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg88, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	ui32 a0_10;
	Eq_2 s0_15;
	word32 a1_118;
	word32 a4_119;
	word32 s8_120;
	Eq_2 ra_14 = ble_ke_state_get(ra, s0, a2, out s0_15, out a0_10, out a1_118, out a4_119, out s8_120);
	if ((a0_10 & 0x007F) != 0x007F)
	{
		struct Eq_173903 * a5_25 = null[a2 >> 0x08];
		struct Eq_173910 * a4_26 = a5_25->ptr0010;
		if (((word32) a5_25->b007E & 0x02) != 0x00)
		{
			word32 s0_128;
			word32 s1_129;
			word32 a5_130;
			word32 s2_131;
			word32 s3_132;
			word32 s4_133;
			word32 s5_134;
			word32 s6_135;
			word32 mstatus_136;
			ble_ke_timer_set(ra_14, s0_15, s1, 0x0101, a2 >> 0x08 << 0x08 | 1, (word32) a4_26->w0054, s2, s3, s4, s5, s6, dwLoc10, dwArg88, dwArgE8, out s0_128, out s1_129, out a5_130, out s2_131, out s3_132, out s4_133, out s5_134, out s6_135, out mstatus_136);
		}
		else
		{
			word32 s1_121;
			word32 a4_122;
			word32 s2_123;
			word32 s3_124;
			word32 s4_125;
			word32 s5_126;
			word32 mstatus_127;
			llc_util_dicon_procedure(ra_14, s0_15, a2 >> 0x08, 0x08, s5, dwLoc20, dwArgD8, out s1_121, out a4_122, out s2_123, out s3_124, out s4_125, out s5_126, out mstatus_127);
		}
	}
}

// 23037E7E: void llc_auth_payl_nearly_to_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8)
void llc_auth_payl_nearly_to_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a2, Eq_2 dwArg00, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8)
{
	ui32 a0_15;
	word32 s0_234;
	word32 a1_235;
	word32 a4_236;
	word32 s8_237;
	Eq_2 ra_19 = ble_ke_state_get(ra, s0, a2, out s0_234, out a0_15, out a1_235, out a4_236, out s8_237);
	if ((a0_15 & 0x0F) != 0x0F)
	{
		if ((a0_15 & 1) != 0x00)
		{
			if ((word32) *((char *) *((char *) &g_t42026428 + (a2 >> 0x08) * 0x04) + 0x00A3) == 0x05)
				goto l23037E9A;
		}
		else if ((a0_15 & 4) == 0x00)
		{
			word32 a0_32;
			Eq_2 s0_38;
			Eq_2 s1_39;
			Eq_2 ra_37 = ble_ke_timer_active(ra_19, a0_15, a2, 258, a2, out s0_38, out s1_39, out a0_32);
			if (a0_32 == 0x00)
			{
				Eq_2 s1_55;
				ui32 s2_56;
				Eq_2 s0_63;
				word32 a0_238;
				word32 a2_239;
				word32 a4_240;
				word32 a5_241;
				word32 s3_242;
				word32 s4_243;
				word32 mstatus_244;
				Eq_2 ra_54 = ble_ke_state_set(ra_37, s0_38, s1_39, s1_39, (s0_38 | 1) & 0x00FF, dwArgF8, out s0_63, out s1_55, out a0_238, out a2_239, out a4_240, out a5_241, out s2_56, out s3_242, out s4_243, out mstatus_244);
				*((char *) *((char *) &g_t42026428 + s2_56 * 0x04) + 0x00A3) = (union Eq_2 *) 0x05;
				Eq_2 s0_82;
				Eq_2 s1_83;
				Eq_2 s2_86;
				Eq_2 s3_87;
				Eq_2 s4_88;
				Eq_2 s5_89;
				Eq_2 s6_90;
				word32 s0_245;
				word32 s1_246;
				word32 a5_247;
				word32 s2_248;
				word32 s3_249;
				word32 s4_250;
				word32 s5_251;
				word32 s6_252;
				word32 mstatus_253;
				ble_ke_timer_set(llc_llcp_ping_req_pdu_send(ra_54, s0_63, s1_55, dwLoc08, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg94, dwArgB0, dwArgB4, dwArgBC, dwArgD8, out s0_82, out s1_83, out s2_86, out s3_87, out s4_88, out s5_89, out s6_90), s0_82, s1_83, 258, s1_83, 0x00FFFFA0, s2_86, s3_87, s4_88, s5_89, s6_90, dwArg00, dwArg98, dwArgF8, out s0_245, out s1_246, out a5_247, out s2_248, out s3_249, out s4_250, out s5_251, out s6_252, out mstatus_253);
			}
			goto l23037E9A;
		}
l23037EC6:
		0x00 = dwArg38;
	}
	else
	{
l23037E9A:
		goto l23037EC6;
	}
}

// 23037F22: void llc_data_ind_handler(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgD8)
void llc_data_ind_handler(Eq_2 ra, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgD8)
{
	ui32 a0_13;
	Eq_2 a1_14;
	Eq_2 s0_18;
	word32 s8_181;
	word32 a4_180;
	Eq_2 ra_17 = ble_ke_state_get(ra, a2 >> 0x08, a2, out s0_18, out a0_13, out a1_14, out a4_180, out s8_181);
	if ((a0_13 & 0x0F) != 0x0F)
	{
		if (((word32) *((char *) *((char *) &g_t42026428 + s0_18 * 0x04) + 0x00A5) & 0x08) == 0x00)
		{
			*((word32) a1_14 + 0x0FF8) = 0xF806;
			*((word32) a1_14 + 0x0FFA) = (word16) s0_18;
			word32 a4_188;
			word32 a3_187;
			word32 a2_186;
			word32 a0_185;
			word32 s1_184;
			word32 s0_183;
			word32 tp_182;
			word32 s2_189;
			word32 s3_190;
			word32 s4_191;
			word32 s5_192;
			word32 s6_193;
			word32 s7_194;
			word32 s9_195;
			word32 s10_196;
			word32 mstatus_197;
			hci_send_2_host(ra_17, s0_18, a1_14, s2, s3, s4, s5, dwLoc10, dwLoc0C, dwArg18, out tp_182, out s0_183, out s1_184, out a0_185, out a2_186, out a3_187, out a4_188, out s2_189, out s3_190, out s4_191, out s5_192, out s6_193, out s7_194, out s9_195, out s10_196, out mstatus_197);
		}
		else
		{
			em_buf_rx_free((word32) *((word32) a1_14 + 6));
			word32 s1_198;
			word32 a4_199;
			word32 s2_200;
			word32 s3_201;
			word32 s4_202;
			word32 s5_203;
			word32 mstatus_204;
			llc_util_dicon_procedure(ra_17, s0_18, s0_18, 61, s5, dwLoc20, dwArgD8, out s1_198, out a4_199, out s2_200, out s3_201, out s4_202, out s5_203, out mstatus_204);
		}
	}
	else
		em_buf_rx_free((word32) *((word32) a1_14 + 6));
}

// 23037F92: void lld_stop_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void lld_stop_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 a2;
	Eq_2 s1;
	Eq_2 ra;
	Eq_2 s0;
	Eq_2 s2;
	Eq_2 s4;
	Eq_2 s5;
	Eq_2 s6;
	Eq_2 dwArg08;
	Eq_2 dwArg28;
	Eq_2 dwArgE8;
	word32 dwLoc10;
	Eq_2 dwArg18;
	word32 dwLoc0C;
	Eq_2 dwArgC8;
	Eq_2 dwArgF8;
	ra_532 = ble_ke_state_get(ra, s0, a2, out s0_533, out a0_528, out a1_1005, out a4_1006, out s8_1007);
	if (a0_528 == 0x007F)
		fn2303803C(ra_532, s0_533, s2, s4, s5, s6, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8);
	else
	{
		a4_566 = (a2 >> 0x08) + 92;
		a4_566->w28008092 = (word16) (word32) (word16) ((word32) (word16) (word32) a4_566->w28008092 & -769);
		s6_571 = a2 >> 0x08 << 0x02;
		s4_583 = *((word32) s6_571 + 0x42026428);
		s2_584 = (word32) *((word32) s4_583 + 161);
		ra_589 = ble_ke_state_get(ra_532, a2 >> 0x08, a2, out s0_590, out a0_585, out a1_1008, out a4_1009, out s8_1010);
		if (a0_585 != 0x0F)
		{
			s2_595.u0 = 0x08;
			if (((word32) *((word32) *((word32) s6_571 + 0x42026428) + 92) & 0x0100) == 0x00)
				s2_598.u0 = 62;
		}
		s2_603 = ϕ(s2_584, s2_595, s2_598);
		if ((a0_585 & 0x01) == 0x00)
			fn2303803C(ra_589, s0_590, s2_603, s4_583, (word32) s6_571 + 0x42026428, s6, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8);
		else
		{
			a5_638 = (word32) *((word32) s4_583 + 0x00A3) + ~0x00 & 0x00FF;
			if (a5_638 > 0x12)
				fn2303803C(ra_589, s0_590, s2_603, s4_583, (word32) s6_571 + 0x42026428, s6, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8);
			else
			{
				switch (g_a230B6148[a5_638 * 0x04])
				{
				case 0x00:
					fn2303803C(ra_589, s0_590, s2_603, s4_583, (word32) s6_571 + 0x42026428, s6, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8);
					return;
				case 0x01:
					fn23038098(ra_589, s0_590, s2_603, 0x42026428, (word32) s6_571 + 0x42026428, s6, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8, dwArgF8);
					return;
				case 0x02:
				case 0x03:
				case 0x04:
				case 0x05:
					fn2303803C(ra_589, s0_590, s2_603, s4_583, (word32) s6_571 + 0x42026428, s6, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8);
					return;
				case 0x06:
				case 0x07:
				case 0x08:
					fn230380C6(ra_589, s0_590, s2_603, 0x42026428, s4_583, (word32) s6_571 + 0x42026428, s6, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8, dwArgF8);
					return;
				case 0x09:
				case 0x0A:
				case 11:
				case 0x0C:
				case 0x0D:
				case 0x0E:
				case 0x0F:
				case 0x10:
				case 0x11:
				case 0x12:
					fn230380A2(ra_589, s0_590, a2, s2_603, 0x42026428, s4_583, (word32) s6_571 + 0x42026428, s6_571, s6, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, s1, dwArgC8, dwArgE8, dwArgF8);
					return;
				}
			}
		}
	}
}

// 2303803C: void fn2303803C(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg0108)
// Called from:
//      llc_enc_mgt_ind_handler
//      lld_stop_ind_handler
//      fn23038048
void fn2303803C(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg0108)
{
	word32 s0_76;
	word32 s1_77;
	word32 s2_78;
	word32 s3_79;
	llc_feats_rd_event_send(ra, s0, s2, s0, (word32) s4 + 0x0069, s5, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, dwArg0108, out s0_76, out s1_77, out s2_78, out s3_79);
	fn23038048();
}

// 23038048: void fn23038048()
// Called from:
//      llc_enc_mgt_ind_handler
//      fn2303803C
void fn23038048()
{
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg0 = <invalid>;
	Eq_2 stackArg4 = <invalid>;
	Eq_2 stackArg16 = <invalid>;
	Eq_2 stackArg20 = <invalid>;
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg72 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	fn2303803C(ra, s0, s2, s4, s5, stackArg0, stackArg4, stackArg16, stackArg20, stackArg40, stackArg56, stackArg72, stackArg264);
}

