pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23038098: void fn23038098(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
// Called from:
//      llc_enc_mgt_ind_handler
//      lld_stop_ind_handler
void fn23038098(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 s0_21;
	Eq_2 s2_25;
	Eq_2 s4_27;
	Eq_2 s5_28;
	word32 s1_74;
	word32 s3_75;
	Eq_2 ra_20 = llc_version_rd_event_send(ra, s0, s2, s0, s2, s3, s5, dwArg10, dwArg14, dwArg38, dwArg0118, out s0_21, out s1_74, out s2_25, out s3_75, out s4_27, out s5_28);
	fn2303803C(ra_20, s0_21, s2_25, s4_27, s5_28, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, dwArg0108);
}

// 230380A2: void fn230380A2(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
// Called from:
//      llc_enc_mgt_ind_handler
//      lld_stop_ind_handler
void fn230380A2(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	word32 s3_5 = s3 + s6;
	if (((word32) *((word32) *s3_5 + 0x00A5) & 0x10) == 0x00)
	{
		Eq_2 s0_29;
		Eq_2 s2_33;
		Eq_2 s4_35;
		Eq_2 s5_36;
		word32 s1_168;
		word32 s3_169;
		Eq_2 ra_28 = llc_common_enc_change_evt_send(ra, s1, s0, 0x00, s2, s4, s5, s6, dwArg04, dwArg10, dwArg14, dwArg38, dwArg88, dwArgE8, dwArg0108, out s0_29, out s1_168, out s2_33, out s3_169, out s4_35, out s5_36);
		fn2303803C(ra_28, s0_29, s2_33, s4_35, s5_36, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, dwArg0108);
	}
	else
	{
		Eq_2 s0_85;
		Eq_2 s2_89;
		Eq_2 s4_91;
		Eq_2 s5_92;
		Eq_2 ra_84 = llc_common_enc_key_ref_comp_evt_send(ra, s0, s0, s2, s2, s3_5, s5, dwArg10, dwArg14, dwArg38, dwArg0118, out s0_85, out s2_89, out s4_91, out s5_92);
		fn2303803C(ra_84, s0_85, s2_89, s4_91, s5_92, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, dwArg0108);
	}
}

// 230380C6: void fn230380C6(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
// Called from:
//      llc_enc_mgt_ind_handler
//      lld_stop_ind_handler
void fn230380C6(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	if (llm_util_check_evt_mask(0x02) == 0x00)
		fn2303803C(ra, s0, s2, s4, s5, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, dwArg0108);
	else if (((word32) *((word32) s4 + 92) & 64) == 0x00)
		fn2303803C(ra, s0, s2, s4, s5, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, dwArg0108);
	else
	{
		Eq_2 s0_83;
		Eq_2 s2_87;
		Eq_2 s4_89;
		Eq_2 s5_90;
		word32 s1_164;
		word32 s3_165;
		Eq_2 ra_82 = llc_con_update_complete_send(ra, s0, s2, s0, 0x00, s3, s5, dwArg10, dwArg14, dwArg38, dwArg0118, out s0_83, out s1_164, out s2_87, out s3_165, out s4_89, out s5_90);
		fn2303803C(ra_82, s0_83, s2_87, s4_89, s5_90, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg48, dwArg0108);
	}
}

// 230380E4: Register Eq_2 llc_check_trafic_paused(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_151647) a0, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_151647) a0Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_pdu_llcp_tx_ack_defer
//      llc_pdu_acl_tx_ack_defer
Eq_2 llc_check_trafic_paused(Eq_2 ra, Eq_2 s0, struct Eq_151647 * a0, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArg0118, union Eq_2 & s0Out, ptr32 & s1Out, struct Eq_151647 & a0Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	ptr32 s1_17 = *a4;
	if (((word32) *((word32) a4 + 92) & 0x04) != 0x00)
	{
		s2 = __csrrs(mstatus, 0x00);
		__csrrc(mstatus, 0x08);
		Eq_2 a4_24 = a0->t0010;
		a0 = lld_util_get_tx_pkt_cnt(a0);
		__csrrw(mstatus, 0x00);
		if (a0 == null)
		{
			Eq_2 s1_32 = *a4_24;
			*((word32) a4_24 + 92) = (word16) ((word32) *((word32) a4_24 + 92) & ~0x04);
			0x00 = (int8) dwArg38;
			Eq_2 a2_34 = a0 << 0x08 | 1;
			struct Eq_151647 * a0_45;
			ptr32 mstatus_53;
			ptr32 s1_55;
			Eq_2 s2_56;
			Eq_2 s3_57;
			ptr32 s4_58;
			Eq_2 s0_63;
			word32 a7_131;
			word32 a6_130;
			word32 a4_129;
			word32 a3_128;
			word32 t1_127;
			Eq_2 ra_54 = ble_ke_msg_send_basic(ra, s0, s1_32, 262, a2_34, dwArg10, s2, s3, dwArg10, dwArg38, dwArg0118, out t1_127, out s0_63, out s1_55, out a0_45, out a3_128, out a4_129, out a6_130, out a7_131, out s2_56, out s3_57, out s4_58, out mstatus_53);
			s0Out = s0_63;
			s1Out = s1_55;
			a0Out = a0_45;
			s2Out = s2_56;
			s3Out = s3_57;
			s4Out = s4_58;
			mstatusOut = mstatus_53;
			return ra_54;
		}
	}
	0x00 = (int8) dwArg38;
	s0Out = s0;
	s1Out = s1_17;
	a0Out = a0;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	mstatusOut = mstatus;
	return ra;
}

// 23038150: Register Eq_2 llc_util_get_free_conhdl(Register Eq_2 ra, Register (ptr32 word16) a0, Register out (ptr32 word16) s1Out, Register out ptr32 a0Out)
// Called from:
//      llm_con_req_ind
//      llm_create_con
Eq_2 llc_util_get_free_conhdl(Eq_2 ra, word16 * a0, word16 & s1Out, ptr32 & a0Out)
{
	ptr32 a5_32;
	word32 a5_22;
	Eq_2 a0_14;
	Eq_2 s0_19;
	word32 a1_71;
	word32 a4_72;
	word32 s8_73;
	Eq_2 ra_18 = ble_ke_state_get(ra, 0x007F, 0x01, out s0_19, out a0_14, out a1_71, out a4_72, out s8_73);
	if (a0_14 != s0_19)
	{
		word32 a0_24;
		word32 s0_29;
		word32 a1_74;
		word32 a4_75;
		word32 s8_76;
		ra_18 = ble_ke_state_get(ra_18, s0_19, 0x0101, out s0_29, out a0_24, out a1_74, out a4_75, out s8_76);
		a5_32 = 0x09;
		if (a0_24 != s0_29)
			goto l2303817E;
		a5_22 = 0x01;
	}
	else
		a5_22 = 0x00;
	*a0 = (word16) a5_22;
	a5_32 = 0x00;
l2303817E:
	s1Out = a0;
	a0Out = a5_32;
	return ra_18;
}

