pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303818E: Register Eq_2 llc_util_get_nb_active_link(Register Eq_2 ra, Register Eq_2 s0, Register out ptr32 a0Out)
// Called from:
//      llc_end_evt_defer
Eq_2 llc_util_get_nb_active_link(Eq_2 ra, Eq_2 s0, ptr32 & a0Out)
{
	word32 a0_9;
	int32 a0_20;
	word32 s8_52;
	word32 a1_53;
	word32 a4_51;
	word32 a1_50;
	word32 s0_49;
	word32 a4_54;
	word32 s8_55;
	ptr32 s0_25;
	Eq_2 ra_24 = ble_ke_state_get(ble_ke_state_get(ra, s0, 0x01, out s0_49, out a0_9, out a1_50, out a4_51, out s8_52), (word32) (a0_9 != ~0x7E), 0x0101, out s0_25, out a0_20, out a1_53, out a4_54, out s8_55);
	if (a0_20 != 0x007F)
		++s0_25;
	a0Out = s0_25;
	return ra_24;
}

// 230381BE: Register Eq_2 llc_util_dicon_procedure(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register int32 a1, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArgF8, Register out (ptr32 Eq_164025) s1Out, Register out (ptr32 Eq_164026) a4Out, Register out (ptr32 Eq_2) s2Out, Register out Eq_164028 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_2) s5Out, Register out ptr32 mstatusOut)
// Called from:
//      llcp_ping_rsp_handler
//      llcp_terminate_ind_handler
//      llcp_enc_rsp_handler
//      llc_llcp_reject_ind
//      llcp_pause_enc_req_handler
//      llcp_start_enc_req_handler
//      llcp_enc_req_handler
//      llcp_unknown_rsp_handler
//      llcp_vers_ind_handler
//      llcp_pause_enc_rsp_handler
//      llcp_start_enc_rsp_handler
//      llcp_length_rsp_handler
//      llcp_con_param_rsp_handler
//      llcp_feats_rsp_handler
//      llcp_channel_map_ind_handler
//      llcp_con_upd_ind_handler
//      llcp_con_param_req_handler
//      llcp_slave_feature_req_handler
//      llcp_ping_req_handler
//      llcp_length_req_handler
//      llc_llcp_recv_ind_handler
//      llc_llcp_rsp_to_ind_handler
//      llc_link_sup_to_ind_handler
//      llc_data_ind_handler
//      llc_end_evt_defer
//      llc_pdu_llcp_tx_ack_defer
//      llc_pdu_defer
Eq_2 llc_util_dicon_procedure(Eq_2 ra, Eq_2 s0, Eq_2 a0, int32 a1, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArgF8, struct Eq_164025 & s1Out, struct Eq_164026 & a4Out, union Eq_2 & s2Out, union Eq_164028 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s1_15 = null[a0];
	((Eq_582893[]) 161)[a0].b0000 = (byte) a1;
	Eq_2 s0_18 = (word32) (word16) (a0 << 0x08 | 1);
	Eq_2 s1_32;
	Eq_2 s2_33;
	Eq_2 s3_34;
	Eq_2 s0_40;
	Eq_2 a0_44;
	ptr32 mstatus_51;
	union Eq_2 * s2_55;
	Eq_164028 s3_56;
	union Eq_2 * s5_58;
	word32 a0_100;
	word32 a2_101;
	word32 a4_102;
	word32 a5_103;
	word32 s4_104;
	word32 mstatus_105;
	word32 s0_106;
	word32 s1_107;
	word32 a1_108;
	word32 a2_109;
	word32 a3_110;
	word32 a4_111;
	word32 s4_112;
	word32 s8_113;
	Eq_2 ra_52 = ble_ke_timer_clear(ble_ke_state_set(ra, s0_18, s1_15, s0_18, 0x0F, dwArgF8, out s0_40, out s1_32, out a0_100, out a2_101, out a4_102, out a5_103, out s2_33, out s3_34, out s4_104, out mstatus_105), s0_40, s1_32, 261, s0_40, s2_33, s3_34, s5, s0, dwArgF8, out s0_106, out s1_107, out a0_44, out a1_108, out a2_109, out a3_110, out a4_111, out s2_55, out s3_56, out s4_112, out s5_58, out s8_113, out mstatus_51);
	Eq_2 s0_63 = __csrrs(mstatus_51, 0x00);
	__csrrc(mstatus_51, 0x08);
	struct Eq_164026 * a4_71;
	ptr32 mstatus_74;
	struct Eq_164025 * s1_77;
	ptr32 s4_78;
	Eq_2 ra_75 = lld_con_stop(ra_52, s0_63, a0_44, mstatus_51, dwArg00, out s1_77, out a4_71, out s4_78, out mstatus_74);
	__csrrw(mstatus_74, 0x00);
	s1Out = s1_77;
	a4Out = a4_71;
	s2Out = s2_55;
	s3Out = s3_56;
	s4Out = s4_78;
	s5Out = s5_58;
	mstatusOut = mstatus_74;
	return ra_75;
}

// 23038216: void llc_util_update_channel_map(Register word32 a0)
// Called from:
//      llm_con_req_ind
void llc_util_update_channel_map(word32 a0)
{
	g_ptr4200F3D0();
}

// 23038234: Register uint32 llc_util_set_auth_payl_to_margin(Register (ptr32 Eq_139958) a0)
// Called from:
//      llc_start
//      hci_wr_auth_payl_to_cmd_handler
uint32 llc_util_set_auth_payl_to_margin(struct Eq_139958 * a0)
{
	ui32 a2_7 = (word32) a0->w004C;
	Eq_174820 a3_9 = (uint16) (a0->w0050 + a0->w0036);
	ui32 a4_13 = (word32) ((Eq_582894[]) 88)[a2_7].w0000;
	uint32 a5_14;
	for (a5_14 = a3_9 << 0x03; a4_13 << 4 < a5_14; a5_14 -= a3_9)
		;
	uint32 a5_20 = a5_14 >> 4;
	if (a5_20 == 0x00)
		a5_20 = 0x01;
	((Eq_582895[]) 90)[a2_7].w0000 = (word16) a5_20;
	return a5_20;
}

// 23038270: Register Eq_2 llc_util_clear_operation_ptr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out)
// Called from:
//      llc_con_update_finished
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_con_param_rsp_handler
//      llcp_con_upd_ind_handler
//      llc_length_req_ind_handler
//      llc_enc_mgt_ind_handler
//      hci_le_rem_con_param_req_neg_reply_cmd_handler
//      hci_le_rem_con_param_req_reply_cmd_handler
Eq_2 llc_util_clear_operation_ptr(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out)
{
	word32 * a1_12 = null[a0];
	if (a0 << 2 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		return ra;
	}
	else
	{
		*a1_12 = 0x00;
		Eq_2 a0_14 = (a0 << 2) + ~0x0B;
		Eq_2 s1_31;
		Eq_2 s2_32;
		Eq_2 s3_33;
		Eq_2 s4_34;
		Eq_2 s5_35;
		Eq_2 s0_39;
		word32 tp_73;
		word32 a0_74;
		word32 a2_75;
		word32 a3_76;
		word32 a4_77;
		word32 a5_78;
		word32 mstatus_79;
		Eq_2 ra_30 = ble_ke_msg_free(ra, s0, s1, a0_14, s2, s3, s4, s5, out tp_73, out s0_39, out s1_31, out a0_74, out a2_75, out a3_76, out a4_77, out a5_78, out s2_32, out s3_33, out s4_34, out s5_35, out mstatus_79);
		s0Out = s0_39;
		s1Out = s1_31;
		s2Out = s2_32;
		s3Out = s3_33;
		s4Out = s4_34;
		s5Out = s5_35;
		return ra_30;
	}
}

// 23038292: Register Eq_2 llc_util_bw_mgt(Register Eq_2 ra, Register (ptr32 Eq_174900) s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArgE8, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_end_evt_defer
Eq_2 llc_util_bw_mgt(Eq_2 ra, struct Eq_174900 * s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 dwArgE8, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	if (*((char *) &g_t42026428 + a0 * 0x04) == 0x00)
	{
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		struct Eq_174915 * a5_17 = s1->ptr0010;
		struct Eq_151266 * s1_20 = ((struct Eq_151266 *[]) 80)[a0];
		uint32 s0_25 = (uint16) (a5_17->w0050 + a5_17->w004E) + 0x0096 << 16;
		if ((word32) (word16) ((word32) ((Eq_582899[]) 8)[a0].w0000 + 625) < s0_25 >> 16)
		{
			((Eq_582900[]) 8)[a0].w0000 = (word16) ((s0_25 >> 16) + 624 ^ 625);
			if (lld_get_mode(a0) == 0x03)
				s1_20->w0012 = (word16) (s0_25 >> 16);
			word32 a0_40;
			ra = llc_util_get_nb_active_link(ra, s0_25 >> 16, out a0_40);
			if (a0_40 != 0x01)
			{
				ptr32 mstatus_86;
				Eq_2 s2_88;
				Eq_2 s3_89;
				ptr32 s4_90;
				Eq_2 ra_87 = lld_util_anchor_point_move(ra, s1_20, s2, s3, dwArgE8, out s2_88, out s3_89, out s4_90, out mstatus_86);
				s2Out = s2_88;
				s3Out = s3_89;
				s4Out = s4_90;
				mstatusOut = mstatus_86;
				return ra_87;
			}
		}
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
}

// 23038318: Register Eq_2 llc_end_evt_defer(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArgE8, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_deffered_elt_handler
Eq_2 llc_end_evt_defer(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArgE8, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	struct Eq_174900 * s1_14 = null[a0];
	if (a0 << 0x02 == 0x00)
	{
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		ui32 a0_24;
		struct Eq_175002 * a4_26;
		Eq_2 s0_29;
		word32 a1_155;
		word32 s8_156;
		Eq_2 ra_28 = ble_ke_state_get(ra, a0, (word32) (word16) (a0 << 8 | 1), out s0_29, out a0_24, out a1_155, out a4_26, out s8_156);
		if ((a0_24 & 0x0F) == 0x0F)
		{
			s1_14 = a4_26->ptr0000;
			ui32 a5_35 = (word32) a4_26->w005C;
			if ((a5_35 & 0x0200) != 0x00)
			{
				int32 a1_37 = (word32) a4_26->b00A1;
				a4_26->w005C = (word16) (a5_35 & -513);
				word32 a4_157;
				word32 s4_158;
				word32 s5_159;
				word32 mstatus_160;
				ra_28 = llc_util_dicon_procedure(ra_28, s0_29, s0_29, a1_37, s5, dwLoc10, dwArgE8, out s1_14, out a4_157, out s2, out s3, out s4_158, out s5_159, out mstatus_160);
			}
		}
		ptr32 mstatus_87;
		Eq_2 s2_89;
		Eq_2 s3_90;
		ptr32 s4_91;
		Eq_2 ra_82 = llc_util_bw_mgt(ra_28, s1_14, s0_29, s2, s3, dwArgE8, out s2_89, out s3_90, out s4_91, out mstatus_87);
		s2Out = s2_89;
		s3Out = s3_90;
		s4Out = s4_91;
		mstatusOut = mstatus_87;
		return ra_82;
	}
}

// 23038380: Register Eq_2 llc_pdu_llcp_tx_ack_defer(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Register out Eq_2 s0Out, Register out (ptr32 Eq_148861) s1Out, Register out Eq_148862 a0Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_148865 s4Out, Register out Eq_2 s5Out, Register out Eq_148867 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_pdu_check
Eq_2 llc_pdu_llcp_tx_ack_defer(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArg0118, word32 dwArg0128, union Eq_2 & s0Out, struct Eq_148861 & s1Out, union Eq_148862 & a0Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_148865 & s4Out, union Eq_2 & s5Out, union Eq_148867 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s0_10 = (word32) (word16) (a0 << 0x08 | 1);
	Eq_2 s3_111 = a0;
	Eq_148862 a0_31;
	Eq_2 s0_36;
	word32 a4_339;
	word32 a1_338;
	word32 s8_340;
	Eq_2 ra_35 = ble_ke_state_get(ra, s0_10, s0_10, out s0_36, out a0_31, out a1_338, out a4_339, out s8_340);
	if ((a0_31 & 0x007F) == 0x007F)
	{
		0x00 = dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1;
		a0Out = a0_31;
		s2Out = s2;
		s3Out = a0;
		s4Out = dwArg78;
		s5Out = s5;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra_35;
	}
	Eq_2 s5_188 = (a0 << 0x02) + 0x42026428;
	Eq_2 s6_56 = *s5_188;
	ui32 a0_57;
	Eq_2 s0_62;
	word32 a1_341;
	word32 s8_342;
	Eq_2 a4_103;
	Eq_2 ra_108 = ble_ke_state_get(ra_35, s0_36, s0_36, out s0_62, out a0_57, out a1_341, out a4_103, out s8_342);
	if ((a0_57 & 0x0F) == 0x0F)
	{
		a4_103 = *s5_188;
		if (((word32) *((word32) a4_103 + 92) & 0x0200) == 0x00 && a1 == 0x02)
		{
			word32 s1_343;
			word32 s2_344;
			word32 s4_345;
			ra_108 = llc_util_dicon_procedure(ra_108, s0_62, a0, (word32) *((word32) a4_103 + 161), s5_188, dwLoc30, dwArgC8, out s1_343, out a4_103, out s2_344, out s3_111, out s4_345, out s5_188, out mstatus);
		}
		goto l230383FA;
	}
	if ((a0_31 & 2) != 0x00)
	{
		word32 a5_69 = (word32) *((word32) s6_56 + 0x00A4);
		a4_103.u0 = 0x0C;
		if (a5_69 == 0x0C)
			a5_69 = 0x06;
		else
		{
			a4_103.u0 = 0x0D;
			if (a5_69 != 0x0D)
				goto l2303846E;
		}
		if (a1 == a5_69)
		{
			Eq_2 s1_119 = (int32) (byte) a0_31;
			Eq_2 s1_131;
			Eq_2 s0_139;
			Eq_2 s2_152[];
			word32 a0_346;
			word32 a2_347;
			word32 a4_348;
			word32 a5_349;
			word32 s2_350;
			word32 s3_351;
			word32 s4_352;
			word32 mstatus_353;
			word32 s0_354;
			word32 s1_355;
			word32 a0_356;
			word32 a2_357;
			word32 a4_358;
			word32 a5_359;
			word32 s4_360;
			ra_108 = ble_ke_state_set(ble_ke_state_set(ra_108, s0_62, s1_119, s0_62, s1_119 & 0x00FD, dwArgD8, out s0_139, out s1_131, out a0_346, out a2_347, out a4_348, out a5_349, out s2_350, out s3_351, out s4_352, out mstatus_353), s0_139, s1_131, s0_139, s1_131 & 0x00F9, dwArgD8, out s0_354, out s1_355, out a0_356, out a2_357, out a4_358, out a5_359, out s2_152, out s3_111, out s4_360, out mstatus);
			((word32) s6_56 + 0x00A4)->u0 = 0x00;
			__csrrs(mstatus, 0x00);
			__csrrc(mstatus, 0x08);
			a4_103 = s2_152[a0];
			*((byte) a4_103.u0 + 0x00A5) = (byte) ((word32) *((byte) a4_103.u0 + 0x00A5) & -37);
			__csrrw(mstatus, 0x00);
l230383FA:
			0x00 = dwArg0128;
			struct Eq_151647 * a0_203 = s3_111 & 0x00FF;
			struct Eq_148861 * s1_216;
			Eq_148862 a0_218;
			Eq_2 s2_220;
			ptr32 mstatus_225;
			Eq_2 s0_227;
			Eq_2 s3_228;
			Eq_148865 s4_229;
			Eq_2 ra_226 = llc_check_trafic_paused(ra_108, dwArgE4, a0_203, a4_103, s3_111, mstatus, dwArg10, dwArg38, dwArg0118, out s0_227, out s1_216, out a0_218, out s2_220, out s3_228, out s4_229, out mstatus_225);
			s0Out = s0_227;
			s1Out = s1_216;
			a0Out = a0_218;
			s2Out = s2_220;
			s3Out = s3_228;
			s4Out = s4_229;
			s5Out = s5_188;
			s7Out = a0 << 0x02;
			mstatusOut = mstatus_225;
			return ra_226;
		}
	}
l2303846E:
	if ((a0_31 & 0x01) != 0x00)
	{
		a4_103 = (word32) *((word32) s6_56 + 0x00A3);
		if (a4_103 == 0x0C && a1 == 11)
		{
			word32 t1_361;
			word32 s0_362;
			word32 s1_363;
			word32 a0_364;
			word32 a3_365;
			word32 a6_366;
			word32 a7_367;
			word32 s2_368;
			word32 s4_369;
			ra_108 = ble_ke_msg_send_basic(ra_108, s0_62, a0_31 & 0x01, 262, s0_62, s0_62, 0x42026428, a0, s2, dwArg08, dwArgE8, out t1_361, out s0_362, out s1_363, out a0_364, out a3_365, out a4_103, out a6_366, out a7_367, out s2_368, out s3_111, out s4_369, out mstatus);
		}
	}
	goto l230383FA;
}

// 230384A6: Register Eq_2 llc_pdu_acl_tx_ack_defer(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_pdu_check
Eq_2 llc_pdu_acl_tx_ack_defer(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s2Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	if (*((char *) &g_t42026428 + a0 * 0x04) == 0x00)
	{
		s0Out = s0;
		s2Out = s2;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s0_15 = a0;
		if (a1 != 0x00)
		{
			word32 s1_148;
			word32 a0_149;
			word32 a3_150;
			word32 s2_151;
			word32 s4_152;
			word32 s5_153;
			word32 s6_154;
			word32 s7_155;
			ra = llc_common_nb_of_pkt_comp_evt_send(ra, a0, a0, a1, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_15, out s1_148, out a0_149, out a3_150, out a4, out s2_151, out s3, out s4_152, out s5_153, out s6_154, out s7_155, out mstatus);
		}
		struct Eq_151647 * a0_48 = s0_15 & 0x00FF;
		Eq_2 s2_66;
		ptr32 mstatus_71;
		Eq_2 s0_73;
		ptr32 s4_75;
		word32 s1_156;
		word32 a0_157;
		word32 s3_158;
		Eq_2 ra_72 = llc_check_trafic_paused(ra, s0, a0_48, a4, s3, mstatus, dwArg10, dwArg38, dwArg0118, out s0_73, out s1_156, out a0_157, out s2_66, out s3_158, out s4_75, out mstatus_71);
		s0Out = s0_73;
		s2Out = s2_66;
		s4Out = s4_75;
		mstatusOut = mstatus_71;
		return ra_72;
	}
}

// 230384D6: Register Eq_2 llc_pdu_defer(Register Eq_2 ra, Register Eq_2 a0, Register Eq_148921 a1, Register word32 a2, Register word32 a3, Register word32 a4, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out (ptr32 (ptr32 Eq_175470)) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      lld_pdu_check
Eq_2 llc_pdu_defer(Eq_2 ra, Eq_2 a0, Eq_148921 a1, word32 a2, word32 a3, word32 a4, word32 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & s2Out, struct Eq_175470 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 s2_149 = (a0 << 0x02) + 0x42026428;
	struct Eq_175470 ** s3_181 = &g_dw42026000;
	Eq_2 s6_153 = *s2_149;
	if (s6_153 != 0x00)
	{
		<anonymous> * a5_27 = g_ptr42025748;
		struct Eq_175385 * sp_37;
		word32 s3_38;
		word32 a0_41;
		Eq_2 s0_43;
		ui32 s1_44;
		word32 a3_51;
		word32 a7_210;
		word32 mstatus_211;
		word32 t1_212;
		Eq_2 s4_151;
		a5_27();
		Eq_2 a5_56 = *s2_149;
		*((word32) s6_153 + 0x0068) = (byte) a0_41;
		llc_ch_assess_local(s0_43, s1_44, (int32) *((word32) a5_56 + 0x0068), a3_51);
		Eq_2 s3_150 = s3_38 + 0x0428;
		if ((s1_44 & 29) != 0x00)
		{
			s1 = s1_44 & 0x10;
			if ((s1_44 & 0x10) != 0x00)
			{
				word32 mstatus_274;
				word32 a4_273;
				ra = llc_util_dicon_procedure(ra, s0_43, s0_43, 61, s5, sp_37->t0000, sp_37->t00F8, out s1, out a4_273, out s2_149, out s3_150, out s4_151, out s5, out mstatus_274);
			}
		}
		else
		{
			Eq_2 s0_76 = (word32) (word16) (s0_43 << 8 | 1);
			Eq_2 s0_90;
			word32 mstatus_272;
			word32 a5_271;
			ra = ble_ke_timer_set(ra, s0_76, s1_44 & 288, 0x0101, s0_76, (word32) *((word32) *s2_149 + 84), s2_149, s3_38 + 0x0428, s4_151, s5, s6_153, sp_37->t0010, sp_37->t00A8, sp_37->t0108, out s0_90, out s1, out a5_271, out s2_149, out s3_150, out s4_151, out s5, out s6_153, out mstatus_272);
			if (s1 == 0x00 && s5 != 0x00)
			{
				Eq_2 a5_101 = *s2_149;
				if (((word32) *((word32) a5_101 + 0x00A5) & 0x03) == 0x03 && ((word32) (*((word32) a5_101 + 92)) & 0x08) == 0x00)
				{
					Eq_2 s0_122;
					Eq_2 s1_123;
					Eq_2 s2_124;
					Eq_2 s3_125;
					Eq_2 s4_126;
					Eq_2 s5_127;
					Eq_2 s6_128;
					word32 a5_278;
					word32 mstatus_279;
					word32 mstatus_276;
					word32 s0_277;
					word32 a5_275;
					ra = ble_ke_timer_set(ble_ke_timer_set(ra, s0_90, s1, 259, s0_90, (uint16) (*((word32) a5_101 + 88) - *((word32) a5_101 + 90)), s2_149, s3_150, s4_151, s5, s6_153, sp_37->t0010, sp_37->t00A8, sp_37->t0108, out s0_122, out s1_123, out a5_275, out s2_124, out s3_125, out s4_126, out s5_127, out s6_128, out mstatus_276), s0_122, s1_123, 260, s0_122, (word32) *((word32) *s2_124 + 88), s2_124, s3_125, s4_126, s5_127, s6_128, sp_37->t0010, sp_37->t00A8, sp_37->t0108, out s0_277, out s1, out a5_278, out s2_149, out s3_150, out s4_151, out s5, out s6_153, out mstatus_279);
				}
			}
		}
		s3_181 = s3_150 + s4_151;
		struct Eq_175470 * a5_183 = *s3_181;
		ui32 a4_184 = (word32) a5_183->w005C;
		if ((a4_184 & 32) != 0x00)
		{
			a5_183->w005C = (word16) (a4_184 & -33);
			a5_183->w0054 = (word16) (word32) a5_183->w0056;
		}
	}
	0x00 = dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1;
	s2Out = s2_149;
	s3Out = s3_181;
	s4Out = dwArg78;
	s5Out = s5;
	s6Out = s6_153;
	return ra;
}

// 230385D8: void llm_dft_handler()
void llm_dft_handler()
{
}

// 230385DC: void llm_le_set_host_ch_class_cmd_sto_handler()
void llm_le_set_host_ch_class_cmd_sto_handler()
{
	g_b42026497 = 0x01;
}

// 230385EA: void llm_ecc_result_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 s5, Stack Eq_2 dwArg0108)
void llm_ecc_result_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 s5, Eq_2 dwArg0108)
{
	word32 a1_118;
	struct Eq_175616 * s1_103;
	struct Eq_175617 * s0_116;
	Eq_2 ra_101;
	word32 s3_105;
	word32 s2_104;
	<anonymous> * a5_115;
	word32 a5_16 = (word32) g_b42026533;
	struct Eq_175626 * s2_166 = &g_t42026460;
	if (a5_16 == 0x02)
	{
		if (llm_util_check_evt_mask(0x08) == 0x00)
			goto l2303864E;
		struct Eq_175617 * a0_92;
		word32 s8_267;
		word32 mstatus_268;
		word32 a7_265;
		word32 s4_266;
		word32 a4_263;
		word32 a6_264;
		word32 a2_261;
		word32 a3_262;
		word32 s0_259;
		word32 a1_260;
		ra_101 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF804, 0x00, 62, 0x0022, 0x42026460, a1, dwArg0108, out s0_259, out s1_103, out a0_92, out a1_260, out a2_261, out a3_262, out a4_263, out a6_264, out a7_265, out s2_104, out s3_105, out s4_266, out s8_267, out mstatus_268);
		a0_92->b0000 = 0x09;
		a0_92->b0001 = 0x00;
		a5_115 = g_ptr4200F3D0;
		s0_116 = a0_92;
		a1_118 = s3_105;
	}
	else
	{
		if (a5_16 != 0x01 || llm_util_check_evt_mask(0x07) == 0x00)
			goto l2303864E;
		struct Eq_175688 * a0_31;
		word32 s2_43;
		word32 s3_44;
		word32 s0_269;
		word32 s1_270;
		word32 a1_271;
		word32 a2_272;
		word32 a3_273;
		word32 a4_274;
		word32 a6_275;
		word32 a7_276;
		word32 s4_277;
		word32 s8_278;
		word32 mstatus_279;
		Eq_2 ra_40 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF804, 0x00, 62, 66, 0x42026460, a1, dwArg0108, out s0_269, out s1_270, out a0_31, out a1_271, out a2_272, out a3_273, out a4_274, out a6_275, out a7_276, out s2_43, out s3_44, out s4_277, out s8_278, out mstatus_279);
		a0_31->b0000 = 0x08;
		a0_31->b0001 = 0x00;
		<anonymous> * a5_54 = g_ptr4200F3D0;
		word32 a7_75;
		word32 mstatus_76;
		word32 t1_77;
		word32 tp_78;
		word32 s10_197;
		word32 s11_198;
		word32 s6_199;
		word32 s7_200;
		word32 s9_201;
		word32 t0_202;
		word32 t4_203;
		a5_54();
		a5_115 = s1_103->ptr03D0;
		a1_118 = s3_105 + 32;
	}
	struct Eq_175751 * sp_128;
	Eq_2 s2_130;
	Eq_2 s3_131;
	Eq_2 ra_132;
	Eq_2 s0_133;
	Eq_2 s4_142;
	word32 s10_206;
	word32 s11_207;
	word32 s6_208;
	word32 s7_209;
	word32 s9_210;
	word32 t0_211;
	word32 t4_212;
	a5_115();
	word32 mstatus_160;
	word32 s5_169;
	word32 tp_178;
	word32 s0_280;
	word32 s1_281;
	word32 a0_282;
	word32 a2_283;
	word32 a3_284;
	word32 a4_285;
	word32 s3_286;
	word32 s4_287;
	word32 s6_288;
	word32 s7_289;
	word32 s9_290;
	word32 s10_291;
	hci_send_2_host(ra_132, s0_133, s0_133, s2_130, s3_131, s4_142, s5, sp_128->t0010, sp_128->t0014, sp_128->t0038, out tp_178, out s0_280, out s1_281, out a0_282, out a2_283, out a3_284, out a4_285, out s2_166, out s3_286, out s4_287, out s5_169, out s6_288, out s7_289, out s9_290, out s10_291, out mstatus_160);
l2303864E:
	s2_166->b00D3 = 0x00;
}

// 230386B4: void llm_enc_req_handler(Register Eq_2 ra, Register Eq_2 a1, Register ptr32 mstatus)
void llm_enc_req_handler(Eq_2 ra, Eq_2 a1, ptr32 mstatus)
{
	Eq_2 s1_21;
	word32 a0_56;
	word32 a5_57;
	Eq_2 ra_20 = ble_co_list_push_back(ra, 0x42026460, a1, 0x42026460, (word32) a1 - 0x0C, out s1_21, out a0_56, out a5_57);
	if ((word32) g_b420264B8 == 0x00)
		llm_encryption_start(ra_20, 0x42026460, s1_21, mstatus);
}

