pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230386E8: void lld_stop_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack word32 dwArg18, Stack Eq_2 dwArg28, Stack Eq_139126 dwArg38, Stack word32 dwArg78, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void lld_stop_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, word32 dwArg18, Eq_2 dwArg28, Eq_139126 dwArg38, word32 dwArg78, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	ui32 a0_9;
	word32 a1_506;
	word32 s8_508;
	word32 a4_507;
	Eq_2 s0_14;
	Eq_2 ra_13 = ble_ke_state_get(ra, s0, 0x00, out s0_14, out a0_9, out a1_506, out a4_507, out s8_508);
	if ((a0_9 & 0x00F0) != 32)
	{
		ui32 a0_20;
		word32 a1_509;
		word32 s8_511;
		word32 a4_510;
		ra_13 = ble_ke_state_get(ra_13, s0_14, 0x00, out s0_14, out a0_20, out a1_509, out a4_510, out s8_511);
		if ((a0_20 & 0x0F) != 0x03)
			return;
	}
	Eq_2 s0_103;
	int32 a0_33;
	Eq_2 s0_38;
	word32 a1_512;
	word32 s8_514;
	word32 a4_513;
	Eq_2 ra_102 = ble_ke_state_get(ra_13, s0_14, 0x00, out s0_38, out a0_33, out a1_512, out a4_513, out s8_514);
	if (a0_33 == 35)
	{
		s0_103.u0 = 0x42026460;
		if (((word32) g_b420264CE & 0x00F0) == 0x10)
		{
			ra_102 = llm_common_cmd_complete_send(ra_102, 0x42026460, s1, (word32) g_w420264CC, 0x00, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_103, out s1, out s2, out s3, out s5);
			*((byte) s0_103.u0 + 110) = (byte) ((word32) *((byte) s0_103.u0 + 110) & 0x0F);
		}
		word32 a5_92 = (word32) *((byte) s0_103.u0 + 80);
		((byte) s0_103.u0 + 72)->u0 = 0x00;
		if ((a5_92 + ~0x00 & 0x00FF) > 0x01)
		{
l230387E0:
			g_ptr420264B4 = null;
			goto l230387E8;
		}
l230387B6:
		Eq_2 s5_173;
		word32 s2_538;
		word32 s3_539;
		ra_102 = llm_common_cmd_complete_send(ra_102, s0_103, s1, (word32) *((byte) s0_103.u0 + 78), 0x00, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_103, out s1, out s2_538, out s3_539, out s5_173);
		if ((word32) *((byte) s0_103.u0 + 80) == 0x02)
		{
			word32 a0_540;
			word32 s2_541;
			word32 s3_542;
			word32 s4_543;
			word32 s5_544;
			word32 mstatus_545;
			ra_102 = llc_le_con_cmp_evt_send(ra_102, s0_103, s1, 0x02, 0x0FFFFFFF, 0x00, s5_173, dwLoc10, s0, dwArg00, dwArg04, dwArg18, dwArg28, dwArg38, dwArg78, dwArgF8, out s0_103, out s1, out a0_540, out s2_541, out s3_542, out s4_543, out s5_544, out mstatus_545);
		}
		*((byte) s0_103.u0 + 80) = (byte) ((word32) *((byte) s0_103.u0 + 80) & ~0x0F);
		goto l230387E0;
	}
	else
	{
		ui32 a0_98;
		word32 a1_515;
		word32 s8_517;
		word32 a4_516;
		ra_102 = ble_ke_state_get(ra_102, s0_38, 0x00, out s0_103, out a0_98, out a1_515, out a4_516, out s8_517);
		if ((a0_98 & 0x00F0) == 32)
		{
			s0_103.u0 = 0x42026460;
			if ((word32) g_b420264AC == 0x00)
			{
				if (((word32) g_b420264CE & 0x00F0) == 0x10)
				{
					word32 s3_523;
					word32 s2_522;
					word32 s5_524;
					ra_102 = llm_common_cmd_complete_send(ra_102, 0x42026460, s1, (word32) g_w420264CC, 0x00, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_103, out s1, out s2_522, out s3_523, out s5_524);
					*((byte) s0_103.u0 + 110) = (byte) ((word32) *((byte) s0_103.u0 + 110) & 0x0F);
				}
				((byte) s0_103.u0 + 72)->u0 = 0x00;
l230387E8:
				Eq_2 a1_281;
				Eq_2 s0_280;
				ui32 a0_267;
				word32 a1_526;
				word32 a4_527;
				word32 s0_525;
				word32 s8_528;
				Eq_2 ra_271 = ble_ke_state_get(ra_102, s0_103, 0x00, out s0_525, out a0_267, out a1_526, out a4_527, out s8_528);
				struct Eq_154950 * a5_278 = g_ptr420264A8;
				if (a5_278 == null)
				{
					s0_280 = a5_278->t0054;
					a1_281.u0 = 0x00;
					if (a5_278 != null)
						a1_281 = a0_267 & 0x0F;
				}
				else
				{
					s0_280 = a5_278->t0054;
					if (a5_278 != null)
					{
						while (true)
							;
					}
					a1_281 = a0_267 & 0x00F0;
				}
				struct Eq_176011 * s0_317;
				word32 s1_529;
				word32 a0_530;
				word32 a2_531;
				word32 a4_532;
				word32 a5_533;
				word32 s2_534;
				word32 s3_535;
				word32 s4_536;
				word32 mstatus_537;
				ble_ke_state_set(ra_271, s0_280, s1, 0x00, a1_281, dwArgF8, out s0_317, out s1_529, out a0_530, out a2_531, out a4_532, out a5_533, out s2_534, out s3_535, out s4_536, out mstatus_537);
				s0_317->w0044 = ~0x00;
				return;
			}
		}
		word32 s8_521;
		ui32 a0_115;
		word32 s0_518;
		word32 a4_520;
		word32 a1_519;
		ra_102 = ble_ke_state_get(ra_102, s0_103, 0x00, out s0_518, out a0_115, out a1_519, out a4_520, out s8_521);
		if ((a0_115 & 0x0F) == 0x03)
		{
			s0_103.u0 = 0x42026460;
			if ((word32) g_b420264AC != 0x00)
			{
				word32 a4_130 = (word32) g_b420264B0;
				if ((a4_130 + -1 & 0x00FF) > 0x01 && a4_130 != 0x11)
					goto l230387E0;
				goto l230387B6;
			}
		}
		while (true)
			;
	}
}

// 2303885E: void llc_ch_assess_local(Register Eq_2 a0, Register ui32 a1, Register int32 a2, Register word32 a3)
// Called from:
//      llc_pdu_defer
void llc_ch_assess_local(Eq_2 a0, ui32 a1, int32 a2, word32 a3)
{
	int32 a5_18;
	struct Eq_176152 * a3_13 = a3 + (a0 << 2);
	int32 a5_14 = (int32) a3_13->b0014;
	if ((a1 & 1) != 0x00)
	{
		if ((int32) g_b42026490 >= a2)
		{
			a5_18 = a5_14 + ~0x00;
			if ((word32) ((Eq_582904[]) 57)[a0].b0000 != 0x00)
				goto l2303889A;
			goto l2303888C;
		}
	}
	else
	{
		a5_14 &= 0x00FF;
		if ((a1 & 0x08) == 0x00)
		{
			a5_18 = (a5_14 & 0x00FF) + 0x03;
l2303888C:
			a3_13->b0014 = (byte) a5_18;
l2303889A:
			int32 a2_31 = (int32) a3_13->b0014;
			int32 a5_35 = (int32) g_b4202648E;
			if (a2_31 >= a5_35)
			{
				a5_35 = (int32) g_b4202648F;
				if (a5_35 >= a2_31)
					return;
			}
			a3_13->b0014 = (byte) a5_35;
			return;
		}
	}
	a5_18 = a5_14 + ~0x02;
	goto l2303888C;
}

// 230388C2: Register Eq_2 llc_ch_assess_get_local_ch_map(Register Eq_2 ra, Register Eq_2 s0, Register word32 s1, Register ptr32 a1, Register ptr32 a2, Register Eq_2 s2, Stack word32 dwArg38, Register out ptr32 s1Out, Register out Eq_173735 a0Out, Register out (ptr32 (arr byte)) s2Out)
// Called from:
//      llc_chnl_assess_timer_handler
Eq_2 llc_ch_assess_get_local_ch_map(Eq_2 ra, Eq_2 s0, word32 s1, ptr32 a1, ptr32 a2, Eq_2 s2, word32 dwArg38, ptr32 & s1Out, union Eq_173735 & a0Out, byte (& s2Out)
{
	<anonymous> * a5_18 = g_ptr4200F3D4;
	word32 s0_29;
	byte s2_30[];
	Eq_2 ra_31;
	ptr32 s1_32;
	a5_18();
	int32 a3_42;
	Eq_173735 a0_43 = 0x00;
	for (a3_42 = 36; a3_42 != ~0x00; a3_42 += ~0x00)
	{
		int32 a4_48 = a3_42 << 0x18;
		ui32 a5_57 = 0x01 << (a3_42 & 7);
		if (((word32) s2_30[a4_48 >> 27] & (a5_57 & 0x00FF)) != 0x00 && (int32) g_b4202648E < (int32) (s1_32 + a3_42)->b0014)
		{
			byte * a4_66 = (a4_48 >> 27) + s0_29;
			*a4_66 = (byte) (a5_57 & 0x00FF | (word32) (*a4_66));
			a0_43 = (word32) a0_43.u0 + 1 & 0x00FF;
		}
	}
	0x00 = dwArg38;
	s1Out = s1_32;
	a0Out = a0_43;
	s2Out = s2_30;
	return ra_31;
}

// 23038954: void llc_ch_assess_get_current_ch_map()
// Called from:
//      llc_chmap_update_req_ind_handler
void llc_ch_assess_get_current_ch_map()
{
}

// 23038968: void llc_ch_assess_reass_ch(Register uint32 a0, Register ptr32 a1, Register Eq_173798 a2, Register uint32 a3)
// Called from:
//      llc_chnl_assess_timer_handler
void llc_ch_assess_reass_ch(uint32 a0, ptr32 a1, Eq_173798 a2, uint32 a3)
{
	struct Eq_176272 * t5_9 = *((char *) &g_t42026428 + a0 * 0x04);
	uint32 a0_11 = 0x0A;
	Eq_176279 a5_12 = (word32) t5_9->b003B;
	if (a3 > 0x02)
		a0_11 = (a3 << 0x05) + 0x007F >> 7;
	t5_9->b003A = (byte) (word32) g_b42026491;
	int32 a6_20 = 37;
	do
	{
		Eq_176301 a4_26 = (word32) a5_12 + 11;
		if ((a4_26 & 0x00FF) > 36)
			a5_12 = (word32) a5_12 - 26 & 0x00FF;
		else
			a5_12 = a4_26 & 0x00FF;
		Eq_176316 a3_33 = a5_12 >> 0x03;
		byte * a7_36 = (word32) a3_33 + a1;
		ui32 a4_43 = 0x01 << (a5_12 & 7);
		if ((a4_43 & 0x00FF & (word32) (*a7_36)) == 0x00 && (CONVERT(Mem39[a3_33 + a2:byte], byte, word32) & (a4_43 & 0x00FF)) != 0x00)
		{
			Mem54[t5_9 + a5_12 + 20:byte] = 0x00;
			*a7_36 = (byte) (a4_43 & 0x00FF | (word32) (*a7_36));
			a0_11 = (word32) (word16) (a0_11 + ~0x00);
		}
		int32 a6_66 = a6_20 + ~0x00;
		a6_20 = a6_66 & 0x00FF;
	} while ((a6_66 & 0x00FF) != 0x00 && a0_11 != 0x00);
	t5_9->b003B = (byte) a5_12;
}

