pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23038A0E: void hci_le_set_data_len_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_le_set_data_len_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	Eq_2 a1_100;
	Eq_2 s0_54;
	Eq_2 s1_15 = a1;
	Eq_2 s2_17 = a3;
	ui32 a0_19;
	Eq_2 s0_24;
	word32 a1_194;
	word32 a4_195;
	word32 s8_196;
	Eq_2 ra_102 = ble_ke_state_get(ra, s0, a2, out s0_24, out a0_19, out a1_194, out a4_195, out s8_196);
	if ((a0_19 & 0x0F) == 0x0F)
	{
		a1_100.u0 = 0x0C;
		goto l23038AB0;
	}
	uint32 a0_30 = (word32) *a1;
	struct Eq_176408 * a5_35 = *((char *) &g_t42026428 + a0_30 * 0x04);
	if ((word32) a5_35->b0052 != 0x00)
	{
		a1_100.u0 = 0x1A;
		goto l23038AB0;
	}
	word32 a1_38 = (word32) *((word32) a1 + 2);
	if ((word32) (word16) (a1_38 + -27) <= 224)
	{
		word32 a3_43 = (word32) *((word32) a1 + 4);
		if ((word32) (word16) (a3_43 + -328) <= 0x0700 && a0_30 <= 0x02)
		{
			if ((word32) a5_35->w0046 != a1_38 || (word32) a5_35->w004E != a3_43)
			{
				*((word32) a1 + 0x0C) = a5_35;
				word32 a6_202;
				word32 mstatus_205;
				word32 a7_203;
				word32 s4_204;
				word32 s0_198;
				word32 a4_201;
				word32 a0_199;
				word32 a3_200;
				word32 t1_197;
				ra_102 = ble_ke_msg_send_basic(ra_102, s0_24, a1, 263, a2, a2, a3, s3, dwLoc10, dwArg18, dwArgF8, out t1_197, out s0_198, out s1_15, out a0_199, out a3_200, out a4_201, out a6_202, out a7_203, out s2_17, out s3, out s4_204, out mstatus_205);
				a1_100.u0 = 0x00;
				s0_54.u0 = 0x01;
				goto l23038A96;
			}
			a1_100.u0 = 0x00;
l23038AB0:
			s0_54.u0 = 0x00;
l23038A96:
			llc_common_cmd_complete_send(ra_102, s0_54, s2_17, a1_100, (word32) *s1_15, s2_17, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8);
			return;
		}
	}
	a1_100.u0 = 0x12;
	goto l23038AB0;
}

// 23038AC0: void hci_le_rem_con_param_req_neg_reply_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void hci_le_rem_con_param_req_neg_reply_cmd_handler(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 s3_109 = a3;
	Eq_2 a0_23;
	word32 s8_203;
	word32 a4_202;
	word32 a1_201;
	Eq_2 s0_104;
	Eq_2 ra_103 = ble_ke_state_get(ra, a1, a2, out s0_104, out a0_23, out a1_201, out a4_202, out s8_203);
	Eq_2 a1_121 = 0x0C;
	if ((a0_23 & 0x0F) != 0x0F)
	{
		s2 = a0_23;
		if ((a0_23 & 2) != 0x00)
		{
			Eq_2 a0_36 = (word32) *s0_104;
			if ((word32) *((char *) *((char *) &g_t42026428 + a0_36 * 0x04) + 0x00A4) == 0x02)
			{
				a1_121.u0 = 0x12;
				if ((word32) *((word32) s0_104 + 2) == 59)
				{
					Eq_2 s0_58;
					Eq_2 s1_59;
					ui32 s2_60;
					Eq_2 s4_62;
					Eq_2 s0_86;
					word32 a5_210;
					word32 a4_209;
					word32 a2_208;
					word32 a0_207;
					word32 s1_206;
					word32 s5_205;
					word32 s3_204;
					word32 s2_211;
					word32 s3_212;
					word32 s4_213;
					word32 mstatus_214;
					Eq_2 ra_77 = ble_ke_state_set(llc_util_clear_operation_ptr(ra_103, s0_104, 0x42026428, a0_36, a0_23, a3, a2, s5, out s0_58, out s1_59, out s2_60, out s3_204, out s4_62, out s5_205), s0_58, s1_59, s4_62, s2_60 & 0x00FD, dwArgE8, out s0_86, out s1_206, out a0_207, out a2_208, out a4_209, out a5_210, out s2_211, out s3_212, out s4_213, out mstatus_214);
					ui32 a5_87 = (word32) *s0_86;
					Eq_2 s1_90 = null[a5_87];
					((Eq_582911[]) 0x00A4)[a5_87] = (Eq_582911) 0x00;
					word32 s1_215;
					word32 s4_216;
					ra_103 = llc_llcp_reject_ind_pdu_send(ra_77, s0_86, s1_90, (word32) *s0_86, 0x0F, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_104, out s1_215, out s2, out s3_109, out s4_216, out s5);
					a1_121.u0 = 0x00;
				}
			}
		}
	}
	llc_common_cmd_complete_send(ra_103, s0_104, s3_109, a1_121, (word32) *s0_104, s2, s3_109, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8);
}

// 23038B64: void hci_le_rem_con_param_req_reply_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArg0128)
void hci_le_rem_con_param_req_reply_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArg0128)
{
	Eq_2 s2_164;
	Eq_2 s5_167 = a2;
	Eq_2 s7_118 = a3;
	ui32 a0_33;
	word32 a1_412;
	word32 a4_413;
	word32 s8_414;
	Eq_2 s0_162;
	Eq_2 ra_161 = ble_ke_state_get(ra, a1, a2, out s0_162, out a0_33, out a1_412, out a4_413, out s8_414);
	Eq_2 s4_166 = 0x0C;
	s2_164 = s2;
	if ((a0_33 & 0x0F) != 0x0F)
	{
		s2_164 = s2;
		if ((a0_33 & 2) != 0x00)
		{
			Eq_2 a0_46 = (word32) *s0_162;
			s3 = *((char *) &g_t42026428 + a0_46 * 0x04);
			s2_164.u0 = 0x42026428;
			word32 s9_54 = (word32) *((word32) s3 + 0x00A4);
			if (s9_54 == 0x02)
			{
				Eq_2 s1_55 = *((word32) s3 + 4);
				if (lld_get_mode(a0_46) == 0x03)
				{
					*s1_55 = (byte) s9_54;
					up32 a4_172 = (word32) *((word32) s0_162 + 2);
					up32 a5_173 = (word32) *((word32) s1_55 + 0x0E);
					if (a4_172 < a5_173)
						a5_173 = a4_172;
					*((word32) s1_55 + 0x0E) = (word16) a5_173;
					up32 a4_179 = (word32) *((word32) s0_162 + 4);
					up32 a5_180 = (word32) *((word32) s1_55 + 16);
					if (a5_180 < a4_179)
						a5_180 = a4_179;
					((word32) s1_55 + 16)->u2 = (word16) a5_180;
					*((word32) s1_55 + 6) = (word16) (word32) *((word32) s0_162 + 6);
					up32 a4_188 = (word32) *((word32) s0_162 + 8);
					up32 a5_189 = (word32) *((word32) s1_55 + 8);
					if (a5_189 < a4_188)
						a5_189 = a4_188;
					((word32) s1_55 + 8)->u2 = (word16) a5_189;
					Eq_2 s1_210;
					Eq_2 s0_213;
					word32 s2_232;
					word32 a5_434;
					word32 s4_435;
					word32 mstatus_436;
					word32 s1_430;
					word32 a0_431;
					word32 a2_432;
					word32 a4_433;
					word32 a3_426;
					word32 a4_427;
					word32 a5_428;
					word32 mstatus_429;
					word32 tp_422;
					word32 t1_423;
					word32 a0_424;
					word32 a2_425;
					ra_161 = ble_ke_state_set(ble_ke_msg_send(ra_161, s0_162, s1_55, s1_55, s2, out tp_422, out t1_423, out s0_213, out s1_210, out a0_424, out a2_425, out a3_426, out a4_427, out a5_428, out mstatus_429), s0_213, s1_210, a2, a0_33 & 0x00FD, dwArgD8, out s0_162, out s1_430, out a0_431, out a2_432, out a4_433, out a5_434, out s2_232, out s3, out s4_435, out mstatus_436);
					((word32) s3 + 0x00A4)->u0 = 0x00;
					s2_164 = s2_232 + ((word32) (*s0_162) << 2);
					*((word32) *s2_164.u0 + 4) = 0x00;
					s4_166.u0 = 0x00;
				}
				else
				{
					s4_166.u0 = 0x00;
					if (lld_get_mode((word32) *s0_162) == 0x04)
					{
						*((word32) s1_55 + 0x0E) = (word16) (word32) *((word32) s0_162 + 2);
						((word32) s1_55 + 16)->u2 = (word16) (word32) *((word32) s0_162 + 4);
						*((word32) s1_55 + 6) = (word16) (word32) *((word32) s0_162 + 6);
						((word32) s1_55 + 8)->u2 = (word16) (word32) *((word32) s0_162 + 8);
						Eq_2 s1_84;
						word32 s8_87;
						word32 s2_416;
						word32 s4_417;
						word32 a0_415;
						Eq_2 s0_83 = lld_con_param_rsp(s1_55, out s1_84, out a0_415, out s2_416, out s4_417, out s8_87);
						*((word32) s3 + 0x00A4) = (byte) s8_87;
						Eq_2 s0_109;
						Eq_2 s1_110;
						Eq_2 s2_113;
						Eq_2 s3_114;
						Eq_2 s4_115;
						Eq_2 s5_116;
						Eq_2 s6_117;
						Eq_2 s0_140;
						Eq_2 s1_141;
						Eq_2 s2_142;
						Eq_2 s3_143;
						Eq_2 s4_144;
						Eq_2 s5_145;
						word32 s1_421;
						word32 mstatus_420;
						word32 a5_418;
						word32 s6_419;
						ra_161 = llc_util_clear_operation_ptr(ble_ke_timer_set(llc_llcp_con_param_rsp_pdu_send(ra_161, s0_83, s1_84, s1_84, dwLoc18, dwLoc08, dwArg18, dwArg28, dwArg38, dwArg3C, dwArg48, ra, dwArg80, dwArg84, dwArg8C, dwArgA8, out s0_109, out s1_110, out s2_113, out s3_114, out s4_115, out s5_116, out s6_117, out s7_118), s0_109, s1_110, 258, s5_116, 0x00FFFFA0, s2_113, s3_114, s4_115, s5_116, s6_117, s2, dwArg78, dwArgD8, out s0_140, out s1_141, out a5_418, out s2_142, out s3_143, out s4_144, out s5_145, out s6_419, out mstatus_420), s0_140, s1_141, (word32) *s0_140, s2_142, s3_143, s4_144, s5_145, out s0_162, out s1_421, out s2_164, out s3, out s4_166, out s5_167);
					}
				}
			}
		}
	}
	llc_common_cmd_complete_send(ra_161, s0_162, s7_118, s4_166, (word32) *s0_162, s2_164, s3, s5_167, s2, s0, dwArg08, dwArgE8);
	0x00 = dwArg0128;
}

// 23038CC6: void hci_le_ltk_req_neg_reply_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArgF8, Stack word32 dwArg0128)
void hci_le_ltk_req_neg_reply_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArgF8, word32 dwArg0128)
{
	Eq_2 s3_114 = a3;
	Eq_2 s2_113 = a1;
	ui32 a0_21;
	Eq_2 a1_22;
	word32 a4_263;
	word32 s8_264;
	word32 s0_262;
	Eq_2 ra_108 = ble_ke_state_get(ra, s0, a2, out s0_262, out a0_21, out a1_22, out a4_263, out s8_264);
	Eq_2 s0_109 = 0x0C;
	if ((a0_21 & 0x0F) != 0x0F && (a0_21 & 2) != 0x00)
	{
		Eq_2 a0_34 = (word32) *a1;
		struct Eq_177021 * a4_39 = *((char *) &g_t42026428 + a0_34 * 0x04);
		struct Eq_177066 * s1_41[] = &g_t42026428;
		if (dwArg34 == 0x09)
		{
			ui32 s0_44 = (word32) a4_39->b00A5;
			Eq_2 s0_45 = s0_44 & 0x10;
			if ((s0_44 & 0x10) != 0x00)
			{
				word32 s4_267;
				word32 s0_265;
				word32 s1_266;
				ra_108 = llc_llcp_terminate_ind_pdu_send(ra_108, a0_34, a1, dwLoc18, dwLoc08, dwArg18, dwArg28, dwArg38, dwArg3C, dwArg48, ra, dwArg80, dwArg84, dwArg8C, dwArgA8, dwArgF8, out s0_265, out s1_266, out s2_113, out s3_114, out s4_267, out s5);
				s0_109.u0 = 0x00;
			}
			else
			{
				if ((a0_21 & 0x01) != 0x00)
				{
					word32 s6_274;
					word32 s4_272;
					word32 s5_273;
					word32 s3_271;
					word32 a5_270;
					ra_108 = ble_ke_timer_set(ra_108, s0_44 & 0x10, 0x42026428, 258, a1_22, 0x00FFFFA0, a1, a3, s4, s5, s6, s2, dwArg78, dwArgD8, out s0_45, out s1_41, out a5_270, out s2_113, out s3_271, out s4_272, out s5_273, out s6_274, out mstatus);
				}
				s1_41[(word32) *s2_113]->b00A4 = 0x0D;
				__csrrs(mstatus, 0x00);
				__csrrc(mstatus, 0x08);
				Eq_2 s1_89 = *(union Eq_2 *) 0x0D;
				*(byte *) 0xB2 = (byte) ((word32) *(byte *) 0xB2 & ~0x08);
				__csrrw(mstatus, 0x00);
				word32 s4_269;
				word32 s1_268;
				ra_108 = llc_llcp_reject_ind_pdu_send(ra_108, s0_45, s1_89, (word32) *s2_113, 0x03, dwLoc28, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg74, dwArg90, dwArg94, dwArg9C, dwArgB8, out s0_109, out s1_268, out s2_113, out s3_114, out s4_269, out s5);
			}
		}
	}
	llc_common_cmd_complete_send(ra_108, s0_109, s3_114, s0_109, (word32) *s2_113, s2_113, s3_114, s5, s2, s0, dwArg08, dwArgE8);
	0x00 = dwArg0128;
}

