pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23038D92: void hci_le_ltk_req_reply_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 uint16) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArgE8, Stack word32 dwArgF8, Stack word32 dwArg0128)
void hci_le_ltk_req_reply_cmd_handler(Eq_2 ra, Eq_2 s0, uint16 * a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArgE8, word32 dwArgF8, word32 dwArg0128)
{
	uint16 * s1_11 = a1;
	Eq_2 s2_102 = a3;
	ui32 a0_23;
	word32 s8_227;
	word32 a4_226;
	word32 a1_225;
	Eq_2 s0_135;
	Eq_2 ra_126 = ble_ke_state_get(ra, s0, a2, out s0_135, out a0_23, out a1_225, out a4_226, out s8_227);
	Eq_2 a1_133 = 0x0C;
	if ((a0_23 & 0x0F) != 0x0F && (a0_23 & 0x02) != 0x00)
	{
		s0_135.u0 = 0x42026428;
		if ((word32) *((char *) *((char *) &g_t42026428 + (word32) (*a1) * 0x04) + 0x00A4) == 0x09)
		{
			word32 a0_47;
			word32 a3_50;
			word32 s0_57;
			word32 s1_58;
			word32 s2_59;
			word32 s1_74;
			word32 s2_75;
			word32 a1_76;
			word32 ra_77;
			word32 s0_78;
			word32 s3_79;
			struct Eq_177196 * s4_80;
			word32 a3_81;
			word32 s5_191;
			g_ptr4200F3D0();
			<anonymous> * a5_96 = s4_80->ptr03D0;
			struct Eq_177205 * sp_98;
			Eq_2 s1_101;
			Eq_2 ra_104;
			Eq_2 s0_105;
			a5_96();
			word32 tp_237;
			word32 t1_238;
			word32 s0_239;
			word32 a0_240;
			word32 a2_241;
			word32 a3_242;
			word32 a4_243;
			word32 a5_244;
			word32 mstatus_245;
			ra_126 = ble_ke_msg_send(ra_104, s0_105, s1_101, s3, sp_98->t0010, out tp_237, out t1_238, out s0_239, out s1_11, out a0_240, out a2_241, out a3_242, out a4_243, out a5_244, out mstatus_245);
			ui32 a5_131 = (word32) *s1_11;
			s0_135 = null[a5_131];
			((Eq_582917[]) 0x00A4)[a5_131].b0000 = 0x0A;
			a1_133.u0 = 0x00;
		}
	}
	llc_common_cmd_complete_send(ra_126, s0_135, s2_102, a1_133, (word32) *s1_11, s2_102, s3, s5, s2, s0, dwArg08, dwArgE8);
	0x00 = dwArg0128;
}

// 23038E46: void hci_disconnect_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack word32 dwArg0108)
void hci_disconnect_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgF8, word32 dwArg0108)
{
	Eq_2 s1_11 = a1;
	Eq_2 s2_17 = a3;
	ui32 a0_18;
	word32 s8_264;
	word32 a4_263;
	word32 a1_262;
	word32 s0_261;
	Eq_2 ra_22 = ble_ke_state_get(ra, s0, a2, out s0_261, out a0_18, out a1_262, out a4_263, out s8_264);
	Eq_2 a1_28 = 0x0C;
	if ((a0_18 & 0x0F) != 0x0F)
	{
		word32 a1_34 = (word32) *((word32) a1 + 2);
		int32 a5_39;
		for (a5_39 = 0x00; a5_39 != 0x07; ++a5_39)
		{
			if ((word32) (fp + ~0x17 + a5_39) == a1_34)
			{
				word32 s4_266;
				word32 s0_265;
				ra_22 = llc_llcp_terminate_ind_pdu_send(ra_22, (word32) *a1, a3, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg74, dwArg90, dwArg94, dwArg9C, dwArgB8, dwArg0108, out s0_265, out s1_11, out s2_17, out s3, out s4_266, out s5);
				a1_28.u0 = 0x00;
				goto l23038EA8;
			}
		}
		a1_28.u0 = 0x12;
	}
l23038EA8:
	Eq_2 a2_84 = (word32) *s1_11;
	if ((word32) *((char *) *((char *) &g_t42026428 + a2_84 * 0x04) + 0x00A2) == 0x00)
	{
		struct Eq_177375 * s0_113[];
		word32 s4_270;
		word32 s5_271;
		word32 a2_267;
		word32 s2_268;
		word32 s3_269;
		llc_common_cmd_status_send(ra_22, 0x42026428, s1_11, s2_17, a1_28, a2_84, s2_17, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_113, out s1_11, out a2_267, out s2_268, out s3_269, out s4_270, out s5_271);
		s0_113[(word32) *s1_11]->b00A2 = 0x01;
	}
	((Eq_582919[]) 0x00A2)[(word32) *s1_11] = (Eq_582919) 0x00;
}

// 23038EF8: void hci_le_start_enc_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 uint16) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg18, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void hci_le_start_enc_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, uint16 * a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 dwArg18, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 a2_168;
	Eq_2 a1_169;
	Eq_2 a0_25;
	word32 s8_334;
	word32 a4_333;
	word32 a1_332;
	Eq_2 s0_175;
	Eq_2 ra_29 = ble_ke_state_get(ra, s0, a2, out s0_175, out a0_25, out a1_332, out a4_333, out s8_334);
	if ((a0_25 & 0x0F) == 0x0F)
		a2_168 = (word32) *a1;
	else
	{
		s2 = a0_25;
		if ((a0_25 & 4) != 0x00)
		{
			a2_168 = (word32) *a1;
			a1_169.u0 = 58;
			goto l23038F36;
		}
		if ((a0_25 & 1) != 0x00)
			return;
		Eq_2 a0_41 = lld_get_mode(a2 >> 0x08);
		s1 = a2 >> 0x08;
		a2_168 = (word32) *a1;
		if (a0_41 == 0x03)
		{
			s0_175.u0 = 0x42026428;
			if (((word32) *((char *) *((char *) &g_t42026428 + a2_168 * 0x04) + 0x0069) & 0x01) != 0x00)
			{
				Eq_2 s0_65;
				Eq_2 s1_66;
				ui32 s2_69;
				Eq_2 s3_70;
				ui32 s1_94;
				ui32 s2_95;
				Eq_2 s3_96;
				Eq_2 s0_102;
				struct Eq_151647 * a0_107;
				struct Eq_177478 * a5_112;
				ptr32 mstatus_114;
				Eq_2 s3_118;
				Eq_2 s0_124;
				word32 a2_342;
				word32 s4_343;
				word32 s5_344;
				word32 a0_345;
				word32 a2_346;
				word32 a4_347;
				word32 a5_348;
				word32 s4_349;
				word32 mstatus_350;
				word32 s1_351;
				word32 a2_352;
				word32 a4_353;
				word32 s2_354;
				uint16 * s4_119;
				Eq_2 ra_115 = ble_ke_state_set(ble_ke_state_set(llc_common_cmd_status_send(ra_29, 0x42026428, a2 >> 0x08, a3, 0x00, a2_168, a0_25, a2, a3, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_65, out s1_66, out a2_342, out s2_69, out s3_70, out s4_343, out s5_344), s0_65, s1_66, s3_70, (s2_69 | 1) & 0x00FF, dwArgE8, out s0_102, out s1_94, out a0_345, out a2_346, out a4_347, out a5_348, out s2_95, out s3_96, out s4_349, out mstatus_350), s0_102, s1_94 << 2, s3_96, (s2_95 | 5) & 0x00FF, dwArgE8, out s0_124, out s1_351, out a0_107, out a2_352, out a4_353, out a5_112, out s2_354, out s3_118, out s4_119, out mstatus_114);
				Eq_2 s1_125 = a5_112->t0000;
				a5_112->b00A3 = 0x0A;
				Eq_2 s2_128 = __csrrs(mstatus_114, 0x00);
				__csrrc(mstatus_114, 0x08);
				ui32 a4_130 = (word32) a5_112->b00A5;
				*((word32) a0_107->t0010 + 0x00A5) = (byte) (a4_130 | 4);
				struct Eq_151647 * a0_134 = lld_util_get_tx_pkt_cnt(a0_107);
				__csrrw(mstatus_114, 0x00);
				if (a0_134 != null)
					(a4_130 | 4)->w005C = (word16) ((word32) (a4_130 | 4)->w005C | 4);
				else
				{
					word32 t1_355;
					word32 s0_356;
					word32 s1_357;
					word32 a0_358;
					word32 a3_359;
					word32 a4_360;
					word32 a6_361;
					word32 a7_362;
					word32 s2_363;
					word32 s3_364;
					word32 mstatus_365;
					ble_ke_msg_send_basic(ra_115, s0_124, s1_125, 262, s3_118, s3_118, s2_128, s3_118, dwLoc10, dwArg18, dwArgF8, out t1_355, out s0_356, out s1_357, out a0_358, out a3_359, out a4_360, out a6_361, out a7_362, out s2_363, out s3_364, out s4_119, out mstatus_365);
				}
				((uint16 *[]) 8)[(word32) *s4_119] = s4_119;
				return;
			}
		}
	}
	a1_169.u0 = 0x0C;
l23038F36:
	word32 s0_335;
	word32 s1_336;
	word32 a2_337;
	word32 s3_339;
	word32 s2_338;
	word32 s4_340;
	word32 s5_341;
	llc_common_cmd_status_send(ra_29, s0_175, s1, a3, a1_169, a2_168, s2, a2, a3, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_335, out s1_336, out a2_337, out s2_338, out s3_339, out s4_340, out s5_341);
}

// 23039006: void hci_le_rd_rem_used_feats_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void hci_le_rd_rem_used_feats_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 s2_118;
	Eq_2 s1_117 = a1;
	Eq_2 s3_119 = a2;
	Eq_2 s4_120 = a3;
	ui32 a0_25;
	word32 s0_289;
	word32 a1_290;
	word32 a4_291;
	word32 s8_292;
	Eq_2 ra_115 = ble_ke_state_get(ra, s0, a2, out s0_289, out a0_25, out a1_290, out a4_291, out s8_292);
	Eq_2 s0_116 = 0x42026428;
	if ((a0_25 & 0x0F) != 0x0F)
	{
		if (((word32) *((char *) *((char *) &g_t42026428 + (word32) (*a1) * 0x04) + 92) & 0x01) == 0x00)
		{
			if ((a0_25 & 5) != 0x00)
				return;
			Eq_2 s1_59;
			struct Eq_177730 * s0_67[];
			word32 a0_293;
			word32 a2_294;
			word32 a4_295;
			word32 a5_296;
			word32 s2_297;
			word32 s3_298;
			word32 s4_299;
			word32 mstatus_300;
			Eq_2 ra_58 = ble_ke_state_set(ra_115, 0x42026428, a1, a2, (a0_25 | 1) & 0x00FF, dwArgE8, out s0_67, out s1_59, out a0_293, out a2_294, out a4_295, out a5_296, out s2_297, out s3_298, out s4_299, out mstatus_300);
			s0_67[(word32) *s1_59]->b00A3 = 0x01;
			Eq_2 s0_85;
			Eq_2 s1_86;
			Eq_2 s2_89;
			Eq_2 s3_90;
			Eq_2 s4_91;
			Eq_2 s5_92;
			Eq_2 s6_93;
			word32 a5_301;
			word32 s6_302;
			word32 mstatus_303;
			ra_115 = ble_ke_timer_set(llc_llcp_feats_req_pdu_send(ra_58, s1_59, (word32) *s1_59, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_85, out s1_86, out s2_89, out s3_90, out s4_91, out s5_92, out s6_93), s0_85, s1_86, 258, s3_90, 0x00FFFFA0, s2_89, s3_90, s4_91, s5_92, s6_93, dwLoc10, dwArg88, dwArgE8, out s0_116, out s1_117, out a5_301, out s2_118, out s3_119, out s4_120, out s5, out s6_302, out mstatus_303);
		}
		else
			s2_118.u0 = 0x00;
	}
	else
		s2_118.u0 = 0x0C;
	struct Eq_177781 * a2_141;
	uint16 * s1_150;
	word32 s0_308;
	word32 s2_309;
	word32 s3_310;
	word32 s4_311;
	word32 s5_312;
	Eq_2 ra_148 = llc_common_cmd_status_send(ra_115, s0_116, s1_117, s4_120, s2_118, (word32) *s1_117, s2_118, s3_119, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_308, out s1_150, out a2_141, out s2_309, out s3_310, out s4_311, out s5_312);
	Eq_2 a1_166 = (word32) *s1_150;
	Eq_2 s0_169 = a2_141->t0000;
	if (((word32) a2_141->w005C & 0x01) != 0x00)
	{
		word32 s0_304;
		word32 s1_305;
		word32 s2_306;
		word32 s3_307;
		llc_feats_rd_event_send(ra_148, s0_169, 0x00, a1_166, (char *) &a2_141->w005C + 0x0D, 0x00, dwLoc20, s4, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg28, dwArgE8, out s0_304, out s1_305, out s2_306, out s3_307);
	}
}

