pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230390CE: void hci_le_rd_chnl_map_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg0118)
void hci_le_rd_chnl_map_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg0118)
{
	Eq_2 a0_23;
	ui32 a0_44;
	word32 a1_45;
	word32 a7_164;
	word32 a6_163;
	word32 a4_162;
	word32 a3_161;
	word32 a2_160;
	word32 a1_159;
	word32 s0_158;
	word32 s8_165;
	word32 mstatus_166;
	word32 a4_167;
	word32 s8_168;
	Eq_2 s0_49;
	uint16 * s1_34;
	Eq_2 s2_35;
	Eq_2 s3_36;
	Eq_2 s4_37;
	Eq_2 ra_48 = ble_ke_state_get(ble_ke_msg_alloc(ra, s0, a1, 0x00FFF801, (word32) *a1, 0x02000015, 0x0A, a2, s3, dwArg0118, out s0_158, out s1_34, out a0_23, out a1_159, out a2_160, out a3_161, out a4_162, out a6_163, out a7_164, out s2_35, out s3_36, out s4_37, out s8_165, out mstatus_166), a0_23, s2_35, out s0_49, out a0_44, out a1_45, out a4_167, out s8_168);
	word32 a5_54 = 0x0C;
	if ((a0_44 & 0x0F) != 0x0F)
	{
		<anonymous> * a5_61 = g_ptr4200F3D0;
		a5_61();
		a5_54 = 0x00;
	}
	*s0_49 = (byte) a5_54;
	*((word32) s0_49 + 2) = (word16) (word32) *s1_34;
	word32 tp_169;
	word32 s0_170;
	word32 s1_171;
	word32 a0_172;
	word32 a2_173;
	word32 a3_174;
	word32 a4_175;
	word32 s2_176;
	word32 s3_177;
	word32 s4_178;
	word32 s5_179;
	word32 s6_180;
	word32 s7_181;
	word32 s9_182;
	word32 s10_183;
	word32 mstatus_184;
	hci_send_2_host(ra_48, s0_49, s0_49, s2_35, s3_36, s4_37, s5, dwArg00, dwArg04, dwArg28, out tp_169, out s0_170, out s1_171, out a0_172, out a2_173, out a3_174, out a4_175, out s2_176, out s3_177, out s4_178, out s5_179, out s6_180, out s7_181, out s9_182, out s10_183, out mstatus_184);
	0x00 = dwArg38;
}

// 2303914A: void hci_rd_auth_payl_to_cmd_handler(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg0118)
void hci_rd_auth_payl_to_cmd_handler(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg0118)
{
	Eq_2 a0_17;
	Eq_2 s0_22;
	Eq_2 a0_32;
	ui32 s1_43;
	Eq_2 s2_44;
	Eq_2 s3_45;
	Eq_2 s4_46;
	word32 a4_131;
	word32 a3_130;
	word32 a2_129;
	word32 a1_128;
	word32 s8_127;
	word32 a4_126;
	word32 a1_125;
	word32 a6_132;
	word32 a7_133;
	word32 s8_134;
	word32 mstatus_135;
	Eq_2 s0_42;
	Eq_2 ra_41 = ble_ke_msg_alloc(ble_ke_state_get(ra, a2, a2, out s0_22, out a0_17, out a1_125, out a4_126, out s8_127), s0_22, a0_17, 0x00FFF801, (word32) *a1, 0x00FFFC7B, 0x06, a1, s3, dwArg0118, out s0_42, out s1_43, out a0_32, out a1_128, out a2_129, out a3_130, out a4_131, out a6_132, out a7_133, out s2_44, out s3_45, out s4_46, out s8_134, out mstatus_135);
	if ((s1_43 & 0x0F) == 0x0F)
		*a0_32 = 0x0C;
	else
	{
		*a0_32 = 0x00;
		s0_42 = g_t42026428;
		*((word32) a0_32 + 4) = (word16) (word32) g_w42026480;
	}
	*((word32) a0_32 + 2) = (word16) (word32) *s2_44;
	word32 tp_136;
	word32 s0_137;
	word32 s1_138;
	word32 a0_139;
	word32 a2_140;
	word32 a3_141;
	word32 a4_142;
	word32 s2_143;
	word32 s3_144;
	word32 s4_145;
	word32 s5_146;
	word32 s6_147;
	word32 s7_148;
	word32 s9_149;
	word32 s10_150;
	word32 mstatus_151;
	hci_send_2_host(ra_41, s0_42, a0_32, s2_44, s3_45, s4_46, s5, dwArg00, dwArg04, dwArg28, out tp_136, out s0_137, out s1_138, out a0_139, out a2_140, out a3_141, out a4_142, out s2_143, out s3_144, out s4_145, out s5_146, out s6_147, out s7_148, out s9_149, out s10_150, out mstatus_151);
	0x00 = dwArg38;
}

// 230391BA: void hci_rd_rssi_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg0118)
void hci_rd_rssi_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg0118)
{
	Eq_2 a0_22;
	uint16 * s1_33;
	Eq_2 s2_34;
	Eq_2 s3_35;
	Eq_2 s4_36;
	ui32 a0_43;
	Eq_2 s0_48;
	word32 a6_133;
	word32 a7_134;
	word32 a4_132;
	word32 a3_131;
	word32 a2_130;
	word32 a1_129;
	word32 s0_128;
	word32 s8_135;
	word32 mstatus_136;
	word32 a1_137;
	word32 a4_138;
	word32 s8_139;
	Eq_2 ra_47 = ble_ke_state_get(ble_ke_msg_alloc(ra, s0, a1, 0x00FFF801, (word32) *a1, 0x01000405, 0x06, a2, s3, dwArg0118, out s0_128, out s1_33, out a0_22, out a1_129, out a2_130, out a3_131, out a4_132, out a6_133, out a7_134, out s2_34, out s3_35, out s4_36, out s8_135, out mstatus_136), a0_22, s2_34, out s0_48, out a0_43, out a1_137, out a4_138, out s8_139);
	if ((a0_43 & 0x0F) == 0x0F)
	{
		*s0_48 = 0x0C;
		*((word32) s0_48 + 4) = 0x00;
	}
	else
	{
		*s0_48 = 0x00;
		*((word32) s0_48 + 4) = (byte) (int32) *((char *) *((char *) &g_t42026428 + (word32) (*s1_33) * 0x04) + 0x0068);
	}
	*((word32) s0_48 + 2) = (word16) (word32) *s1_33;
	word32 tp_140;
	word32 s0_141;
	word32 s1_142;
	word32 a0_143;
	word32 a2_144;
	word32 a3_145;
	word32 a4_146;
	word32 s2_147;
	word32 s3_148;
	word32 s4_149;
	word32 s5_150;
	word32 s6_151;
	word32 s7_152;
	word32 s9_153;
	word32 s10_154;
	word32 mstatus_155;
	hci_send_2_host(ra_47, s0_48, s0_48, s2_34, s3_35, s4_36, s5, dwArg00, dwArg04, dwArg28, out tp_140, out s0_141, out s1_142, out a0_143, out a2_144, out a3_145, out a4_146, out s2_147, out s3_148, out s4_149, out s5_150, out s6_151, out s7_152, out s9_153, out s10_154, out mstatus_155);
	0x00 = dwArg38;
}

// 23039232: void hci_rd_tx_pwr_lvl_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg0118)
void hci_rd_tx_pwr_lvl_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg0118)
{
	word32 a5_114;
	Eq_2 a0_22;
	word32 a2_24;
	ui32 a0_43;
	word32 a4_236;
	word32 s8_237;
	word32 s8_233;
	word32 a1_235;
	word32 mstatus_234;
	word32 a4_230;
	word32 a7_232;
	word32 a6_231;
	word32 s0_227;
	word32 a3_229;
	word32 a1_228;
	struct Eq_178230 * s1_120;
	Eq_2 s0_112;
	Eq_2 s2_131;
	Eq_2 s3_103;
	Eq_2 s4_107;
	Eq_2 ra_128 = ble_ke_state_get(ble_ke_msg_alloc(ra, s0, a1, 0x00FFF801, (word32) *a1, 0x00FFFC2D, 0x06, a2, s3, dwArg0118, out s0_227, out s1_120, out a0_22, out a1_228, out a2_24, out a3_229, out a4_230, out a6_231, out a7_232, out s2_131, out s3_103, out s4_107, out s8_233, out mstatus_234), a0_22, s2_131, out s0_112, out a0_43, out a1_235, out a4_236, out s8_237);
	if ((a0_43 & 0x0F) != 0x0F)
	{
		word32 a0_111;
		*s0_112 = 0x00;
		word32 a5_54 = (word32) s1_120->b0002;
		if (a5_54 != 0x00)
		{
			if (a5_54 != 0x01)
			{
				a5_114 = 0x12;
l23039266:
				*s0_112 = (byte) a5_114;
				*((word32) s0_112 + 4) = 0x00;
				goto l230392B2;
			}
			Eq_2 a5_88 = *(union Eq_2 *) 0x15;
			(*(<anonymous> *) 0x01)();
		}
		else
		{
			<anonymous> * a5_64 = g_ptr42025740;
			a5_64();
		}
		*((word32) s0_112 + 4) = (byte) a0_111;
l230392B2:
		*((word32) s0_112 + 2) = (word16) (word32) s1_120->w0000;
		word32 s2_245;
		word32 s4_247;
		word32 s3_246;
		word32 a2_242;
		word32 a4_244;
		word32 a3_243;
		word32 s0_239;
		word32 a0_241;
		word32 s1_240;
		word32 tp_238;
		word32 s5_248;
		word32 s6_249;
		word32 s7_250;
		word32 s9_251;
		word32 s10_252;
		word32 mstatus_253;
		hci_send_2_host(ra_128, s0_112, s0_112, s2_131, s3_103, s4_107, s5, dwArg00, dwArg04, dwArg28, out tp_238, out s0_239, out s1_240, out a0_241, out a2_242, out a3_243, out a4_244, out s2_245, out s3_246, out s4_247, out s5_248, out s6_249, out s7_250, out s9_251, out s10_252, out mstatus_253);
		0x00 = dwArg38;
	}
	else
	{
		a5_114 = 0x0C;
		goto l23039266;
	}
}

