pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230392E2: void hci_le_con_update_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void hci_le_con_update_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0128)
{
	Eq_2 s2_127;
	Eq_2 a1_160;
	Eq_2 s3_128 = a3;
	ui32 a0_25;
	word32 a4_374;
	word32 s8_375;
	word32 a1_373;
	Eq_2 s0_159;
	Eq_2 ra_155 = ble_ke_state_get(ra, a1, a2, out s0_159, out a0_25, out a1_373, out a4_374, out s8_375);
	if ((a0_25 & 0x0F) == 0x0F)
	{
		s1.u0 = 0x00FF;
		a1_160.u0 = 0x0C;
		s2_127 = s2;
		goto l23039434;
	}
	Eq_2 a0_38 = (word32) *s0_159;
	s2_127 = *((char *) &g_t42026428 + a0_38 * 0x04);
	s5 = *((word32) s2_127 + 16);
	if (lld_get_mode(a0_38) == 0x04)
	{
		if (((word32) *((word32) s2_127 + 92) & 0x01) != 0x00)
		{
			ui32 a1_52 = (word32) *((word32) s2_127 + 0x0069);
			s1.u0 = 0x1A;
			a1_160 = a1_52 & 0x02;
			if ((a1_52 & 0x02) == 0x00)
				goto l23039434;
		}
		if ((word32) *((word32) s2_127 + 166) == 0x00)
		{
			s1.u0 = 0x1A;
			goto l23039428;
		}
	}
	uint32 a0_62 = (word32) *((word32) s0_159 + 2);
	uint32 a4_63 = (word32) *((word32) s0_159 + 4);
	if (a4_63 >= a0_62)
	{
		uint32 t1_64 = (word32) *((word32) s0_159 + 0x0A);
		uint32 a7_65 = (word32) *((word32) s0_159 + 0x0C);
		if (a7_65 >= t1_64 && (a4_63 <= 0x00FFFC80 && a0_62 > 0x05))
		{
			Eq_178478 a3_69 = (word32) *((word32) s0_159 + 6);
			if (a3_69 <= 499)
			{
				ui32 a1_71 = (word32) *((word32) s0_159 + 8);
				if ((word32) (word16) (a1_71 + -0x0A) <= 0x00FFFC76 && ((word32) a3_69.u1 + 1) + a4_63 < a1_71 << 0x02)
				{
					uint32 a5_83 = (word32) *((word32) s5 + 0x0078);
					if (a5_83 >> 1 >= a0_62 && a4_63 >= a5_83 >> 1)
					{
						uint32 a5_88 = (word32) *((word32) *((word32) s2_127 + 16) + 18);
						if (a5_88 >> 0x04E2 >= t1_64 && (a7_65 >= a5_88 >> 0x04E2 && (word32) (*((word32) s2_127 + 84)) == a1_71))
						{
							s1.u0 = 0x00;
							if ((word32) *((word32) s5 + 94) + ~0x00 == a3_69)
							{
l23039428:
								a1_160.u0 = 0x00;
l23039434:
								Eq_2 s0_198;
								Eq_2 s1_199;
								Eq_2 s3_203;
								Eq_2 s4_204;
								Eq_2 s5_205;
								word32 s2_377;
								word32 a2_376;
								Eq_2 ra_197 = llc_common_cmd_status_send(ra_155, s0_159, s1, s3_128, a1_160, (word32) *s0_159, s2_127, s3_128, s5, s2, s0, dwArg08, dwArgE8, out s0_198, out s1_199, out a2_376, out s2_377, out s3_203, out s4_204, out s5_205);
								if (llm_util_check_evt_mask(0x02) != 0x00 && s1_199 != 0x00FF)
								{
									word32 s0_396;
									word32 s2_398;
									word32 s4_400;
									word32 s5_401;
									word32 s3_399;
									word32 s1_397;
									llc_con_update_complete_send(ra_197, s0_198, s1_199, (word32) *s0_198, s4_204, s3_203, s5_205, s2, s0, dwArg08, dwArgE8, out s0_396, out s1_397, out s2_398, out s3_399, out s4_400, out s5_401);
								}
								0x00 = dwArg0128;
								return;
							}
						}
					}
					Eq_2 a0_115;
					Eq_2 s0_125;
					word32 a3_381;
					word32 a4_382;
					word32 a7_384;
					word32 s8_386;
					word32 mstatus_387;
					word32 s4_385;
					word32 a6_383;
					word32 a1_379;
					word32 a2_380;
					word32 s1_378;
					Eq_2 ra_124 = ble_ke_msg_alloc(ra_155, s0_159, s1, 265, a2, a2, 0x0022, s2_127, a3, dwArgF8, out s0_125, out s1_378, out a0_115, out a1_379, out a2_380, out a3_381, out a4_382, out a6_383, out a7_384, out s2_127, out s3_128, out s4_385, out s8_386, out mstatus_387);
					*a0_115 = 0x00;
					*((word32) a0_115 + 2) = (word16) (word32) *((word32) s0_125 + 2);
					*((word32) a0_115 + 4) = (word16) (word32) *((word32) s0_125 + 4);
					*((word32) a0_115 + 6) = (word16) (word32) *((word32) s0_125 + 6);
					*((word32) a0_115 + 8) = (word16) (word32) *((word32) s0_125 + 8);
					*((word32) a0_115 + 0x0A) = (word16) (word32) *((word32) s0_125 + 0x0A);
					*((word32) a0_115 + 0x0C) = (word16) (word32) *((word32) s0_125 + 0x0C);
					word32 mstatus_395;
					word32 tp_388;
					word32 t1_389;
					word32 a2_391;
					word32 a4_393;
					word32 a5_394;
					word32 a3_392;
					word32 a0_390;
					ra_155 = ble_ke_msg_send(ra_124, s0_125, 0x00FF, a0_115, s2, out tp_388, out t1_389, out s0_159, out s1, out a0_390, out a2_391, out a3_392, out a4_393, out a5_394, out mstatus_395);
					goto l23039428;
				}
			}
		}
	}
	s1.u0 = 0x00FF;
	a1_160.u0 = 0x12;
	goto l23039434;
}

// 2303947A: void hci_wr_auth_payl_to_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg88, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
void hci_wr_auth_payl_to_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg88, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	word32 a5_134;
	Eq_2 a0_19;
	Eq_2 a0_33;
	struct Eq_178678 * a3_36;
	ui32 s0_43;
	word32 s8_233;
	word32 mstatus_234;
	word32 a6_231;
	word32 a7_232;
	word32 a2_229;
	word32 a4_230;
	word32 s1_227;
	word32 a1_228;
	word32 a4_225;
	word32 s8_226;
	word32 s0_223;
	word32 a1_224;
	Eq_2 s2_125;
	Eq_2 s3_126;
	Eq_2 s4_127;
	Eq_2 ra_122 = ble_ke_msg_alloc(ble_ke_state_get(ra, s0, a2, out s0_223, out a0_19, out a1_224, out a4_225, out s8_226), a0_19, s1, 0x00FFF801, (word32) *a1, 0x00FFFC7C, 0x04, a1, a2, dwArg0108, out s0_43, out s1_227, out a0_33, out a1_228, out a2_229, out a3_36, out a4_230, out a6_231, out a7_232, out s2_125, out s3_126, out s4_127, out s8_233, out mstatus_234);
	Eq_2 s0_123 = s0_43 & 0x0F;
	Eq_2 s1_124 = a0_33;
	if ((s0_43 & 0x0F) == 0x0F)
		a5_134 = 0x0C;
	else
	{
		s0_123 = null[s3_126 >> 0x08];
		if ((word32) *((word32) s2_125 + 2) << 4 >= (uint16) (a3_36->w0078 + a3_36->w005E))
		{
			*a0_33 = 0x00;
			*((word32) *((word32) a0_33 + 16) + 88) = (word16) (word32) *((word32) s2_125 + 2);
			struct Eq_140101 * a5_76 = llc_util_set_auth_payl_to_margin((word32) a0_33 + 40);
			s0_123 = a5_76->t0000;
			if (((word32) a5_76->b00A5 & 0x03) == 0x03)
			{
				struct Eq_178831 * a5_93;
				Eq_2 s1_99;
				Eq_2 s2_100;
				Eq_2 s3_101;
				Eq_2 s4_102;
				Eq_2 s5_103;
				Eq_2 s6_104;
				word32 s0_251;
				word32 mstatus_252;
				word32 a5_253;
				word32 s6_254;
				word32 mstatus_255;
				ra_122 = ble_ke_timer_set(ble_ke_timer_set(ra_122, s0_123, a0_33, 259, s3_126, (uint16) (a5_76->w0058 - a5_76->w005A), s2_125, s3_126, s4_127, s5, s6, dwLoc10, dwArg88, dwArgE8, out s0_251, out s1_99, out a5_93, out s2_100, out s3_101, out s4_102, out s5_103, out s6_104, out mstatus_252), a5_93->t0000, s1_99, 260, s3_101, (word32) a5_93->w0058, s2_100, s3_101, s4_102, s5_103, s6_104, dwLoc10, dwArg88, dwArgE8, out s0_123, out s1_124, out a5_253, out s2_125, out s3_126, out s4_127, out s5, out s6_254, out mstatus_255);
			}
			goto l2303952C;
		}
		a5_134 = 0x12;
	}
	*a0_33 = (byte) a5_134;
l2303952C:
	*((word32) s1_124 + 2) = (word16) (word32) *s2_125;
	word32 s1_237;
	word32 a0_238;
	word32 tp_235;
	word32 s0_236;
	word32 a2_239;
	word32 a3_240;
	word32 a4_241;
	word32 s2_242;
	word32 s3_243;
	word32 s4_244;
	word32 s5_245;
	word32 s6_246;
	word32 s7_247;
	word32 s9_248;
	word32 s10_249;
	word32 mstatus_250;
	hci_send_2_host(ra_122, s0_123, s1_124, s2_125, s3_126, s4_127, s5, dwLoc10, dwLoc0C, dwArg18, out tp_235, out s0_236, out s1_237, out a0_238, out a2_239, out a3_240, out a4_241, out s2_242, out s3_243, out s4_244, out s5_245, out s6_246, out s7_247, out s9_248, out s10_249, out mstatus_250);
}

// 2303954E: void hci_flush_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 uint16) a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void hci_flush_cmd_handler(Eq_2 ra, Eq_2 s1, uint16 * a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 s0_11 = (word32) *a1;
	Eq_2 a0_19;
	Eq_2 s0_29;
	Eq_2 s2_31;
	Eq_2 s3_32;
	word32 a0_41;
	ptr32 mstatus_49;
	Eq_2 s0_51;
	Eq_2 s4_57;
	Eq_2 s5_58;
	Eq_2 s0_84;
	Eq_2 s1_85;
	Eq_2 s2_86;
	Eq_2 s3_87;
	Eq_2 s4_88;
	Eq_2 s5_89;
	word32 s1_147;
	word32 a1_148;
	word32 a2_149;
	word32 a3_150;
	word32 a4_151;
	word32 a6_152;
	word32 a7_153;
	word32 s4_154;
	word32 s8_155;
	word32 mstatus_156;
	word32 a0_157;
	word32 s6_158;
	word32 s7_159;
	Eq_2 ra_83 = lld_pdu_tx_flush(llc_common_flush_occurred_send(ble_ke_msg_alloc(ra, s0_11, s1, 0x00FFF801, s0_11, 0x00FFFC08, 0x04, s2, s3, dwArg0118, out s0_29, out s1_147, out a0_19, out a1_148, out a2_149, out a3_150, out a4_151, out a6_152, out a7_153, out s2_31, out s3_32, out s4_154, out s8_155, out mstatus_156), s0_29, a0_19, s0_29, s2_31, s3_32, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_51, out a0_41, out s4_57, out s5_58, out mstatus_49), s0_51, a0_41 + 40, s4_57, s5_58, mstatus_49, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_84, out s1_85, out a0_157, out s2_86, out s3_87, out s4_88, out s5_89, out s6_158, out s7_159);
	*((word32) s1_85 + 2) = (word16) s0_84;
	*s1_85 = 0x00;
	word32 tp_160;
	word32 s0_161;
	word32 s1_162;
	word32 a0_163;
	word32 a2_164;
	word32 a3_165;
	word32 a4_166;
	word32 s2_167;
	word32 s3_168;
	word32 s4_169;
	word32 s5_170;
	word32 s6_171;
	word32 s7_172;
	word32 s9_173;
	word32 s10_174;
	word32 mstatus_175;
	hci_send_2_host(ra_83, s0_84, s1_85, s2_86, s3_87, s4_88, s5_89, dwArg00, dwArg04, dwArg28, out tp_160, out s0_161, out s1_162, out a0_163, out a2_164, out a3_165, out a4_166, out s2_167, out s3_168, out s4_169, out s5_170, out s6_171, out s7_172, out s9_173, out s10_174, out mstatus_175);
}

