pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230395A8: void hci_rd_rem_ver_info_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void hci_rd_rem_ver_info_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 a2_118;
	Eq_2 a1_119;
	Eq_2 s2_109 = a1;
	Eq_2 s3_110 = a2;
	Eq_2 s4_111 = a3;
	ui32 a0_23;
	word32 a1_331;
	word32 a4_332;
	word32 s8_333;
	Eq_2 s0_107;
	Eq_2 ra_106 = ble_ke_state_get(ra, s0, a2, out s0_107, out a0_23, out a1_331, out a4_332, out s8_333);
	if ((a0_23 & 0x0F) == 0x0F)
	{
		a2_118 = (word32) *a1;
		a1_119.u0 = 0x0C;
	}
	else
	{
		Eq_2 s0_37 = g_t42026428;
		if (((word32) g_w42026484 & 0x02) != 0x00)
		{
			Eq_2 s0_134;
			Eq_2 s1_135;
			Eq_2 s2_138;
			Eq_2 s3_139;
			Eq_2 s5_141;
			word32 a2_334;
			word32 s4_335;
			word32 s0_336;
			word32 s1_337;
			word32 s2_338;
			word32 s3_339;
			word32 s4_340;
			word32 s5_341;
			llc_version_rd_event_send(llc_common_cmd_status_send(ra_106, s0_37, a2 >> 0x08, a3, 0x00, (word32) *a1, a1, a2, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_134, out s1_135, out a2_334, out s2_138, out s3_139, out s4_335, out s5_141), s0_134, 0x00, s1_135, s2_138, s3_139, s5_141, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_336, out s1_337, out s2_338, out s3_339, out s4_340, out s5_341);
			return;
		}
		if ((a0_23 & 5) != 0x00)
			return;
		struct Eq_179116 * a5_50;
		Eq_2 s1_54;
		word32 s0_342;
		word32 a0_343;
		word32 a2_344;
		word32 a4_345;
		word32 s2_346;
		word32 s3_347;
		word32 s4_348;
		word32 mstatus_349;
		Eq_2 ra_53 = ble_ke_state_set(ra_106, s0_37, 0x02, a2, (a0_23 | 1) & 0x00FF, dwArgE8, out s0_342, out s1_54, out a0_343, out a2_344, out a4_345, out a5_50, out s2_346, out s3_347, out s4_348, out mstatus_349);
		Eq_2 s0_63 = a5_50->t0000;
		a5_50->b00A3 = (byte) s1_54;
		Eq_2 s0_76;
		Eq_2 s1_77;
		Eq_2 s2_80;
		Eq_2 s3_81;
		Eq_2 s4_82;
		Eq_2 s5_83;
		Eq_2 s6_84;
		word32 a5_350;
		word32 s6_351;
		word32 mstatus_352;
		ra_106 = ble_ke_timer_set(llc_llcp_version_ind_pdu_send(ra_53, s0_63, s1_54, s2, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, out s0_76, out s1_77, out s2_80, out s3_81, out s4_82, out s5_83, out s6_84), s0_76, s1_77, 258, s3_81, 0x00FFFFA0, s2_80, s3_81, s4_82, s5_83, s6_84, dwLoc10, dwArg88, dwArgE8, out s0_107, out s1, out a5_350, out s2_109, out s3_110, out s4_111, out s5, out s6_351, out mstatus_352);
		a2_118 = (word32) *s2_109;
		a1_119.u0 = 0x00;
	}
	word32 s0_353;
	word32 s1_354;
	word32 a2_355;
	word32 s2_356;
	word32 s3_357;
	word32 s4_358;
	word32 s5_359;
	llc_common_cmd_status_send(ra_106, s0_107, s1, s4_111, a1_119, a2_118, s2_109, s3_110, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_353, out s1_354, out a2_355, out s2_356, out s3_357, out s4_358, out s5_359);
}

// 2303965A: void llc_hci_command_handler(Register word32 a3)
void llc_hci_command_handler(word32 a3)
{
	struct Eq_179206 * a0_14 = g_a230B624C;
	ui32 a5_12;
	for (a5_12 = 0x00; a5_12 != 0x10; ++a5_12)
	{
		if ((word32) a0_14->w0000 == a3)
		{
			<anonymous> * t1_19 = g_a230B6250[a5_12];
			if (t1_19 == null)
				return;
			word32 a3_29;
			word32 t1_30;
			t1_19();
			return;
		}
		++a0_14;
	}
}

// 2303968E: void llc_hci_acl_data_tx_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void llc_hci_acl_data_tx_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgB4, Eq_2 dwArgD0, Eq_2 dwArgD4, Eq_2 dwArgDC, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	ui32 a0_14;
	Eq_2 s0_19;
	word32 a1_245;
	word32 a4_246;
	word32 s8_247;
	Eq_2 ra_18 = ble_ke_state_get(ra, a1, a2, out s0_19, out a0_14, out a1_245, out a4_246, out s8_247);
	if ((a0_14 & 0x0F) != 0x0F && (word32) (*((word32) s0_19 + 4)) != 0x00)
	{
		Eq_2 a0_26;
		Eq_128173 a3_29;
		ptr32 mstatus_34;
		Eq_2 ra_35 = lld_pdu_data_send(ra_18, s1, s0_19, out a0_26, out a3_29, out mstatus_34);
		if (a0_26 == 0x00)
		{
			word32 s0_273;
			word32 s1_274;
			word32 a4_275;
			word32 s2_276;
			word32 s3_277;
			word32 s4_278;
			word32 s5_279;
			word32 s6_280;
			word32 s7_281;
			ra_35 = llc_common_nb_of_pkt_comp_evt_send(ra_35, s0_19, (word32) *s0_19, 0x01, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_273, out s1_274, out a0_26, out a3_29, out a4_275, out s2_276, out s3_277, out s4_278, out s5_279, out s6_280, out s7_281, out mstatus_34);
		}
		word32 s0_263;
		word32 s1_264;
		word32 a4_265;
		word32 s2_266;
		word32 s3_267;
		word32 s4_268;
		word32 s5_269;
		word32 s6_270;
		word32 s7_271;
		word32 mstatus_272;
		lld_evt_schedule_next(ra_35, a0_26, a3_29, mstatus_34, s0, dwLoc08, dwArg00, dwArg08, dwArg48, dwArg68, dwArg88, dwArg8C, dwArgB4, dwArgD0, dwArgD4, dwArgDC, dwArgF8, out s0_263, out s1_264, out a4_265, out s2_266, out s3_267, out s4_268, out s5_269, out s6_270, out s7_271, out mstatus_272);
	}
	else
	{
		Eq_2 s1_117 = __csrrs(mstatus, 0x00);
		struct Eq_15 * a5_118 = __csrrc(mstatus, 0x08);
		Eq_2 s0_120 = a5_118->t0008;
		word32 s1_248;
		word32 a0_249;
		word32 a5_250;
		Eq_2 ra_134 = ble_co_list_push_back(ra_18, s0_120, s1_117, 0x420262D0, ((word32) a5_118->w0004 + 41 << 3) + 0x420262C8, out s1_248, out a0_249, out a5_250);
		__csrrw(mstatus, 0x00);
		word32 s0_251;
		word32 s1_252;
		word32 a0_253;
		word32 a3_254;
		word32 a4_255;
		word32 s2_256;
		word32 s3_257;
		word32 s4_258;
		word32 s5_259;
		word32 s6_260;
		word32 s7_261;
		word32 mstatus_262;
		llc_common_nb_of_pkt_comp_evt_send(ra_134, s0_120, (word32) *s0_120, 0x01, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_251, out s1_252, out a0_253, out a3_254, out a4_255, out s2_256, out s3_257, out s4_258, out s5_259, out s6_260, out s7_261, out mstatus_262);
	}
}

// 2303971C: void hci_vsc_set_tx_pwr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 int8) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_vsc_set_tx_pwr(Eq_2 ra, Eq_2 s0, Eq_2 s1, int8 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	Eq_2 a1_25 = 0x12;
	if (((int32) *a1 & 0x00FF) <= 0x14)
	{
		<anonymous> * a5_12 = g_ptr4202573C;
		a5_12();
		a1_25.u0 = 0x00;
	}
	word32 s5_107;
	word32 s3_106;
	word32 s2_105;
	word32 s1_104;
	word32 s0_103;
	llm_common_cmd_complete_send(ra, s0, s1, a3, a1_25, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_103, out s1_104, out s2_105, out s3_106, out s5_107);
}

// 2303974E: void hci_le_wr_rfpath_compensation_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_179446) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0108)
void hci_le_wr_rfpath_compensation_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_179446 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0108)
{
	g_w4200F3EE = (word16) (word32) a1->w0000;
	g_w4200F3EC = (word16) (word32) a1->w0002;
	word32 s0_57;
	word32 s1_58;
	word32 s2_59;
	word32 s3_60;
	word32 s5_61;
	llm_common_cmd_complete_send(ra, s0, s1, a3, 0x00, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_57, out s1_58, out s2_59, out s3_60, out s5_61);
}

// 2303977A: void hci_wr_le_host_supp_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 byte) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0108)
void hci_wr_le_host_supp_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, byte * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0108)
{
	g_b4200D4A8 = (byte) ((word32) *a1 << 1 | (word32) g_b4200D4A8);
	word32 s0_58;
	word32 s1_59;
	word32 s2_60;
	word32 s3_61;
	word32 s5_62;
	llm_common_cmd_complete_send(ra, s0, s1, a3, 0x00, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_58, out s1_59, out s2_60, out s3_61, out s5_62);
}

// 230397A6: void hci_le_wr_suggted_dft_data_len_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_179523) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0108)
void hci_le_wr_suggted_dft_data_len_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_179523 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0108)
{
	word32 a2_7 = (word32) a1->w0000;
	Eq_2 a1_13 = 0x12;
	if ((word32) (word16) (a2_7 + -27) <= 224 && (word32) ((word16) ((word32) a1->w0002 + -328)) <= 0x0700)
	{
		g_w42026480 = (word16) a2_7;
		g_w42026482 = (word16) (word32) a1->w0002;
		a1_13.u0 = 0x00;
	}
	word32 s1_84;
	word32 s2_85;
	word32 s3_86;
	word32 s5_87;
	word32 s0_83;
	llm_common_cmd_complete_send(ra, s0, s1, a3, a1_13, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_83, out s1_84, out s2_85, out s3_86, out s5_87);
}

// 230397FA: void hci_le_set_evt_mask_cmd_handler(Register word32 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_le_set_evt_mask_cmd_handler(word32 ra, Eq_2 s0, Eq_2 s1, word32 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	<anonymous> * a5_5 = g_ptr4200F3D0;
	Eq_2 ra_17;
	Eq_2 a3_19;
	a5_5();
	word32 s0_40;
	word32 s1_41;
	word32 s2_44;
	word32 s3_45;
	word32 s5_47;
	llm_common_cmd_complete_send(ra_17, s0, s1, a3_19, 0x00, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_40, out s1_41, out s2_44, out s3_45, out s5_47);
}

