pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23039826: void hci_le_rd_rfpath_compensation_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_le_rd_rfpath_compensation_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	Eq_2 a0_16;
	Eq_2 s0_26;
	Eq_2 s2_28;
	Eq_2 s3_29;
	Eq_2 s4_30;
	word32 s1_79;
	word32 a1_80;
	word32 a2_81;
	word32 a3_82;
	word32 a4_83;
	word32 a6_84;
	word32 a7_85;
	word32 s8_86;
	word32 mstatus_87;
	Eq_2 ra_25 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x0200004C, 0x06, s2, s3, dwArg0118, out s0_26, out s1_79, out a0_16, out a1_80, out a2_81, out a3_82, out a4_83, out a6_84, out a7_85, out s2_28, out s3_29, out s4_30, out s8_86, out mstatus_87);
	*((word32) a0_16 + 2) = (word16) (word32) g_w4200F3EE;
	word32 a4_39 = (word32) g_w4200F3EC;
	*a0_16 = 0x00;
	*((word32) a0_16 + 4) = (word16) a4_39;
	word32 tp_88;
	word32 s0_89;
	word32 s1_90;
	word32 a0_91;
	word32 a2_92;
	word32 a3_93;
	word32 a4_94;
	word32 s2_95;
	word32 s3_96;
	word32 s4_97;
	word32 s5_98;
	word32 s6_99;
	word32 s7_100;
	word32 s9_101;
	word32 s10_102;
	word32 mstatus_103;
	hci_send_2_host(ra_25, s0_26, a0_16, s2_28, s3_29, s4_30, s5, dwArg00, dwArg04, dwArg28, out tp_88, out s0_89, out s1_90, out a0_91, out a2_92, out a3_93, out a4_94, out s2_95, out s3_96, out s4_97, out s5_98, out s6_99, out s7_100, out s9_101, out s10_102, out mstatus_103);
}

// 23039866: void hci_le_rd_trans_pwr_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_le_rd_trans_pwr_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	Eq_2 a0_16;
	Eq_2 s0_26;
	Eq_2 s2_28;
	Eq_2 s3_29;
	Eq_2 s4_30;
	word32 s1_77;
	word32 a1_78;
	word32 a2_79;
	word32 a3_80;
	word32 a4_81;
	word32 a6_82;
	word32 a7_83;
	word32 s8_84;
	word32 mstatus_85;
	Eq_2 ra_25 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x0200004B, 0x03, s2, s3, dwArg0118, out s0_26, out s1_77, out a0_16, out a1_78, out a2_79, out a3_80, out a4_81, out a6_82, out a7_83, out s2_28, out s3_29, out s4_30, out s8_84, out mstatus_85);
	*((word32) a0_16 + 1) = 0x00;
	word32 a4_37 = (word32) g_b42025758;
	*a0_16 = 0x00;
	*((word32) a0_16 + 2) = (byte) a4_37;
	word32 tp_86;
	word32 s0_87;
	word32 s1_88;
	word32 a0_89;
	word32 a2_90;
	word32 a3_91;
	word32 a4_92;
	word32 s2_93;
	word32 s3_94;
	word32 s4_95;
	word32 s5_96;
	word32 s6_97;
	word32 s7_98;
	word32 s9_99;
	word32 s10_100;
	word32 mstatus_101;
	hci_send_2_host(ra_25, s0_26, a0_16, s2_28, s3_29, s4_30, s5, dwArg00, dwArg04, dwArg28, out tp_86, out s0_87, out s1_88, out a0_89, out a2_90, out a3_91, out a4_92, out s2_93, out s3_94, out s4_95, out s5_96, out s6_97, out s7_98, out s9_99, out s10_100, out mstatus_101);
}

// 2303989E: void hci_rd_buff_size_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_rd_buff_size_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	Eq_2 a0_15;
	Eq_2 s0_25;
	Eq_2 s2_27;
	Eq_2 s3_28;
	Eq_2 s4_29;
	word32 s1_76;
	word32 a1_77;
	word32 a2_78;
	word32 a3_79;
	word32 a4_80;
	word32 a6_81;
	word32 a7_82;
	word32 s8_83;
	word32 mstatus_84;
	Eq_2 ra_24 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x01000005, 0x0A, s2, s3, dwArg0118, out s0_25, out s1_76, out a0_15, out a1_77, out a2_78, out a3_79, out a4_80, out a6_81, out a7_82, out s2_27, out s3_28, out s4_29, out s8_83, out mstatus_84);
	((word32) a0_15 + 6)->u2 = 0x00;
	*((word32) a0_15 + 2) = 0x00;
	*((word32) a0_15 + 4) = 0x00;
	*((word32) a0_15 + 8) = 0x00;
	*a0_15 = 0x00;
	word32 tp_85;
	word32 s0_86;
	word32 s1_87;
	word32 a0_88;
	word32 a2_89;
	word32 a3_90;
	word32 a4_91;
	word32 s2_92;
	word32 s3_93;
	word32 s4_94;
	word32 s5_95;
	word32 s6_96;
	word32 s7_97;
	word32 s9_98;
	word32 s10_99;
	word32 mstatus_100;
	hci_send_2_host(ra_24, s0_25, a0_15, s2_27, s3_28, s4_29, s5, dwArg00, dwArg04, dwArg28, out tp_85, out s0_86, out s1_87, out a0_88, out a2_89, out a3_90, out a4_91, out s2_92, out s3_93, out s4_94, out s5_95, out s6_96, out s7_97, out s9_98, out s10_99, out mstatus_100);
}

// 230398D4: void hci_rd_local_supp_feats_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_rd_local_supp_feats_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	word32 a0_17;
	word32 a3_20;
	word32 s1_28;
	word32 s2_29;
	word32 s3_30;
	word32 s0_113;
	word32 a1_114;
	word32 a2_115;
	word32 a4_116;
	word32 a6_117;
	word32 a7_118;
	word32 s4_119;
	word32 s8_120;
	word32 mstatus_121;
	Eq_2 ra_26 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, a3, 0x09, s2, s3, dwArg0118, out s0_113, out s1_28, out a0_17, out a1_114, out a2_115, out a3_20, out a4_116, out a6_117, out a7_118, out s2_29, out s3_30, out s4_119, out s8_120, out mstatus_121);
	<anonymous> * a5_37 = g_ptr4200F3D0;
	Eq_2 ra_48;
	Eq_2 s0_49;
	Eq_2 s2_52;
	Eq_2 s3_53;
	Eq_2 s4_58;
	a5_37();
	*s0_49 = 0x00;
	word32 s5_83;
	word32 tp_122;
	word32 s0_123;
	word32 s1_124;
	word32 a0_125;
	word32 a2_126;
	word32 a3_127;
	word32 a4_128;
	word32 s2_129;
	word32 s3_130;
	word32 s4_131;
	word32 s6_132;
	word32 s7_133;
	word32 s9_134;
	word32 s10_135;
	word32 mstatus_136;
	hci_send_2_host(ra_48, s0_49, s0_49, s2_52, s3_53, s4_58, s5, dwArg00, dwArg04, dwArg28, out tp_122, out s0_123, out s1_124, out a0_125, out a2_126, out a3_127, out a4_128, out s2_129, out s3_130, out s4_131, out s5_83, out s6_132, out s7_133, out s9_134, out s10_135, out mstatus_136);
}

// 23039916: void hci_rd_local_supp_cmds_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_rd_local_supp_cmds_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	word32 a0_16;
	word32 s1_27;
	word32 s2_28;
	word32 s3_29;
	word32 s0_112;
	word32 a1_113;
	word32 a2_114;
	word32 a3_115;
	word32 a4_116;
	word32 a6_117;
	word32 a7_118;
	word32 s4_119;
	word32 s8_120;
	word32 mstatus_121;
	Eq_2 ra_25 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x01000002, 65, s2, s3, dwArg0118, out s0_112, out s1_27, out a0_16, out a1_113, out a2_114, out a3_115, out a4_116, out a6_117, out a7_118, out s2_28, out s3_29, out s4_119, out s8_120, out mstatus_121);
	<anonymous> * a5_36 = g_ptr4200F3D0;
	Eq_2 ra_47;
	Eq_2 s0_48;
	Eq_2 s2_51;
	Eq_2 s3_52;
	Eq_2 s4_57;
	a5_36();
	*s0_48 = 0x00;
	word32 s5_82;
	word32 tp_122;
	word32 s0_123;
	word32 s1_124;
	word32 a0_125;
	word32 a2_126;
	word32 a3_127;
	word32 a4_128;
	word32 s2_129;
	word32 s3_130;
	word32 s4_131;
	word32 s6_132;
	word32 s7_133;
	word32 s9_134;
	word32 s10_135;
	word32 mstatus_136;
	hci_send_2_host(ra_47, s0_48, s0_48, s2_51, s3_52, s4_57, s5, dwArg00, dwArg04, dwArg28, out tp_122, out s0_123, out s1_124, out a0_125, out a2_126, out a3_127, out a4_128, out s2_129, out s3_130, out s4_131, out s5_82, out s6_132, out s7_133, out s9_134, out s10_135, out mstatus_136);
}

