pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303995E: void hci_rd_local_ver_info_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_rd_local_ver_info_cmd_handler(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	Eq_2 a0_16;
	word32 s0_26;
	Eq_2 s2_28;
	Eq_2 s3_29;
	Eq_2 s4_30;
	word32 s1_83;
	word32 a1_84;
	word32 a2_85;
	word32 a3_86;
	word32 a4_87;
	word32 a6_88;
	word32 a7_89;
	word32 s8_90;
	word32 mstatus_91;
	Eq_2 ra_25 = ble_ke_msg_alloc(ra, 0x01000000, s1, 0x00FFF801, 0x00, 0x01000001, 0x0A, s2, s3, dwArg0118, out s0_26, out s1_83, out a0_16, out a1_84, out a2_85, out a3_86, out a4_87, out a6_88, out a7_89, out s2_28, out s3_29, out s4_30, out s8_90, out mstatus_91);
	*((word32) a0_16 + 8) = 0x0321;
	*((word32) a0_16 + 2) = 0x0321;
	*a0_16 = (word16) (s0_26 + -0x0700);
	((word32) a0_16 + 6)->u2 = 0x07AF;
	*((word32) a0_16 + 4) = 0x09;
	word32 tp_92;
	word32 s0_93;
	word32 s1_94;
	word32 a0_95;
	word32 a2_96;
	word32 a3_97;
	word32 a4_98;
	word32 s2_99;
	word32 s3_100;
	word32 s4_101;
	word32 s5_102;
	word32 s6_103;
	word32 s7_104;
	word32 s9_105;
	word32 s10_106;
	word32 mstatus_107;
	hci_send_2_host(ra_25, s0_26 + -0x0700, a0_16, s2_28, s3_29, s4_30, s5, dwArg00, dwArg04, dwArg28, out tp_92, out s0_93, out s1_94, out a0_95, out a2_96, out a3_97, out a4_98, out s2_99, out s3_100, out s4_101, out s5_102, out s6_103, out s7_104, out s9_105, out s10_106, out mstatus_107);
}

// 230399A6: void hci_rd_bd_addr_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_rd_bd_addr_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	word32 a0_16;
	word32 s1_27;
	word32 s2_28;
	word32 s3_29;
	word32 s0_112;
	word32 a1_113;
	word32 a2_114;
	word32 a3_115;
	word32 a4_116;
	word32 a6_117;
	word32 a7_118;
	word32 s4_119;
	word32 s8_120;
	word32 mstatus_121;
	Eq_2 ra_25 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x01000009, 0x07, s2, s3, dwArg0118, out s0_112, out s1_27, out a0_16, out a1_113, out a2_114, out a3_115, out a4_116, out a6_117, out a7_118, out s2_28, out s3_29, out s4_119, out s8_120, out mstatus_121);
	<anonymous> * a5_36 = g_ptr4200F3D0;
	Eq_2 ra_47;
	Eq_2 s0_48;
	Eq_2 s2_51;
	Eq_2 s3_52;
	Eq_2 s4_57;
	a5_36();
	*s0_48 = 0x00;
	word32 s5_82;
	word32 tp_122;
	word32 s0_123;
	word32 s1_124;
	word32 a0_125;
	word32 a2_126;
	word32 a3_127;
	word32 a4_128;
	word32 s2_129;
	word32 s3_130;
	word32 s4_131;
	word32 s6_132;
	word32 s7_133;
	word32 s9_134;
	word32 s10_135;
	word32 mstatus_136;
	hci_send_2_host(ra_47, s0_48, s0_48, s2_51, s3_52, s4_57, s5, dwArg00, dwArg04, dwArg28, out tp_122, out s0_123, out s1_124, out a0_125, out a2_126, out a3_127, out a4_128, out s2_129, out s3_130, out s4_131, out s5_82, out s6_132, out s7_133, out s9_134, out s10_135, out mstatus_136);
}

// 230399EA: void hci_le_rd_max_data_len_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_le_rd_max_data_len_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	Eq_2 a0_16;
	Eq_2 s0_26;
	Eq_2 s2_28;
	Eq_2 s3_29;
	Eq_2 s4_30;
	word32 s1_83;
	word32 a1_84;
	word32 a2_85;
	word32 a3_86;
	word32 a4_87;
	word32 a6_88;
	word32 a7_89;
	word32 s8_90;
	word32 mstatus_91;
	Eq_2 ra_25 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x0200002F, 0x0A, s2, s3, dwArg0118, out s0_26, out s1_83, out a0_16, out a1_84, out a2_85, out a3_86, out a4_87, out a6_88, out a7_89, out s2_28, out s3_29, out s4_30, out s8_90, out mstatus_91);
	*((word32) a0_16 + 6) = (word16) (word32) g_w42026488;
	*((word32) a0_16 + 8) = (word16) (word32) g_w4202648A;
	*((word32) a0_16 + 2) = (word16) (word32) g_w42026484;
	word32 a5_43 = (word32) g_w42026486;
	*a0_16 = 0x00;
	*((word32) a0_16 + 4) = (word16) a5_43;
	word32 tp_92;
	word32 s0_93;
	word32 s1_94;
	word32 a0_95;
	word32 a2_96;
	word32 a3_97;
	word32 a4_98;
	word32 s2_99;
	word32 s3_100;
	word32 s4_101;
	word32 s5_102;
	word32 s6_103;
	word32 s7_104;
	word32 s9_105;
	word32 s10_106;
	word32 mstatus_107;
	hci_send_2_host(ra_25, s0_26, a0_16, s2_28, s3_29, s4_30, s5, dwArg00, dwArg04, dwArg28, out tp_92, out s0_93, out s1_94, out a0_95, out a2_96, out a3_97, out a4_98, out s2_99, out s3_100, out s4_101, out s5_102, out s6_103, out s7_104, out s9_105, out s10_106, out mstatus_107);
}

// 23039A3A: void hci_le_rd_suggted_dft_data_len_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_le_rd_suggted_dft_data_len_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	Eq_2 a0_16;
	Eq_2 s0_26;
	Eq_2 s2_28;
	Eq_2 s3_29;
	Eq_2 s4_30;
	word32 s1_79;
	word32 a1_80;
	word32 a2_81;
	word32 a3_82;
	word32 a4_83;
	word32 a6_84;
	word32 a7_85;
	word32 s8_86;
	word32 mstatus_87;
	Eq_2 ra_25 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x02000023, 0x06, s2, s3, dwArg0118, out s0_26, out s1_79, out a0_16, out a1_80, out a2_81, out a3_82, out a4_83, out a6_84, out a7_85, out s2_28, out s3_29, out s4_30, out s8_86, out mstatus_87);
	*((word32) a0_16 + 2) = (word16) (word32) g_w42026480;
	word32 a5_39 = (word32) g_w42026482;
	*a0_16 = 0x00;
	*((word32) a0_16 + 4) = (word16) a5_39;
	word32 tp_88;
	word32 s0_89;
	word32 s1_90;
	word32 a0_91;
	word32 a2_92;
	word32 a3_93;
	word32 a4_94;
	word32 s2_95;
	word32 s3_96;
	word32 s4_97;
	word32 s5_98;
	word32 s6_99;
	word32 s7_100;
	word32 s9_101;
	word32 s10_102;
	word32 mstatus_103;
	hci_send_2_host(ra_25, s0_26, a0_16, s2_28, s3_29, s4_30, s5, dwArg00, dwArg04, dwArg28, out tp_88, out s0_89, out s1_90, out a0_91, out a2_92, out a3_93, out a4_94, out s2_95, out s3_96, out s4_97, out s5_98, out s6_99, out s7_100, out s9_101, out s10_102, out mstatus_103);
}

// 23039A7A: void hci_le_rd_supp_states_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_le_rd_supp_states_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	word32 a0_17;
	word32 s1_28;
	word32 s2_29;
	word32 s3_30;
	word32 s0_113;
	word32 a1_114;
	word32 a2_115;
	word32 a3_116;
	word32 a4_117;
	word32 a6_118;
	word32 a7_119;
	word32 s4_120;
	word32 s8_121;
	word32 mstatus_122;
	Eq_2 ra_26 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x0200001C, 0x09, s2, s3, dwArg0118, out s0_113, out s1_28, out a0_17, out a1_114, out a2_115, out a3_116, out a4_117, out a6_118, out a7_119, out s2_29, out s3_30, out s4_120, out s8_121, out mstatus_122);
	<anonymous> * a5_37 = g_ptr4200F3D0;
	Eq_2 ra_48;
	Eq_2 s0_49;
	Eq_2 s2_52;
	Eq_2 s3_53;
	Eq_2 s4_58;
	a5_37();
	*s0_49 = 0x00;
	word32 s5_83;
	word32 tp_123;
	word32 s0_124;
	word32 s1_125;
	word32 a0_126;
	word32 a2_127;
	word32 a3_128;
	word32 a4_129;
	word32 s2_130;
	word32 s3_131;
	word32 s4_132;
	word32 s6_133;
	word32 s7_134;
	word32 s9_135;
	word32 s10_136;
	word32 mstatus_137;
	hci_send_2_host(ra_48, s0_49, s0_49, s2_52, s3_53, s4_58, s5, dwArg00, dwArg04, dwArg28, out tp_123, out s0_124, out s1_125, out a0_126, out a2_127, out a3_128, out a4_129, out s2_130, out s3_131, out s4_132, out s5_83, out s6_133, out s7_134, out s9_135, out s10_136, out mstatus_137);
}

// 23039ABE: void hci_le_rd_wl_size_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_le_rd_wl_size_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	Eq_2 a0_16;
	Eq_2 s0_26;
	Eq_2 s2_28;
	Eq_2 s3_29;
	Eq_2 s4_30;
	word32 s1_75;
	word32 a1_76;
	word32 a2_77;
	word32 a3_78;
	word32 a4_79;
	word32 a6_80;
	word32 a7_81;
	word32 s8_82;
	word32 mstatus_83;
	Eq_2 ra_25 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x0200000F, 0x02, s2, s3, dwArg0118, out s0_26, out s1_75, out a0_16, out a1_76, out a2_77, out a3_78, out a4_79, out a6_80, out a7_81, out s2_28, out s3_29, out s4_30, out s8_82, out mstatus_83);
	*a0_16 = 0x00;
	*((word32) a0_16 + 1) = 0x04;
	word32 tp_84;
	word32 s0_85;
	word32 s1_86;
	word32 a0_87;
	word32 a2_88;
	word32 a3_89;
	word32 a4_90;
	word32 s2_91;
	word32 s3_92;
	word32 s4_93;
	word32 s5_94;
	word32 s6_95;
	word32 s7_96;
	word32 s9_97;
	word32 s10_98;
	word32 mstatus_99;
	hci_send_2_host(ra_25, s0_26, a0_16, s2_28, s3_29, s4_30, s5, dwArg00, dwArg04, dwArg28, out tp_84, out s0_85, out s1_86, out a0_87, out a2_88, out a3_89, out a4_90, out s2_91, out s3_92, out s4_93, out s5_94, out s6_95, out s7_96, out s9_97, out s10_98, out mstatus_99);
}

