pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23039AEA: void hci_le_rd_adv_ch_tx_pw_cmd_handler(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 s2, Register word32 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack word32 dwArg0118)
void hci_le_rd_adv_ch_tx_pw_cmd_handler(word32 ra, word32 s0, word32 s1, word32 s2, word32 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, word32 dwArg0118)
{
	word32 a0_17;
	word32 a2_19;
	word32 a3_20;
	<anonymous> * a4_21;
	word32 s1_28;
	word32 s2_29;
	word32 s3_30;
	word32 a0_41;
	Eq_2 ra_50;
	Eq_2 s0_51;
	Eq_2 s2_53;
	Eq_2 s3_54;
	Eq_2 s4_55;
	a4_21();
	*((word32) s0_51 + 1) = (byte) a0_41;
	*s0_51 = 0x00;
	word32 tp_109;
	word32 s0_110;
	word32 s1_111;
	word32 a0_112;
	word32 a2_113;
	word32 a3_114;
	word32 a4_115;
	word32 s2_116;
	word32 s3_117;
	word32 s4_118;
	word32 s5_119;
	word32 s6_120;
	word32 s7_121;
	word32 s9_122;
	word32 s10_123;
	word32 mstatus_124;
	hci_send_2_host(ra_50, s0_51, s0_51, s2_53, s3_54, s4_55, s5, dwArg00, dwArg04, dwArg28, out tp_109, out s0_110, out s1_111, out a0_112, out a2_113, out a3_114, out a4_115, out s2_116, out s3_117, out s4_118, out s5_119, out s6_120, out s7_121, out s9_122, out s10_123, out mstatus_124);
}

// 23039B2E: void hci_le_rd_local_supp_feats_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_le_rd_local_supp_feats_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	word32 a0_17;
	word32 s1_28;
	word32 s2_29;
	word32 s3_30;
	word32 s0_113;
	word32 a1_114;
	word32 a2_115;
	word32 a3_116;
	word32 a4_117;
	word32 a6_118;
	word32 a7_119;
	word32 s4_120;
	word32 s8_121;
	word32 mstatus_122;
	Eq_2 ra_26 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x02000003, 0x09, s2, s3, dwArg0118, out s0_113, out s1_28, out a0_17, out a1_114, out a2_115, out a3_116, out a4_117, out a6_118, out a7_119, out s2_29, out s3_30, out s4_120, out s8_121, out mstatus_122);
	<anonymous> * a5_37 = g_ptr4200F3D0;
	Eq_2 ra_48;
	Eq_2 s0_49;
	Eq_2 s2_52;
	Eq_2 s3_53;
	Eq_2 s4_58;
	a5_37();
	*s0_49 = 0x00;
	word32 s5_83;
	word32 tp_123;
	word32 s0_124;
	word32 s1_125;
	word32 a0_126;
	word32 a2_127;
	word32 a3_128;
	word32 a4_129;
	word32 s2_130;
	word32 s3_131;
	word32 s4_132;
	word32 s6_133;
	word32 s7_134;
	word32 s9_135;
	word32 s10_136;
	word32 mstatus_137;
	hci_send_2_host(ra_48, s0_49, s0_49, s2_52, s3_53, s4_58, s5, dwArg00, dwArg04, dwArg28, out tp_123, out s0_124, out s1_125, out a0_126, out a2_127, out a3_128, out a4_129, out s2_130, out s3_131, out s4_132, out s5_83, out s6_133, out s7_134, out s9_135, out s10_136, out mstatus_137);
}

// 23039B72: void hci_le_rd_buff_size_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_le_rd_buff_size_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	Eq_2 a0_16;
	Eq_2 s0_26;
	Eq_2 s2_28;
	Eq_2 s3_29;
	Eq_2 s4_30;
	word32 s1_78;
	word32 a1_79;
	word32 a2_80;
	word32 a3_81;
	word32 a4_82;
	word32 a6_83;
	word32 a7_84;
	word32 s8_85;
	word32 mstatus_86;
	Eq_2 ra_25 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x02000002, 0x06, s2, s3, dwArg0118, out s0_26, out s1_78, out a0_16, out a1_79, out a2_80, out a3_81, out a4_82, out a6_83, out a7_84, out s2_28, out s3_29, out s4_30, out s8_85, out mstatus_86);
	*((word32) a0_16 + 4) = 0x02;
	word32 a4_38 = (word32) g_w42026484;
	*a0_16 = 0x00;
	*((word32) a0_16 + 2) = (word16) a4_38;
	word32 tp_87;
	word32 s0_88;
	word32 s1_89;
	word32 a0_90;
	word32 a2_91;
	word32 a3_92;
	word32 a4_93;
	word32 s2_94;
	word32 s3_95;
	word32 s4_96;
	word32 s5_97;
	word32 s6_98;
	word32 s7_99;
	word32 s9_100;
	word32 s10_101;
	word32 mstatus_102;
	hci_send_2_host(ra_25, s0_26, a0_16, s2_28, s3_29, s4_30, s5, dwArg00, dwArg04, dwArg28, out tp_87, out s0_88, out s1_89, out a0_90, out a2_91, out a3_92, out a4_93, out s2_94, out s3_95, out s4_96, out s5_97, out s6_98, out s7_99, out s9_100, out s10_101, out mstatus_102);
}

// 23039BAA: void hci_le_generate_dhkey_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register ptr32 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register word32 s7, Register word32 s9, Register word32 s10, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0108)
void hci_le_generate_dhkey_cmd_handler(Eq_2 ra, Eq_2 s1, ptr32 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, word32 s7, word32 s9, word32 s10, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0108)
{
	int32 a5_12;
	for (a5_12 = 0x00; a5_12 != 32; ++a5_12)
	{
		Eq_2 a0_19;
		if ((word32) (a1 + a5_12) != 0x00)
		{
			a0_19.u0 = 0x00;
			goto l23039BCC;
		}
	}
	a0_19.u0 = 0x12;
l23039BCC:
	byte * a5_24 = a1 + 32;
	do
	{
		if ((word32) *a5_24 != 0x00)
			goto l23039BE4;
		++a5_24;
	} while (a1 + 64 != a5_24);
	a0_19.u0 = 0x12;
l23039BE4:
	if ((word32) g_b42026533 == 0x00)
	{
		if (a0_19 == 0x00)
		{
			g_b42026533 = 0x02;
			a0_19 = ecc_generate_key256(ra, 0x02, 0x42026513, a1 + 32, 0x06, 0x00, s7, s9, s10);
		}
	}
	else
		a0_19.u0 = 0x0C;
	word32 s0_198;
	word32 s1_199;
	word32 a2_200;
	word32 s7_201;
	word32 s9_202;
	word32 s10_203;
	llm_common_cmd_status_send(ra, a3, s1, a3, a0_19, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_198, out s1_199, out a2_200, out s7_201, out s9_202, out s10_203);
}

// 23039C26: void hci_host_nb_cmp_pkts_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 byte) a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArgF8)
void hci_host_nb_cmp_pkts_cmd_handler(Eq_2 ra, Eq_2 s1, byte * a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArgF8)
{
	ui32 a2_7 = (word32) *a1;
	struct Eq_181003 * a5_15 = a1 + 2;
	up32 a0_21 = 0x00;
	ui32 a4_10 = 0x00;
	Eq_2 a1_11 = 0x00;
	while (a2_7 != a4_10)
	{
		if ((word32) a5_15->w0000 <= 0x01)
			a0_21 = (word32) (word16) (a0_21 + (word32) a5_15[3]);
		else
			a1_11.u0 = 0x12;
		a4_10 = a4_10 + 0x01 & 0x00FF;
		++a5_15;
	}
	Eq_2 a3_39 = hci_fc_host_nb_acl_pkts_complete(a0_21);
	if (a1_11 != 0x00)
	{
		word32 s5_188;
		word32 s2_186;
		word32 s3_187;
		word32 s0_184;
		word32 s1_185;
		llm_common_cmd_complete_send(ra, dwArg44, s1, a3_39, a1_11, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_184, out s1_185, out s2_186, out s3_187, out s5_188);
	}
}

// 23039C7A: void hci_host_buf_size_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_181056) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_host_buf_size_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_181056 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	word32 s0_61;
	word32 s1_62;
	word32 s2_63;
	word32 s3_64;
	word32 s5_65;
	llm_common_cmd_complete_send(ra, s0, s1, a3, hci_fc_acl_buf_size_set((word32) a1->w0000, (word32) a1->w0004), s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_61, out s1_62, out s2_63, out s3_64, out s5_65);
}

