pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23039CA0: void hci_set_evt_mask_page_2_cmd_handler(Register word32 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_set_evt_mask_page_2_cmd_handler(word32 ra, Eq_2 s0, Eq_2 s1, word32 a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	Eq_2 a0_12;
	Eq_2 a3_15;
	word32 s0_64;
	word32 s1_65;
	word32 s2_66;
	word32 s3_67;
	word32 s5_68;
	llm_common_cmd_complete_send(hci_evt_mask_set(ra, s0, a1, 0x02, out a0_12, out a3_15), s0, s1, a3_15, a0_12, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_64, out s1_65, out s2_66, out s3_67, out s5_68);
}

// 23039CC0: void hci_set_evt_mask_cmd_handler(Register word32 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_set_evt_mask_cmd_handler(word32 ra, Eq_2 s0, Eq_2 s1, word32 a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	Eq_2 a0_12;
	Eq_2 a3_15;
	word32 s0_64;
	word32 s1_65;
	word32 s2_66;
	word32 s3_67;
	word32 s5_68;
	llm_common_cmd_complete_send(hci_evt_mask_set(ra, s0, a1, 0x03, out a0_12, out a3_15), s0, s1, a3_15, a0_12, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_64, out s1_65, out s2_66, out s3_67, out s5_68);
}

// 23039CE0: void hci_set_ctrl_to_host_flow_ctrl_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 byte) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_set_ctrl_to_host_flow_ctrl_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, byte * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	up32 a5_7 = (word32) *a1;
	Eq_2 a1_33 = 0x12;
	if (a5_7 <= 0x03)
	{
		ptr32 a0_11 = 0x01;
		if (a5_7 != 0x01)
			a0_11 = (word32) (a5_7 < ~0x03);
		Eq_2 a0_22;
		ra = hci_fc_acl_en(ra, s0, a0_11, out s1, out a0_22);
		a1_33 = a0_22;
	}
	word32 s5_105;
	word32 s2_103;
	word32 s3_104;
	word32 s0_101;
	word32 s1_102;
	llm_common_cmd_complete_send(ra, s0, s1, a3, a1_33, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_101, out s1_102, out s2_103, out s3_104, out s5_105);
}

// 23039D16: void hci_reset_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg48, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void hci_reset_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg48, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 a3_17;
	Eq_2 s1_24;
	Eq_2 s2_25;
	Eq_2 s3_26;
	Eq_2 s5_28;
	word32 a4_87;
	word32 a5_88;
	word32 mstatus_89;
	word32 s0_90;
	word32 s1_91;
	word32 s2_92;
	word32 s3_93;
	word32 s5_94;
	llm_common_cmd_complete_send(rwip_reset(ra, s1, s2, s3, s4, s5, mstatus, dwArg48, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s1_24, out a3_17, out a4_87, out a5_88, out s2_25, out s3_26, out s5_28, out mstatus_89), s0, s1_24, a3_17, 0x00, s2_25, s3_26, s5_28, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_90, out s1_91, out s2_92, out s3_93, out s5_94);
}

// 23039D32: void hci_le_tx_test_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_le_tx_test_cmd_handler(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	Eq_2 a1_14;
	Eq_2 s0_18;
	word32 s8_111;
	word32 a4_110;
	Eq_2 a0_13;
	Eq_2 ra_17 = ble_ke_state_get(ra, a3, 0x00, out s0_18, out a0_13, out a1_14, out a4_110, out s8_111);
	if (a0_13 == 0x00)
	{
		if (s0_18 == 0x0200001E)
			a0_13 = llm_test_mode_start_tx(ra_17, a1_14, s4, mstatus, out s5);
	}
	else
		a0_13.u0 = 0x0C;
	word32 s2_114;
	word32 s3_115;
	word32 s1_113;
	word32 s0_112;
	word32 s5_116;
	llm_common_cmd_complete_send(ra_17, s0_18, s1, s0_18, a0_13, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_112, out s1_113, out s2_114, out s3_115, out s5_116);
}

// 23039D6A: void hci_le_rx_test_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack word32 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8)
void hci_le_rx_test_cmd_handler(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, word32 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8)
{
	Eq_2 a1_14;
	Eq_2 s0_18;
	word32 s8_124;
	word32 a4_123;
	Eq_2 a0_13;
	Eq_2 ra_17 = ble_ke_state_get(ra, a3, 0x00, out s0_18, out a0_13, out a1_14, out a4_123, out s8_124);
	if (a0_13 == 0x00)
	{
		if (s0_18 == 0x0200001D)
			ra_17 = llm_test_mode_start_rx(ra_17, a1_14, dwArg08, dwArg18, dwArg38, dwArg58, dwArg5C, dwArg84, dwArgA0, dwArgA4, dwArgAC, dwArgC8, dwArgD8, out s1, out a0_13, out s2, out s3, out s5);
	}
	else
		a0_13.u0 = 0x0C;
	word32 s3_128;
	word32 s2_127;
	word32 s1_126;
	word32 s0_125;
	word32 s5_129;
	llm_common_cmd_complete_send(ra_17, s0_18, s1, s0_18, a0_13, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_125, out s1_126, out s2_127, out s3_128, out s5_129);
}

// 23039DA2: void hci_le_rand_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0118)
void hci_le_rand_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0118)
{
	Eq_2 a0_17;
	struct Eq_64398 * a2_19;
	Eq_2 s2_29;
	Eq_2 s3_30;
	word32 s0_114;
	word32 s1_115;
	word32 a1_116;
	word32 a3_117;
	word32 a4_118;
	word32 a6_119;
	word32 a7_120;
	word32 s4_121;
	word32 s8_122;
	word32 mstatus_123;
	Eq_2 ra_26 = ble_ke_msg_alloc(ra, s0, s1, 0x00FFF801, 0x00, 0x02000018, 0x09, s2, s3, dwArg0118, out s0_114, out s1_115, out a0_17, out a1_116, out a2_19, out a3_117, out a4_118, out a6_119, out a7_120, out s2_29, out s3_30, out s4_121, out s8_122, out mstatus_123);
	uint32 a0_37;
	struct Eq_64398 * a2_38;
	word32 a1_124;
	word32 a3_125;
	word32 a4_126;
	word32 a5_127;
	word32 s4_128;
	word32 s8_129;
	bl_rand(a0_17, a2_19, out a0_37, out a1_124, out a2_38, out a3_125, out a4_126, out a5_127, out s4_128, out s8_129);
	*((word32) a0_17 + 1) = (byte) a0_37;
	*((word32) a0_17 + 2) = (byte) (a0_37 >> 0x08);
	*((word32) a0_17 + 3) = (byte) (a0_37 >> 0x10);
	*((word32) a0_17 + 4) = (byte) (a0_37 >> 24);
	uint32 a0_55;
	Eq_2 s4_63;
	word32 a1_130;
	word32 a2_131;
	word32 a3_132;
	word32 a4_133;
	word32 a5_134;
	word32 s8_135;
	bl_rand(a0_37 >> 24, a2_38, out a0_55, out a1_130, out a2_131, out a3_132, out a4_133, out a5_134, out s4_63, out s8_135);
	*((word32) a0_17 + 5) = (byte) a0_55;
	*((word32) a0_17 + 6) = (byte) (a0_55 >> 0x08);
	*((word32) a0_17 + 8) = (byte) (a0_55 >> 24);
	*((word32) a0_17 + 7) = (byte) (a0_55 >> 0x10);
	*a0_17 = 0x00;
	word32 tp_136;
	word32 s0_137;
	word32 s1_138;
	word32 a0_139;
	word32 a2_140;
	word32 a3_141;
	word32 a4_142;
	word32 s2_143;
	word32 s3_144;
	word32 s4_145;
	word32 s5_146;
	word32 s6_147;
	word32 s7_148;
	word32 s9_149;
	word32 s10_150;
	word32 mstatus_151;
	hci_send_2_host(ra_26, a0_17, a0_17, s2_29, s3_30, s4_63, s5, dwArg00, dwArg04, dwArg28, out tp_136, out s0_137, out s1_138, out a0_139, out a2_140, out a3_141, out a4_142, out s2_143, out s3_144, out s4_145, out s5_146, out s6_147, out s7_148, out s9_149, out s10_150, out mstatus_151);
}

