pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23039E0C: void hci_le_enc_cmd_handler(Register Eq_2 ra, Register Eq_2 a1, Register ptr32 mstatus)
void hci_le_enc_cmd_handler(Eq_2 ra, Eq_2 a1, ptr32 mstatus)
{
	*((word32) a1 + 0x0FF8) = 0x04;
	*((word32) a1 + 0x0FFC) = 0x08;
	struct Eq_181524 * s1_24;
	word32 a0_60;
	word32 a5_61;
	Eq_2 ra_23 = ble_co_list_push_back(ra, a1, 0x42026000, 0x42026460, (word32) a1 - 0x0C, out s1_24, out a0_60, out a5_61);
	if ((word32) s1_24->b04B8 == 0x00)
		llm_encryption_start(ra_23, a1, a1, mstatus);
}

// 23039E4C: void hci_le_wl_mngt_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArg44, Stack Eq_2 dwArg54, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void hci_le_wl_mngt_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArg44, Eq_2 dwArg54, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0128)
{
	Eq_2 s2_128 = a0;
	Eq_2 s1_127 = a1;
	Eq_2 s3_129 = a3;
	ui32 a0_21;
	word32 a1_267;
	word32 s8_269;
	word32 a4_268;
	Eq_2 s0_100;
	Eq_2 ra_139 = ble_ke_state_get(ra, s0, 0x00, out s0_100, out a0_21, out a1_267, out a4_268, out s8_269);
	if ((a0_21 & 0x00F0) == 0x10)
	{
		s0_100.u0 = 0x0C;
		if ((word32) g_ptr42026474->b001B != 0x00)
			goto l23039EC6;
	}
	if ((a0_21 & 0x0F) <= ~0x01)
	{
		s0_100.u0 = 0x0C;
		if ((word32) *((word32) g_t42026470 + 8) != 0x00)
			goto l23039EC6;
	}
	Eq_2 a0_57;
	if (a0 != 0x02000011)
	{
		if (a0 != 0x02000012)
		{
			s0_100.u0 = 0x00;
			if (a0 == 0x02000010)
			{
				word32 s1_275;
				word32 s4_278;
				word32 s3_277;
				word32 s2_276;
				llm_wl_clr(out s1_275, out s2_276, out s3_277, out s4_278);
				word32 a0_279;
				s0_100 = llm_util_bl_check(0x00, 0x00, 0x01, dwArg44, ra, dwArgF8, out s1_127, out a0_279, out s2_128, out s3_129);
			}
			goto l23039EC6;
		}
		ra_139 = llm_wl_dev_rem_hdl(ra_139, s0_100, (word32) a1 + 1, (word32) *a1, dwArg04, dwArg24, dwArg44, dwArgB8, dwArgC8, dwArgD8, out s1_127, out a0_57, out s2_128, out s3_129, out s5);
	}
	else
		ra_139 = llm_wl_dev_add_hdl(ra_139, (word32) a1 + 1, (word32) *a1, dwArg08, dwArg14, dwArg34, dwArg54, dwArgC8, dwArgD8, dwArgE8, out s1_127, out a0_57, out s2_128, out s3_129, out s5);
	s0_100 = a0_57;
l23039EC6:
	word32 s1_271;
	word32 s5_274;
	word32 s3_273;
	word32 s2_272;
	word32 s0_270;
	llm_common_cmd_complete_send(ra_139, s0_100, s1_127, s3_129, s0_100, s2_128, s3_129, s5, s2, s0, dwArg08, dwArgE8, out s0_270, out s1_271, out s2_272, out s3_273, out s5_274);
	0x00 = dwArg0128;
}

// 23039EFC: void hci_le_set_host_ch_class_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg88, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void hci_le_set_host_ch_class_cmd_handler(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg88, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 s0_49 = 0x42026460;
	Eq_2 s2_18 = a1;
	Eq_2 s3_20 = a3;
	Eq_2 a1_21 = 0x0C;
	if ((word32) g_b42026497 != 0x00)
	{
		word32 s1_50;
		word32 a3_160;
		word32 a5_161;
		word32 s4_162;
		word32 s6_163;
		word32 mstatus_164;
		ra = ble_ke_timer_set(ra, 0x42026460, llm_util_check_map_validity(a1, 0x05, out a3_160), 0x00, 0x00, 100, a1, a3, s4, s5, s6, dwLoc10, dwArg88, dwArgE8, out s0_49, out s1_50, out a5_161, out s2_18, out s3_20, out s4_162, out s5, out s6_163, out mstatus_164);
		*((word32) s0_49 + 55) = 0x00;
		s1 = s1_50 + ~0x01 & 0x00FF;
		a1_21.u0 = 0x12;
		if (s1 <= 35)
		{
			word32 a1_165;
			word32 a2_166;
			word32 a3_167;
			word32 a4_168;
			word32 a5_169;
			word32 a6_170;
			word32 a7_171;
			memcpy((word32) s0_49 + 50, s2_18, 0x05, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out a6_170, out a7_171);
			a1_21.u0 = 0x00;
		}
	}
	word32 s5_159;
	word32 s3_158;
	word32 s2_157;
	word32 s1_156;
	word32 s0_155;
	llm_common_cmd_complete_send(ra, s0_49, s1, s3_20, a1_21, s2_18, s3_20, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_155, out s1_156, out s2_157, out s3_158, out s5_159);
}

// 23039F6A: void hci_le_create_con_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArgD8, Stack ptr32 dwArgE8, Stack Eq_2 dwArgF8)
void hci_le_create_con_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArgD8, ptr32 dwArgE8, Eq_2 dwArgF8)
{
	Eq_2 a1_64;
	Eq_2 s1_14 = a3;
	Eq_181783 a0_15;
	Eq_2 a1_16;
	word32 s8_249;
	word32 a4_248;
	Eq_2 s0_20;
	Eq_2 ra_19 = ble_ke_state_get(ra, s0, 0x00, out s0_20, out a0_15, out a1_16, out a4_248, out s8_249);
	if (a0_15 != 0x10)
	{
		Eq_181783 a4_29;
		if (a0_15 <= 0x10)
		{
			if (a0_15 != 0x00)
			{
				a4_29.u0 = 0x03;
				goto l23039F90;
			}
		}
		else if (a0_15 != 32)
		{
			if (a0_15 == 35)
				return;
			a4_29.u0 = 0x13;
l23039F90:
			a1_64.u0 = 0x0C;
			if (a0_15 == a4_29)
				return;
l23039FDE:
			word32 s10_255;
			word32 s9_254;
			word32 s7_253;
			word32 a2_252;
			word32 s1_251;
			word32 s0_250;
			llm_common_cmd_status_send(ra_19, s0_20, s1_14, s1_14, a1_64, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_250, out s1_251, out a2_252, out s7_253, out s9_254, out s10_255);
			return;
		}
	}
	Eq_2 a0_35;
	ra_19 = llm_create_con(ra_19, a1_16, dwArg18, dwArg44, a1, dwArgD8, dwArgE8, dwArgF8, out s1_14, out a0_35, out s2, out s3, out s5);
	a1_64 = a0_35;
	if (a0_35 == 0x00)
	{
		g_w420264AE = (word16) s1_14;
		word32 a0_69;
		word32 s8_257;
		word32 a4_256;
		ra_19 = ble_ke_state_get(ra_19, 0x42026460, a0_35, out s0_20, out a0_69, out a1_64, out a4_256, out s8_257);
		*((word32) s0_20 + 80) = (byte) a0_69;
		((word32) s0_20 + 76)->u0 = 0x01;
	}
	goto l23039FDE;
}

