pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 23039FE8: void hci_le_set_scan_en_cmd_handler(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void hci_le_set_scan_en_cmd_handler(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a1_115;
	Eq_2 s1_118 = a3;
	Eq_181882 a0_17;
	word32 a1_392;
	word32 s8_394;
	word32 a4_393;
	Eq_2 s0_121;
	Eq_2 ra_124 = ble_ke_state_get(ra, a1, 0x00, out s0_121, out a0_17, out a1_392, out a4_393, out s8_394);
	if (a0_17 != 0x12)
	{
		if (a0_17 <= 0x12)
		{
			if (a0_17 == 0x02)
				goto l2303A0B6;
			Eq_181882 a4_37;
			if (a0_17 <= 0x02)
				a4_37.u0 = 0x01;
			else
			{
				if (a0_17 == 0x03)
					goto l2303A096;
				a4_37.u0 = 0x11;
			}
			if (a0_17 != a4_37)
			{
l2303A018:
				a1_115.u0 = 0x0C;
				if ((word32) *s0_121 != 0x01)
					goto l2303A054;
l2303A024:
				word32 a1_400;
				word32 a0_61;
				word32 a4_401;
				word32 s8_402;
				Eq_2 ra_65 = ble_ke_state_get(ra_124, s0_121, 0x00, out s0_121, out a0_61, out a1_400, out a4_401, out s8_402);
				g_b420264B0 = (byte) a0_61;
				g_w420264AE = (word16) a3;
				g_b420264AC = 0x01;
				Eq_2 a0_86;
				ra_124 = llm_set_scan_en(ra_65, s0_121, &g_t42026460, dwLoc08, dwArg18, dwArg28, dwArg80, dwArg84, dwArg8C, dwArgA8, dwArgB8, dwArgE8, dwArgF8, out s1_118, out a0_86, out s2, out s3, out s5);
				a1_115 = a0_86;
				if (a0_86 == 0x00 && (word32) (*s0_121) != s2)
					goto l2303A096;
l2303A054:
				word32 s3_398;
				word32 s0_395;
				word32 s1_396;
				word32 s2_397;
				word32 s5_399;
				llm_common_cmd_complete_send(ra_124, s0_121, s1_118, s1_118, a1_115, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_395, out s1_396, out s2_397, out s3_398, out s5_399);
				g_b420264B0 = (byte) ((word32) g_b420264B0 & ~0x0F);
				g_b420264AC = 0x01;
				goto l2303A096;
			}
l2303A0B0:
			if ((word32) *s0_121 == 0x00)
				goto l2303A024;
			goto l2303A0B6;
		}
		if (a0_17 == 33)
			goto l2303A0B0;
		Eq_181882 a4_29;
		if (a0_17 <= 33)
		{
			a4_29.u0 = 0x13;
			goto l2303A090;
		}
		if (a0_17 != 0x0022)
		{
			a4_29.u0 = 35;
l2303A090:
			if (a0_17 == a4_29)
			{
l2303A096:
				0x00 = dwArg38;
				return;
			}
			goto l2303A018;
		}
	}
l2303A0B6:
	a1_115.u0 = 0x0C;
	goto l2303A054;
}

// 2303A0BA: void hci_le_set_scan_param_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_le_set_scan_param_cmd_handler(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	int32 a0_13;
	Eq_2 a1_14;
	Eq_2 s0_18;
	word32 s8_107;
	word32 a4_106;
	Eq_2 ra_17 = ble_ke_state_get(ra, a3, 0x00, out s0_18, out a0_13, out a1_14, out a4_106, out s8_107);
	Eq_2 a5_22 = 0x0C;
	if (a0_13 != 0x11 && (a0_13 != 33 && a0_13 != 0x01))
	{
		Eq_2 a0_27;
		ra_17 = llm_set_scan_param(ra_17, a1_14, out s1, out a0_27);
		a5_22 = a0_27;
	}
	word32 s3_111;
	word32 s2_110;
	word32 s1_109;
	word32 s0_108;
	word32 s5_112;
	llm_common_cmd_complete_send(ra_17, s0_18, s1, s0_18, a5_22, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_108, out s1_109, out s2_110, out s3_111, out s5_112);
}

// 2303A0FC: void hci_le_set_scan_rsp_data_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_le_set_scan_rsp_data_cmd_handler(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	Eq_2 a1_46;
	Eq_2 s0_50;
	Eq_2 s2_18 = a3;
	struct Eq_182061 * a0_19;
	word32 a1_188;
	word32 s8_190;
	word32 a4_189;
	Eq_2 s0_24;
	Eq_2 ra_23 = ble_ke_state_get(ra, a1, 0x00, out s0_24, out a0_19, out a1_188, out a4_189, out s8_190);
	if (a0_19 <= (struct Eq_182061 *) ~0x12)
	{
		if ((word32) *s0_24 <= 0x1F)
		{
			s3 = __csrrs(mstatus, 0x00);
			__csrrc(mstatus, 0x08);
			Eq_2 a5_58 = a0_19->tFFFFFFF4;
			if (a0_19 != (struct Eq_182061 *) ~0x0F)
			{
				word32 a3_197;
				word32 s4_199;
				word32 a4_198;
				word32 s1_194;
				word32 a2_196;
				word32 a0_195;
				word32 tp_193;
				ra_23 = ble_ke_msg_free(ra_23, s0_24, 0x42026460, (char *) a0_19 - 16, a3, s3, s4, s5, out tp_193, out s0_24, out s1_194, out a0_195, out a2_196, out a3_197, out a4_198, out a5_58, out s2_18, out s3, out s4_199, out s5, out mstatus);
				*((word32) a5_58 + 4) = 0x00;
			}
			__csrrw(mstatus, 0x00);
			s1 = *((word32) a5_58 + 20);
			*((word32) s0_24 - 8) = a5_58;
			a1_46.u0 = 0x00;
			s0_50.u0 = 0x01;
l2303A156:
			word32 s3_203;
			word32 s5_204;
			word32 s0_200;
			word32 s2_202;
			word32 s1_201;
			llm_common_cmd_complete_send(ra_23, s0_50, s1, s2_18, a1_46, s2_18, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_200, out s1_201, out s2_202, out s3_203, out s5_204);
			return;
		}
		a1_46.u0 = 0x12;
	}
	else
	{
		Eq_2 a0_30;
		word32 a5_191;
		word32 s4_192;
		ra_23 = llm_set_scan_rsp_data(ra_23, s0_24, out s1, out a0_30, out a5_191, out s4_192);
		a1_46 = a0_30;
	}
	s0_50.u0 = 0x00;
	goto l2303A156;
}

// 2303A17C: void hci_le_set_adv_en_cmd_handler(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void hci_le_set_adv_en_cmd_handler(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a0_26;
	Eq_2 s1_14 = a3;
	up32 a0_15;
	word32 a1_244;
	word32 a4_245;
	word32 s8_246;
	Eq_2 s0_20;
	Eq_2 ra_19 = ble_ke_state_get(ra, a1, 0x00, out s0_20, out a0_15, out a1_244, out a4_245, out s8_246);
	if (a0_15 >= 0x10)
	{
		if (a0_15 <= 0x13)
		{
			a0_26.u0 = 0x0C;
			if ((word32) *s0_20 != 0x00)
				goto l2303A1FA;
l2303A1BA:
			word32 a0_39;
			word32 a1_247;
			word32 a4_248;
			word32 s8_249;
			Eq_2 ra_43 = ble_ke_state_get(ra_19, s0_20, 0x00, out s0_20, out a0_39, out a1_247, out a4_248, out s8_249);
			g_b420264CE = (byte) a0_39;
			g_w420264CC = (word16) a3;
			ra_19 = llm_set_adv_en(ra_43, s0_20, &g_t42026460, s7, dwArgB8, dwArgE8, dwArgF8, out s1_14, out a0_26, out s2, out s3, out s5);
			if (a0_26 == 0x00 && (word32) (*s0_20) != 0x01)
				goto l2303A1E2;
l2303A1FA:
			word32 s0_250;
			word32 s1_251;
			word32 s2_252;
			word32 s3_253;
			word32 s5_254;
			llm_common_cmd_complete_send(ra_19, s0_20, s1_14, s1_14, a0_26, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_250, out s1_251, out s2_252, out s3_253, out s5_254);
l2303A1E2:
			g_b420264AC = 0x00;
			return;
		}
		if ((a0_15 + ~0x1F & 0x00FF) <= 0x03)
			return;
	}
	a0_26.u0 = 0x0C;
	if ((word32) *s0_20 != 0x01)
		goto l2303A1FA;
	goto l2303A1BA;
}

// 2303A204: void hci_le_set_adv_data_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8)
void hci_le_set_adv_data_cmd_handler(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgF8)
{
	Eq_2 a1_46;
	Eq_2 s0_50;
	Eq_2 s2_18 = a3;
	struct Eq_182278 * a0_19;
	word32 a1_188;
	word32 s8_190;
	word32 a4_189;
	Eq_2 s0_24;
	Eq_2 ra_23 = ble_ke_state_get(ra, a1, 0x00, out s0_24, out a0_19, out a1_188, out a4_189, out s8_190);
	if (a0_19 <= (struct Eq_182278 *) ~0x12)
	{
		if ((word32) *s0_24 <= 0x1F)
		{
			s3 = __csrrs(mstatus, 0x00);
			__csrrc(mstatus, 0x08);
			struct Eq_182316 * a5_58 = a0_19->ptrFFFFFFF0;
			if (a0_19 != (struct Eq_182278 *) ~0x0F)
			{
				word32 a3_197;
				word32 s4_199;
				word32 a4_198;
				word32 s1_194;
				word32 a2_196;
				word32 a0_195;
				word32 tp_193;
				ra_23 = ble_ke_msg_free(ra_23, s0_24, 0x42026460, &a0_19->ptrFFFFFFF0, a3, s3, s4, s5, out tp_193, out s0_24, out s1_194, out a0_195, out a2_196, out a3_197, out a4_198, out a5_58, out s2_18, out s3, out s4_199, out s5, out mstatus);
				a5_58->dw0000 = 0x00;
			}
			__csrrw(mstatus, 0x00);
			s1 = a5_58->t0014;
			*((word32) s0_24 - 0x0C) = a5_58;
			a1_46.u0 = 0x00;
			s0_50.u0 = 0x01;
l2303A25E:
			word32 s3_203;
			word32 s5_204;
			word32 s0_200;
			word32 s2_202;
			word32 s1_201;
			llm_common_cmd_complete_send(ra_23, s0_50, s1, s2_18, a1_46, s2_18, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_200, out s1_201, out s2_202, out s3_203, out s5_204);
			return;
		}
		a1_46.u0 = 0x12;
	}
	else
	{
		Eq_2 a0_30;
		word32 a5_191;
		word32 s4_192;
		ra_23 = llm_set_adv_data(ra_23, s0_24, out s1, out a0_30, out a5_191, out s4_192);
		a1_46 = a0_30;
	}
	s0_50.u0 = 0x00;
	goto l2303A25E;
}

// 2303A284: void hci_le_set_adv_param_cmd_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack word32 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg28, Stack Eq_2 dwArgF8)
void hci_le_set_adv_param_cmd_handler(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, word32 dwArg08, Eq_2 dwArg18, word32 dwArg28, Eq_2 dwArgF8)
{
	up32 a0_13;
	Eq_2 a1_14;
	word32 s8_110;
	word32 a4_109;
	Eq_2 s0_18;
	Eq_2 ra_17 = ble_ke_state_get(ra, a3, 0x00, out s0_18, out a0_13, out a1_14, out a4_109, out s8_110);
	Eq_2 a0_24 = 0x0C;
	if (a0_13 > ~0x12)
		ra_17 = llm_set_adv_param(ra_17, a1_14, s2, s3, dwLoc20, dwLoc1C, dwArg08, dwArg28, out s0_18, out s1, out a0_24, out s2, out s3);
	word32 s3_114;
	word32 s2_113;
	word32 s1_112;
	word32 s0_111;
	word32 s5_115;
	llm_common_cmd_complete_send(ra_17, s0_18, s1, s0_18, a0_24, s2, s3, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_111, out s1_112, out s2_113, out s3_114, out s5_115);
}

// 2303A2BA: void hci_le_set_rand_add_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg0108)
void hci_le_set_rand_add_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg0108)
{
	Eq_2 s1_14 = a1;
	Eq_2 s2_16 = a3;
	word32 a0_17;
	word32 s8_136;
	word32 a4_135;
	word32 a1_134;
	word32 s0_133;
	Eq_2 ra_21 = ble_ke_state_get(ra, s0, 0x00, out s0_133, out a0_17, out a1_134, out a4_135, out s8_136);
	Eq_2 s0_25 = 0x0C;
	if (a0_17 == 0x00)
	{
		word32 a3_32;
		word32 a2_142;
		word32 a4_143;
		word32 a5_144;
		if (co_bdaddr_compare(a1, 0x230CB978, out a2_142, out a3_32, out a4_143, out a5_144) == 0x00)
		{
			<anonymous> * a5_37 = g_ptr4200F3D0;
			a5_37();
		}
		else
			s0_25.u0 = 0x12;
	}
	word32 s3_140;
	word32 s2_139;
	word32 s1_138;
	word32 s0_137;
	word32 s5_141;
	llm_common_cmd_complete_send(ra_21, s0_25, s1_14, s2_16, s0_25, s2_16, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_137, out s1_138, out s2_139, out s3_140, out s5_141);
	0x00 = dwArg38;
}

