pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303A314: void hci_le_rd_local_p256_public_key_cmd_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0108)
void hci_le_rd_local_p256_public_key_cmd_handler(Eq_2 ra, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg0108)
{
	Eq_2 s1_12 = (word32) g_b42026533;
	if (s1_12 != 0x00)
		s1_12.u0 = 0x0C;
	struct Eq_64398 * a2_32;
	struct Eq_182505 * s0_40;
	word32 s1_41;
	word32 s10_42;
	word32 s7_49;
	word32 s9_51;
	Eq_2 ra_39 = llm_common_cmd_status_send(ra, 0x42026460, s1_12, a3, s1_12, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_40, out s1_41, out a2_32, out s7_49, out s9_51, out s10_42);
	if (s1_41 == 0x00)
	{
		word32 s4_144;
		Eq_2 s1_66 = ecc_gen_new_secret_key(0x42026513, 0x00, a2_32, dwArg28, out s4_144);
		s0_40->b00D3 = 0x01;
		ecc_gen_new_public_key(ra_39, (word32) s1_66 + 1299, 0x06, 0x00, s7_49, s9_51, s10_42);
	}
}

// 2303A366: void hci_le_test_end_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void hci_le_test_end_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	struct Eq_182552 * a0_8;
	Eq_2 s0_13;
	word32 a1_151;
	word32 a4_152;
	word32 s8_153;
	Eq_2 ra_12 = ble_ke_state_get(ra, s0, 0x00, out s0_13, out a0_8, out a1_151, out a4_152, out s8_153);
	if (a0_8 == (struct Eq_182552 *) 36)
	{
		struct Eq_155911 * a5_77 = a0_8->ptr0048;
		a5_77->b0059 = 0x01;
		word32 s0_179;
		word32 s1_180;
		word32 a0_181;
		word32 a2_182;
		word32 a4_183;
		word32 a5_184;
		word32 s2_185;
		word32 s3_186;
		word32 s4_187;
		word32 mstatus_188;
		ble_ke_state_set(lld_test_stop(ra_12, s0_13, a5_77), s0_13, s1, 0x00, 35, dwArgF8, out s0_179, out s1_180, out a0_181, out a2_182, out a4_183, out a5_184, out s2_185, out s3_186, out s4_187, out mstatus_188);
	}
	else
	{
		Eq_2 a0_26;
		Eq_2 s0_36;
		Eq_2 s2_38;
		Eq_2 s3_39;
		Eq_2 s4_40;
		word32 s1_154;
		word32 a1_155;
		word32 a2_156;
		word32 a3_157;
		word32 a4_158;
		word32 a6_159;
		word32 a7_160;
		word32 s8_161;
		word32 mstatus_162;
		Eq_2 ra_35 = ble_ke_msg_alloc(ra_12, s0_13, s1, 0x00FFF801, 0x00, 0x0200001F, 0x04, s2, s3, dwArg0118, out s0_36, out s1_154, out a0_26, out a1_155, out a2_156, out a3_157, out a4_158, out a6_159, out a7_160, out s2_38, out s3_39, out s4_40, out s8_161, out mstatus_162);
		*((word32) a0_26 + 2) = 0x00;
		*a0_26 = 0x0C;
		word32 tp_163;
		word32 s0_164;
		word32 s1_165;
		word32 a0_166;
		word32 a2_167;
		word32 a3_168;
		word32 a4_169;
		word32 s2_170;
		word32 s3_171;
		word32 s4_172;
		word32 s5_173;
		word32 s6_174;
		word32 s7_175;
		word32 s9_176;
		word32 s10_177;
		word32 mstatus_178;
		hci_send_2_host(ra_35, s0_36, a0_26, s2_38, s3_39, s4_40, s5, dwArg00, dwArg04, dwArg28, out tp_163, out s0_164, out s1_165, out a0_166, out a2_167, out a3_168, out a4_169, out s2_170, out s3_171, out s4_172, out s5_173, out s6_174, out s7_175, out s9_176, out s10_177, out mstatus_178);
	}
}

// 2303A3C0: void hci_le_create_con_cancel_cmd_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void hci_le_create_con_cancel_cmd_handler(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a0_13;
	Eq_2 s0_18;
	word32 a1_178;
	word32 a4_179;
	word32 s8_180;
	Eq_2 ra_17 = ble_ke_state_get(ra, s0, 0x00, out s0_18, out a0_13, out a1_178, out a4_179, out s8_180);
	if (a0_13 != 0x12 && (a0_13 != 0x0022 && a0_13 != 0x02))
	{
		word32 s0_204;
		word32 s1_205;
		word32 s2_206;
		word32 s3_207;
		word32 s5_208;
		llm_common_cmd_complete_send(ra_17, s0_18, a3, a3, 0x0C, s2, s3, s5, dwArg00, dwArg04, dwArg28, dwArg0108, out s0_204, out s1_205, out s2_206, out s3_207, out s5_208);
	}
	else
	{
		Eq_2 s0_59 = *((word32) a0_13 + 84);
		Eq_2 s1_75;
		word32 a0_181;
		word32 a3_182;
		word32 s2_183;
		word32 s3_184;
		word32 s4_185;
		word32 s5_186;
		word32 s6_187;
		word32 s7_188;
		word32 s8_189;
		word32 mstatus_190;
		Eq_2 ra_74 = lld_scan_stop(ra_17, a0_13, s2, mstatus, dwArgC8, dwArg0108, out s1_75, out a0_181, out a3_182, out s2_183, out s3_184, out s4_185, out s5_186, out s6_187, out s7_188, out s8_189, out mstatus_190);
		ui32 a5_91 = (word32) *((word32) s0_59 + 80);
		*((word32) s0_59 + 78) = (word16) s1_75;
		*((word32) s0_59 + 80) = (byte) (a5_91 & ~0x0F | 2);
		((word32) s0_59 + 76)->u0 = 0x01;
		ui32 a0_99;
		Eq_2 s0_104;
		word32 a1_191;
		word32 a4_192;
		word32 s8_193;
		word32 s0_194;
		word32 s1_195;
		word32 a0_196;
		word32 a2_197;
		word32 a4_198;
		word32 a5_199;
		word32 s2_200;
		word32 s3_201;
		word32 s4_202;
		word32 mstatus_203;
		ble_ke_state_set(ble_ke_state_get(ra_74, s0_59, 0x00, out s0_104, out a0_99, out a1_191, out a4_192, out s8_193), s0_104, s1_75, 0x00, a0_99 & 0x00F0 | 3, dwArgF8, out s0_194, out s1_195, out a0_196, out a2_197, out a4_198, out a5_199, out s2_200, out s3_201, out s4_202, out mstatus_203);
	}
}

// 2303A434: void hci_command_handler(Register word32 a3)
void hci_command_handler(word32 a3)
{
	struct Eq_182817 * a2_14 = g_a230B62CC;
	int32 a5_12;
	for (a5_12 = 0x00; a5_12 != 45; ++a5_12)
	{
		if ((word32) a2_14->w0000 == a3)
		{
			<anonymous> * t1_19 = g_a230B62D0[a5_12];
			if (t1_19 == null)
				return;
			word32 a3_30;
			word32 t1_31;
			t1_19();
			return;
		}
		++a2_14;
	}
}

// 2303A46C: void bearer2str(Register word32 a0)
// Called from:
//      link_close
//      link_open
//      blemesh_pb
void bearer2str(word32 a0)
{
	if (a0 == 0x01)
		return;
	if (a0 == 0x02)
		;
}

// 2303A496: void fault_test(Register word32 a1, Register int32 a2)
void fault_test(word32 a1, int32 a2)
{
}

// 2303A4A6: void attn_on()
void attn_on()
{
}

