pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303A4A8: void lpn_cb(Register Eq_2 ra, Register word32 a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void lpn_cb(Eq_2 ra, word32 a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	struct Eq_274 * a0_10;
	if (a1 != 0x00)
		a0_10 = (struct Eq_274 *) &g_t230B69D0;
	else
		a0_10 = (struct Eq_274 *) &g_t230B6A04;
	word32 a3_57;
	word32 a4_58;
	word32 a2_56;
	word32 a1_55;
	word32 a0_54;
	word32 s1_53;
	word32 a5_59;
	word32 a7_60;
	word32 s2_61;
	word32 s3_62;
	word32 s4_63;
	word32 s5_64;
	word32 s6_65;
	word32 s7_66;
	word32 s8_67;
	word32 s9_68;
	word32 s10_69;
	word32 s11_70;
	word32 t4_71;
	printf(ra, a0_10, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_53, out a0_54, out a1_55, out a2_56, out a3_57, out a4_58, out a5_59, out a7_60, out s2_61, out s3_62, out s4_63, out s5_64, out s6_65, out s7_66, out s8_67, out s9_68, out s10_69, out s11_70, out t4_71);
}

// 2303A4C4: void fault_get_reg(Register Eq_2 ra, Register int32 a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack (ptr32 byte) dwArgA4)
void fault_get_reg(Eq_2 ra, int32 a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, byte * dwArgA4)
{
	if (a1 != 1521)
	{
		word32 s10_240;
		word32 s11_241;
		word32 t4_242;
		word32 s7_237;
		word32 s8_238;
		word32 s9_239;
		word32 s4_234;
		word32 s5_235;
		word32 s6_236;
		word32 a7_231;
		word32 s2_232;
		word32 s3_233;
		word32 a3_228;
		word32 a4_229;
		word32 a5_230;
		word32 a0_225;
		word32 a1_226;
		word32 a2_227;
		word32 s1_224;
		printf(ra, &g_t230B685C, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_224, out a0_225, out a1_226, out a2_227, out a3_228, out a4_229, out a5_230, out a7_231, out s2_232, out s3_233, out s4_234, out s5_235, out s6_236, out s7_237, out s8_238, out s9_239, out s10_240, out s11_241, out t4_242);
	}
	else
	{
		byte * a4_22;
		word32 s11_222;
		word32 t4_223;
		word32 s8_219;
		word32 s9_220;
		word32 s10_221;
		word32 s5_216;
		word32 s6_217;
		word32 s7_218;
		word32 s2_213;
		word32 s3_214;
		word32 s4_215;
		word32 a2_210;
		word32 a5_211;
		word32 a7_212;
		word32 s1_207;
		word32 a0_208;
		word32 a1_209;
		byte * a3_104;
		printf(ra, &g_t230B6890, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_207, out a0_208, out a1_209, out a2_210, out a3_104, out a4_22, out a5_211, out a7_212, out s2_213, out s3_214, out s4_215, out s5_216, out s6_217, out s7_218, out s8_219, out s9_220, out s10_221, out s11_222, out t4_223);
		*dwArgA4 = 0x00;
		up32 a0_43 = (word32) *a4_22;
		*a4_22 = 0x00;
		byte * a5_44 = g_a4200F40C;
		while ((word32) *a4_22 < a0_43)
		{
			word32 a1_55 = (word32) *a5_44;
			if (a1_55 != 0x00)
			{
				*a3_104 = (byte) a1_55;
				*a4_22 = (byte) ((word32) *a4_22 + 0x01);
				++a3_104;
			}
			++a5_44;
			if (a5_44 == (byte *) ~0x4200F403)
				break;
		}
	}
}

// 2303A540: void prov_reset(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void prov_reset(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	word32 a7_43;
	word32 s2_44;
	word32 s3_45;
	word32 s4_46;
	word32 s5_47;
	word32 s6_48;
	word32 s7_49;
	word32 s8_50;
	word32 s9_51;
	word32 s10_52;
	word32 s11_53;
	word32 t4_54;
	printf(ra, &g_t230B6AA8, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42, out a7_43, out s2_44, out s3_45, out s4_46, out s5_47, out s6_48, out s7_49, out s8_50, out s9_51, out s10_52, out s11_53, out t4_54);
}

// 2303A54C: void prov_complete(Register Eq_2 ra, Register word32 a1, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void prov_complete(Eq_2 ra, word32 a1, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_28;
	word32 a0_61;
	word32 a1_62;
	word32 a2_63;
	word32 a3_64;
	word32 a4_65;
	word32 a5_66;
	word32 a7_67;
	word32 s2_68;
	word32 s3_69;
	word32 s4_70;
	word32 s5_71;
	word32 s6_72;
	word32 s7_73;
	word32 s8_74;
	word32 s9_75;
	word32 s10_76;
	word32 s11_77;
	word32 t4_78;
	printf(ra, &g_t230B6A5C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_28, out a0_61, out a1_62, out a2_63, out a3_64, out a4_65, out a5_66, out a7_67, out s2_68, out s3_69, out s4_70, out s5_71, out s6_72, out s7_73, out s8_74, out s9_75, out s10_76, out s11_77, out t4_78);
	g_w4200F400 = (word16) s1_28;
	g_w4200F3FC = (word16) a1;
	g_w4200F3FE = (word16) a1;
}

// 2303A586: void link_close(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void link_close(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	bearer2str(a0);
	word32 s1_44;
	word32 a0_45;
	word32 a1_46;
	word32 a2_47;
	word32 a3_48;
	word32 a4_49;
	word32 a5_50;
	word32 a7_51;
	word32 s2_52;
	word32 s3_53;
	word32 s4_54;
	word32 s5_55;
	word32 s6_56;
	word32 s7_57;
	word32 s8_58;
	word32 s9_59;
	word32 s10_60;
	word32 s11_61;
	word32 t4_62;
	printf(ra, &g_t230B6988, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_44, out a0_45, out a1_46, out a2_47, out a3_48, out a4_49, out a5_50, out a7_51, out s2_52, out s3_53, out s4_54, out s5_55, out s6_56, out s7_57, out s8_58, out s9_59, out s10_60, out s11_61, out t4_62);
}

// 2303A5A0: void link_open(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void link_open(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	bearer2str(a0);
	word32 s1_44;
	word32 a0_45;
	word32 a1_46;
	word32 a2_47;
	word32 a3_48;
	word32 a4_49;
	word32 a5_50;
	word32 a7_51;
	word32 s2_52;
	word32 s3_53;
	word32 s4_54;
	word32 s5_55;
	word32 s6_56;
	word32 s7_57;
	word32 s8_58;
	word32 s9_59;
	word32 s10_60;
	word32 s11_61;
	word32 t4_62;
	printf(ra, &g_t230B69AC, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_44, out a0_45, out a1_46, out a2_47, out a3_48, out a4_49, out a5_50, out a7_51, out s2_52, out s3_53, out s4_54, out s5_55, out s6_56, out s7_57, out s8_58, out s9_59, out s10_60, out s11_61, out t4_62);
}

