pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303A5BA: void prov_input_complete(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void prov_input_complete(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	word32 a7_43;
	word32 s2_44;
	word32 s3_45;
	word32 s4_46;
	word32 s5_47;
	word32 s6_48;
	word32 s7_49;
	word32 s8_50;
	word32 s9_51;
	word32 s10_52;
	word32 s11_53;
	word32 t4_54;
	printf(ra, &g_t230B6A94, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42, out a7_43, out s2_44, out s3_45, out s4_46, out s5_47, out s6_48, out s7_49, out s8_50, out s9_51, out s10_52, out s11_53, out t4_54);
}

// 2303A5C6: void input(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void input(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	struct Eq_274 * a0_16;
	if (a0 != 0x04)
	{
		if (a0 != 0x08)
		{
			word32 s1_131;
			word32 a0_132;
			word32 a1_133;
			word32 a2_134;
			word32 a3_135;
			word32 a4_136;
			word32 a5_137;
			word32 a7_138;
			word32 s2_139;
			word32 s3_140;
			word32 s4_141;
			word32 s5_142;
			word32 s6_143;
			word32 s7_144;
			word32 s8_145;
			word32 s9_146;
			word32 s10_147;
			word32 s11_148;
			word32 t4_149;
			printf(ra, &g_t230B6958, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_131, out a0_132, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137, out a7_138, out s2_139, out s3_140, out s4_141, out s5_142, out s6_143, out s7_144, out s8_145, out s9_146, out s10_147, out s11_148, out t4_149);
			return;
		}
		a0_16 = (struct Eq_274 *) &g_t230B6920;
	}
	else
		a0_16 = (struct Eq_274 *) &g_t230B68E8;
	word32 s1_35;
	word32 a0_150;
	word32 a1_151;
	word32 a2_152;
	word32 a3_153;
	word32 a4_154;
	word32 a5_155;
	word32 a7_156;
	word32 s2_157;
	word32 s3_158;
	word32 s4_159;
	word32 s5_160;
	word32 s6_161;
	word32 s7_162;
	word32 s8_163;
	word32 s9_164;
	word32 s10_165;
	word32 s11_166;
	word32 t4_167;
	printf(ra, a0_16, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_35, out a0_150, out a1_151, out a2_152, out a3_153, out a4_154, out a5_155, out a7_156, out s2_157, out s3_158, out s4_159, out s5_160, out s6_161, out s7_162, out s8_163, out s9_164, out s10_165, out s11_166, out t4_167);
	g_b4200F3F8 = (byte) a0;
	g_b4200F3F9 = (byte) s1_35;
}

// 2303A624: void output_string(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void output_string(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_44;
	word32 a0_45;
	word32 a1_46;
	word32 a2_47;
	word32 a3_48;
	word32 a4_49;
	word32 a5_50;
	word32 a7_51;
	word32 s2_52;
	word32 s3_53;
	word32 s4_54;
	word32 s5_55;
	word32 s6_56;
	word32 s7_57;
	word32 s8_58;
	word32 s9_59;
	word32 s10_60;
	word32 s11_61;
	word32 t4_62;
	printf(ra, &g_t230B6A48, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_44, out a0_45, out a1_46, out a2_47, out a3_48, out a4_49, out a5_50, out a7_51, out s2_52, out s3_53, out s4_54, out s5_55, out s6_56, out s7_57, out s8_58, out s9_59, out s10_60, out s11_61, out t4_62);
}

// 2303A63E: void output_number(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void output_number(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_42;
	word32 a0_43;
	word32 a1_44;
	word32 a2_45;
	word32 a3_46;
	word32 a4_47;
	word32 a5_48;
	word32 a7_49;
	word32 s2_50;
	word32 s3_51;
	word32 s4_52;
	word32 s5_53;
	word32 s6_54;
	word32 s7_55;
	word32 s8_56;
	word32 s9_57;
	word32 s10_58;
	word32 s11_59;
	word32 t4_60;
	printf(ra, &g_t230B6A34, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_42, out a0_43, out a1_44, out a2_45, out a3_46, out a4_47, out a5_48, out a7_49, out s2_50, out s3_51, out s4_52, out s5_53, out s6_54, out s7_55, out s8_56, out s9_57, out s10_58, out s11_59, out t4_60);
}

// 2303A656: void vendor_data_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4)
void vendor_data_set(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4)
{
	struct Eq_183529 * a2_16 = *a0;
	Eq_2 a3_28;
	bt_hex_real(a0, (word32) a2_16->w0004, out a3_28);
	Eq_2 a5_37;
	Eq_2 s11_47;
	Eq_2 s2_48;
	Eq_2 s4_50;
	Eq_2 s6_52;
	Eq_2 s7_53;
	Eq_2 s9_55;
	word32 s1_162;
	word32 a0_163;
	word32 a1_164;
	word32 a2_165;
	word32 a3_166;
	word32 a4_167;
	word32 a7_168;
	word32 s3_169;
	word32 s5_170;
	word32 s8_171;
	word32 s10_172;
	word32 t4_173;
	Eq_2 ra_44 = printf(ra, &g_t230B71A4, a3_28, 0x00480000, dwLoc48, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_162, out a0_163, out a1_164, out a2_165, out a3_166, out a4_167, out a5_37, out a7_168, out s2_48, out s3_169, out s4_50, out s5_170, out s6_52, out s7_53, out s8_171, out s9_55, out s10_172, out s11_47, out t4_173);
	Eq_2 a1_62;
	Eq_2 a4_64;
	word32 a2_174;
	word32 a5_175;
	Eq_2 s1_66 = bt_mesh_model_msg_init(0x00C2003F, a5_37, out a1_62, out a2_174, out a4_64, out a5_175);
	Eq_2 s0_69 = *a1_62;
	word32 a1_176;
	word32 a2_177;
	word32 a3_178;
	word32 a4_179;
	word32 a5_180;
	net_buf_simple_add_mem(fp + -100, a1_62, (word32) a2_16->w0004, a4_64, out a1_176, out a2_177, out a3_178, out a4_179, out a5_180);
	word32 s0_181;
	word32 s1_182;
	word32 a0_183;
	word32 a2_184;
	word32 a3_185;
	word32 a4_186;
	word32 a5_187;
	word32 mstatus_188;
	bt_mesh_model_send(ra_44, s0_69, s1_66, s1_66, s2_48, fp + -100, 0x00, s2_48, s4_50, s6_52, s7_53, s9_55, s11_47, mstatus, dwLoc58, dwLoc54, dwLoc50, dwLoc4C, dwLoc48, dwLoc44, s0, dwLoc28, dwLoc24, dwLoc08, dwLoc04, dwArg04, dwArg08, fp + -88, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4, out s0_181, out s1_182, out a0_183, out a2_184, out a3_185, out a4_186, out a5_187, out mstatus_188);
}

// 2303A6C0: void blemesh_lpn_set(Register Eq_2 ra, Register Eq_2 s0, Register word32 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void blemesh_lpn_set(Eq_2 ra, Eq_2 s0, word32 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	struct Eq_274 * a0_103;
	Eq_2 a4_15;
	Eq_2 s8_20;
	word32 a0_186;
	word32 a1_187;
	Eq_2 a3_109;
	get_uint8_from_string(s0, a3 + 4, fp + ~0x10, out a0_186, out a1_187, out a3_109, out a4_15, out s8_20);
	if ((word32) SLICE(s0, byte, 24) != 0x00)
	{
		if ((word32) g_b4200F3FA != 0x00)
			a0_103 = (struct Eq_274 *) &g_t230B6668;
		else
		{
			word32 a0_72;
			ra = bt_mesh_lpn_set(ra, 0x4200F3FA, 0x01, a3_109, a4_15, s2, s3, s4, s5, s6, s7, s8_20, mstatus, dwLoc18, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out a0_72, out a3_109);
			if (a0_72 != 0x00)
				a0_103 = (struct Eq_274 *) &g_t230B6680;
			else
			{
				g_b4200F3FA = 0x01;
				a0_103 = (struct Eq_274 *) &g_t230B6698;
			}
		}
	}
	else if ((word32) g_b4200F3FA == 0x00)
		a0_103 = (struct Eq_274 *) &g_t230B66B4;
	else
	{
		word32 a0_35;
		ra = bt_mesh_lpn_set(ra, 0x4200F3FA, 0x00, a3_109, a4_15, s2, s3, s4, s5, s6, s7, s8_20, mstatus, dwLoc18, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out a0_35, out a3_109);
		if (a0_35 != 0x00)
			a0_103 = (struct Eq_274 *) &g_t230B66CC;
		else
		{
			g_b4200F3FA = 0x00;
			a0_103 = (struct Eq_274 *) &g_t230B66E4;
		}
	}
	word32 s1_188;
	word32 a0_189;
	word32 a1_190;
	word32 a2_191;
	word32 a3_192;
	word32 a4_193;
	word32 a5_194;
	word32 a7_195;
	word32 s2_196;
	word32 s3_197;
	word32 s4_198;
	word32 s5_199;
	word32 s6_200;
	word32 s7_201;
	word32 s8_202;
	word32 s9_203;
	word32 s10_204;
	word32 s11_205;
	word32 t4_206;
	printf(ra, a0_103, a3_109, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a7_195, out s2_196, out s3_197, out s4_198, out s5_199, out s6_200, out s7_201, out s8_202, out s9_203, out s10_204, out s11_205, out t4_206);
}

// 2303A74C: void blemesh_rpl_clr(Register Eq_2 ra)
void blemesh_rpl_clr(Eq_2 ra)
{
	word32 t1_17;
	word32 a0_18;
	word32 a1_19;
	word32 a2_20;
	word32 a3_21;
	word32 a4_22;
	word32 a5_23;
	memset(ra, 0x4200DA88, 0x00, 40, out t1_17, out a0_18, out a1_19, out a2_20, out a3_21, out a4_22, out a5_23);
}

// 2303A75E: void fault_clear(Register Eq_2 ra, Register int32 a1)
void fault_clear(Eq_2 ra, int32 a1)
{
	if (a1 != 1521)
		return;
	word32 t1_42;
	word32 a0_43;
	word32 a1_44;
	word32 a2_45;
	word32 a3_46;
	word32 a4_47;
	word32 a5_48;
	memset(ra, 0x4200F40C, 0x00, 0x08, out t1_42, out a0_43, out a1_44, out a2_45, out a3_46, out a4_47, out a5_48);
}

// 2303A786: void blemesh_seg_send(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4)
void blemesh_seg_send(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4)
{
	struct Eq_274 * a0_192;
	Eq_2 dwLoc88_271 = SEQ(nLoc87, ~0x00);
	if (a2 != 0x03)
		a0_192 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		if (bt_mesh_is_provisioned() != 0x00)
		{
			word32 a0_405;
			word32 a2_406;
			word32 a3_407;
			word32 a4_408;
			word32 a5_409;
			Eq_2 s0_35 = get_uint16_from_string(a3, (word32) a3 + 4, fp + -0x0098, out a0_405, out a2_406, out a3_407, out a4_408, out a5_409);
			word32 a5_414;
			word32 a3_412;
			word32 a4_413;
			word32 a0_410;
			word32 a2_411;
			Eq_2 s0_49 = get_uint16_from_string(s0_35, (word32) s0_35 + 8, fp + -0x0096, out a0_410, out a2_411, out a3_412, out a4_413, out a5_414);
			word32 a4_420;
			word32 a5_421;
			word32 a2_418;
			word32 a3_419;
			word32 a0_416;
			word32 a1_417;
			word32 t1_415;
			Eq_2 ra_62 = memset(ra, fp + -0x006A, 0x00, 0x12, out t1_415, out a0_416, out a1_417, out a2_418, out a3_419, out a4_420, out a5_421);
			Eq_2 a0_66 = (word32) g_w4200F400;
			word32 a3_69 = (word32) g_w4200D870;
			if (a3_69 != 0x0FFFFFFF || (word32) g_w4200D898 != a3_69)
				;
			Eq_2 a3_101;
			word32 a5_442;
			word32 a4_441;
			bt_mesh_subnet_get(a0_66, out a3_101, out a4_441, out a5_442);
			word32 a5_443;
			bt_mesh_net_transmit_get(out a5_443);
			Eq_2 a4_120;
			Eq_2 s11_125;
			Eq_2 s2_126;
			Eq_2 s3_127;
			Eq_2 s5_129;
			Eq_2 s6_130;
			Eq_2 s7_131;
			Eq_2 s8_132;
			Eq_2 s9_133;
			word32 s10_452;
			word32 t4_453;
			word32 a7_450;
			word32 s4_451;
			word32 a3_448;
			word32 a5_449;
			word32 a1_446;
			word32 a2_447;
			word32 s1_444;
			word32 a0_445;
			Eq_2 ra_122 = printf(ra_62, &g_t230B6800, a3_101, 0x00480000, dwLoc78, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, out s1_444, out a0_445, out a1_446, out a2_447, out a3_448, out a4_120, out a5_449, out a7_450, out s2_126, out s3_127, out s4_451, out s5_129, out s6_130, out s7_131, out s8_132, out s9_133, out s10_452, out s11_125, out t4_453);
			word32 a4_457;
			word32 a3_456;
			word32 a1_454;
			word32 a2_455;
			word32 a5_458;
			net_buf_simple_add_mem(fp + -0x0094, fp + -0x0088, 0x0C, a4_120, out a1_454, out a2_455, out a3_456, out a4_457, out a5_458);
			word32 s0_459;
			word32 s1_460;
			word32 a0_461;
			word32 a3_462;
			word32 a4_463;
			word32 a5_464;
			word32 s2_465;
			word32 mstatus_466;
			bt_mesh_trans_send(ra_122, s0_49, fp + -0x007C, fp + -0x0094, 0x00, 0x00, s2_126, s3_127, s5_129, s6_130, s7_131, s8_132, s9_133, s11_125, mstatus, dwLocA0, dwLoc9C, 0x00480000, 0x00, 0x00, fp + -112, dwLoc88_271, dwLoc7C, dwLoc78, dwLoc58, s0, dwLoc48, dwLoc44, dwLoc38, dwLoc28, dwLoc24, fp + -88, fp + -88, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4, out s0_459, out s1_460, out a0_461, out a3_462, out a4_463, out a5_464, out s2_465, out mstatus_466);
			return;
		}
		a0_192 = (struct Eq_274 *) &g_t230B67DC;
	}
	word32 t4_440;
	word32 s10_438;
	word32 s11_439;
	word32 s8_436;
	word32 s9_437;
	word32 s6_434;
	word32 s7_435;
	word32 s4_432;
	word32 s5_433;
	word32 s2_430;
	word32 s3_431;
	word32 a5_428;
	word32 a7_429;
	word32 a3_426;
	word32 a4_427;
	word32 a1_424;
	word32 a2_425;
	word32 s1_422;
	word32 a0_423;
	printf(ra, a0_192, a3, 0x00480000, dwLoc78, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, out s1_422, out a0_423, out a1_424, out a2_425, out a3_426, out a4_427, out a5_428, out a7_429, out s2_430, out s3_431, out s4_432, out s5_433, out s6_434, out s7_435, out s8_436, out s9_437, out s10_438, out s11_439, out t4_440);
}

