pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303A88A: void blemesh_net_send(Register Eq_2 ra, Register word32 a2, Register Eq_2 a3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void blemesh_net_send(Eq_2 ra, word32 a2, Eq_2 a3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	byte bLoc49 = SLICE(dwLoc4C, byte, 24);
	byte bLoc4A = SLICE(dwLoc4C, byte, 16);
	struct Eq_274 * a0_237;
	Eq_2 dwLoc48_294 = dwLoc48;
	if (a2 != 0x05)
		a0_237 = (struct Eq_274 *) &g_t230B67B4;
	else if (bt_mesh_is_provisioned() == 0x00)
		a0_237 = (struct Eq_274 *) &g_t230B67DC;
	else
	{
		word32 a5_93;
		word32 s8_430;
		word32 a4_429;
		word32 a3_428;
		word32 a1_427;
		word32 a0_426;
		Eq_2 s0_30 = get_uint8_from_string(a3, (word32) a3 + 4, fp + -74, out a0_426, out a1_427, out a3_428, out a4_429, out s8_430);
		word32 a3_433;
		word32 a1_432;
		word32 a0_431;
		word32 a4_434;
		word32 s8_435;
		Eq_2 s0_44 = get_uint8_from_string(s0_30, (word32) s0_30 + 8, fp + -73, out a0_431, out a1_432, out a3_433, out a4_434, out s8_435);
		word32 a0_436;
		word32 a2_437;
		word32 a3_438;
		word32 a4_439;
		word32 a5_440;
		Eq_2 s0_58 = get_uint16_from_string(s0_44, (word32) s0_44 + 0x0C, fp + -72, out a0_436, out a2_437, out a3_438, out a4_439, out a5_440);
		word32 a0_441;
		word32 a2_442;
		word32 a3_443;
		word32 a4_444;
		word32 a5_445;
		get_uint16_from_string(s0_58, (word32) s0_58 + 16, fp + -70, out a0_441, out a2_442, out a3_443, out a4_444, out a5_445);
		word32 t1_446;
		word32 a0_447;
		word32 a1_448;
		word32 a2_449;
		word32 a3_450;
		word32 a4_451;
		word32 a5_452;
		Eq_2 ra_85 = memset(ra, fp + -0x0022, 0x00, 0x12, out t1_446, out a0_447, out a1_448, out a2_449, out a3_450, out a4_451, out a5_452);
		Eq_2 a0_89 = (word32) g_w4200F400;
		word16 wLoc28_283 = (word16) a0_89;
		if ((word32) bLoc49 == 0x00)
			a5_93 = 0x0FFFFFFE;
		else
			a5_93 = 0x0FFFFFFF;
		word32 a3_508;
		word32 a4_509;
		word32 a5_510;
		Eq_2 a0_107 = bt_mesh_subnet_get(a0_89, out a3_508, out a4_509, out a5_510);
		Eq_2 a5_117;
		Eq_2 a0_116 = bt_mesh_net_transmit_get(out a5_117);
		dwLoc48_294 = fp + -40;
		Eq_2 a0_127;
		ptr32 mstatus_135;
		word32 s0_511;
		word32 s1_512;
		word32 a1_513;
		word32 a4_514;
		word32 a5_515;
		word32 s2_516;
		word32 s3_517;
		word32 s4_518;
		word32 s5_519;
		word32 s6_520;
		word32 s7_521;
		word32 s8_522;
		word32 s9_523;
		word32 s10_524;
		word32 s11_525;
		ra = bt_mesh_adv_create(ra_85, a0_116, 0x00, a5_117, s5, mstatus, dwLoc10, dwLoc0C, dwArg18, a0_107, 0x00, dwArg48, dwArg88, dwArgA8, dwArgD8, out s0_511, out s1_512, out a0_127, out a1_513, out a3, out a4_514, out a5_515, out s2_516, out s3_517, out s4_518, out s5_519, out s6_520, out s7_521, out s8_522, out s9_523, out s10_524, out s11_525, out mstatus_135);
		dwLoc28 = SEQ((word16) a5_93, wLoc28_283);
		Eq_2 dwLoc3C_331 = SEQ(bLoc39, (byte) a0_116, (word16) (word32) (uint16) (fp + -40));
		Eq_2 dwLoc20_346 = SEQ((byte) (word32) bLoc4A, nLoc20);
		if (a0_127 != 0x00)
		{
			Eq_2 a5_160;
			Eq_2 a4_165;
			Eq_2 s2_171;
			Eq_2 s3_172;
			Eq_2 s4_173;
			Eq_2 s6_175;
			word32 s1_472;
			word32 a0_473;
			word32 a1_474;
			word32 a2_475;
			word32 a3_476;
			word32 a7_477;
			word32 s5_478;
			word32 s7_479;
			word32 s8_480;
			word32 s9_481;
			word32 s10_482;
			word32 s11_483;
			word32 t4_484;
			Eq_2 ra_167 = printf(ra, &g_t230B671C, a3, fp + -40, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_472, out a0_473, out a1_474, out a2_475, out a3_476, out a4_165, out a5_160, out a7_477, out s2_171, out s3_172, out s4_173, out s5_478, out s6_175, out s7_479, out s8_480, out s9_481, out s10_482, out s11_483, out t4_484);
			net_buf_simple_reserve((word32 *) 0x09, a5_160);
			word32 a1_485;
			word32 a2_486;
			word32 a3_487;
			word32 a4_488;
			word32 a5_489;
			net_buf_simple_add_mem((word32) a0_127 + 8, fp + -56, 0x10, a4_165, out a1_485, out a2_486, out a3_487, out a4_488, out a5_489);
			word32 s0_490;
			word32 s1_491;
			word32 a0_492;
			word32 a1_493;
			word32 a3_494;
			word32 a4_495;
			word32 a5_496;
			word32 s2_497;
			word32 s3_498;
			word32 s4_499;
			word32 s5_500;
			word32 s6_501;
			word32 s7_502;
			word32 s8_503;
			word32 s9_504;
			word32 s10_505;
			word32 s11_506;
			word32 mstatus_507;
			bt_mesh_net_send(ra_167, a0_127, (word32) a0_127 + 8, fp + -0x0044, a0_127, 0x00, 0x00, s2_171, s3_172, s4_173, s6_175, mstatus_135, dwLoc50, fp + -40, 0x00, 0x00, dwLoc3C_331, dwLoc38, dwLoc28, dwLoc20_346, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg0C, dwArg28, dwArg2C, a0_107, 0x00, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_490, out s1_491, out a0_492, out a1_493, out a3_494, out a4_495, out a5_496, out s2_497, out s3_498, out s4_499, out s5_500, out s6_501, out s7_502, out s8_503, out s9_504, out s10_505, out s11_506, out mstatus_507);
			return;
		}
		a0_237 = (struct Eq_274 *) &g_t230B6700;
	}
	word32 s1_453;
	word32 a0_454;
	word32 a1_455;
	word32 a2_456;
	word32 a3_457;
	word32 a4_458;
	word32 a5_459;
	word32 a7_460;
	word32 s2_461;
	word32 s3_462;
	word32 s4_463;
	word32 s5_464;
	word32 s6_465;
	word32 s7_466;
	word32 s8_467;
	word32 s9_468;
	word32 s10_469;
	word32 s11_470;
	word32 t4_471;
	printf(ra, a0_237, a3, dwLoc48_294, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_453, out a0_454, out a1_455, out a2_456, out a3_457, out a4_458, out a5_459, out a7_460, out s2_461, out s3_462, out s4_463, out s5_464, out s6_465, out s7_466, out s8_467, out s9_468, out s10_469, out s11_470, out t4_471);
}

// 2303A99A: void blemesh_reset(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void blemesh_reset(Eq_2 ra, Eq_2 s0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	Eq_2 a3_11;
	Eq_2 ra_17 = bt_mesh_reset(ra, s0, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg6C, ra, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out a3_11);
	word32 s1_109;
	word32 a0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 a7_116;
	word32 s2_117;
	word32 s3_118;
	word32 s4_119;
	word32 s5_120;
	word32 s6_121;
	word32 s7_122;
	word32 s8_123;
	word32 s9_124;
	word32 s10_125;
	word32 s11_126;
	word32 t4_127;
	printf(ra_17, &g_t230B6798, a3_11, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_109, out a0_110, out a1_111, out a2_112, out a3_113, out a4_114, out a5_115, out a7_116, out s2_117, out s3_118, out s4_119, out s5_120, out s6_121, out s7_122, out s8_123, out s9_124, out s10_125, out s11_126, out t4_127);
}

// 2303A9B2: void blemesh_input_str(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void blemesh_input_str(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	struct Eq_274 * a0_105;
	if (a2 != 0x02)
		a0_105 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		dwArg74 = ra;
		dwArg70 = s1;
		if ((word32) g_b4200F3F8 == 0x08)
		{
			struct Eq_274 * a0_67;
			Eq_2 ra_46;
			Eq_2 a4_21;
			word32 a1_250;
			word32 a2_251;
			word32 a5_252;
			Eq_2 a3_20;
			if (strlen(a0, out a1_250, out a2_251, out a3_20, out a4_21, out a5_252) < (word32) g_b4200F3F9)
			{
				a0_67 = (struct Eq_274 *) &g_t230B659C;
				ra_46 = ra;
			}
			else
			{
				word32 a0_32;
				ra_46 = bt_mesh_input_string(ra, 0x4200F3F8, a3_20, a4_21, s5, s6, s7, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out a0_32, out a3_20);
				if (a0_32 == 0x00)
				{
					g_b4200F3F8 = 0x00;
					return;
				}
				a0_67 = (struct Eq_274 *) &g_t230B65C8;
			}
			word32 s1_253;
			word32 a0_254;
			word32 a1_255;
			word32 a2_256;
			word32 a3_257;
			word32 a4_258;
			word32 a5_259;
			word32 a7_260;
			word32 s2_261;
			word32 s3_262;
			word32 s4_263;
			word32 s5_264;
			word32 s6_265;
			word32 s7_266;
			word32 s8_267;
			word32 s9_268;
			word32 s10_269;
			word32 s11_270;
			word32 t4_271;
			printf(ra_46, a0_67, a3_20, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_253, out a0_254, out a1_255, out a2_256, out a3_257, out a4_258, out a5_259, out a7_260, out s2_261, out s3_262, out s4_263, out s5_264, out s6_265, out s7_266, out s8_267, out s9_268, out s10_269, out s11_270, out t4_271);
			return;
		}
		a0_105 = (struct Eq_274 *) &g_t230B6578;
	}
	word32 a2_234;
	word32 a3_235;
	word32 a1_233;
	word32 a0_232;
	word32 s1_231;
	word32 a4_236;
	word32 a5_237;
	word32 a7_238;
	word32 s2_239;
	word32 s3_240;
	word32 s4_241;
	word32 s5_242;
	word32 s6_243;
	word32 s7_244;
	word32 s8_245;
	word32 s9_246;
	word32 s10_247;
	word32 s11_248;
	word32 t4_249;
	printf(ra, a0_105, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_231, out a0_232, out a1_233, out a2_234, out a3_235, out a4_236, out a5_237, out a7_238, out s2_239, out s3_240, out s4_241, out s5_242, out s6_243, out s7_244, out s8_245, out s9_246, out s10_247, out s11_248, out t4_249);
}

// 2303AA3A: void blemesh_input_num(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_185099) a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack word32 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8)
void blemesh_input_num(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_185099 * a0, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, word32 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8)
{
	struct Eq_274 * a0_127;
	if (a2 != 0x02)
		a0_127 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		Eq_2 a0_22 = strtoul(a0, null, 0x0A, out a3);
		dwArg70 = s1;
		dwArg74 = ra;
		if ((word32) g_b4200F3F8 == 0x04)
		{
			struct Eq_274 * a0_100;
			Eq_2 ra_68;
			Eq_2 a4_43;
			word32 a1_277;
			word32 a2_278;
			word32 a5_279;
			Eq_2 a3_42;
			if (strlen(a0_22, out a1_277, out a2_278, out a3_42, out a4_43, out a5_279) < (word32) g_b4200F3F9)
			{
				a0_100 = (struct Eq_274 *) &g_t230B6530;
				ra_68 = ra;
			}
			else
			{
				word32 a0_54;
				ra_68 = bt_mesh_input_number(ra, 0x4200F3F8, a0_22, a3_42, a4_43, s5, s6, s7, mstatus, s2, s0, dwLoc08, dwLoc04, dwArg00, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out a0_54, out a3_42);
				if (a0_54 == 0x00)
				{
					g_b4200F3F8 = 0x00;
					0x00 = dwArg38;
					return;
				}
				a0_100 = (struct Eq_274 *) &g_t230B6558;
			}
			0x00 = dwArg38;
			word32 s1_280;
			word32 a0_281;
			word32 a1_282;
			word32 a2_283;
			word32 a3_284;
			word32 a4_285;
			word32 a5_286;
			word32 a7_287;
			word32 s2_288;
			word32 s3_289;
			word32 s4_290;
			word32 s5_291;
			word32 s6_292;
			word32 s7_293;
			word32 s8_294;
			word32 s9_295;
			word32 s10_296;
			word32 s11_297;
			word32 t4_298;
			printf(ra_68, a0_100, a3_42, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_280, out a0_281, out a1_282, out a2_283, out a3_284, out a4_285, out a5_286, out a7_287, out s2_288, out s3_289, out s4_290, out s5_291, out s6_292, out s7_293, out s8_294, out s9_295, out s10_296, out s11_297, out t4_298);
			return;
		}
		0x00 = dwArg38;
		a0_127 = (struct Eq_274 *) &g_t230B650C;
	}
	word32 a0_259;
	word32 s1_258;
	word32 a1_260;
	word32 a2_261;
	word32 a3_262;
	word32 a4_263;
	word32 a5_264;
	word32 a7_265;
	word32 s2_266;
	word32 s3_267;
	word32 s4_268;
	word32 s5_269;
	word32 s6_270;
	word32 s7_271;
	word32 s8_272;
	word32 s9_273;
	word32 s10_274;
	word32 s11_275;
	word32 t4_276;
	printf(ra, a0_127, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_258, out a0_259, out a1_260, out a2_261, out a3_262, out a4_263, out a5_264, out a7_265, out s2_266, out s3_267, out s4_268, out s5_269, out s6_270, out s7_271, out s8_272, out s9_273, out s10_274, out s11_275, out t4_276);
}

// 2303AAD6: void blemesh_ivu_test(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void blemesh_ivu_test(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	struct Eq_274 * a0_26;
	if (a2 != 0x02)
		a0_26 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		word32 a1_82;
		word32 a0_81;
		word32 a4_83;
		word32 s8_84;
		get_uint8_from_string(s0, (word32) a3 + 4, fp + ~0x10, out a0_81, out a1_82, out a3, out a4_83, out s8_84);
		if ((word32) bLoc11 != 0x00)
			a0_26 = (struct Eq_274 *) &g_t230B6628;
		else
			a0_26 = (struct Eq_274 *) &g_t230B6648;
	}
	word32 s1_85;
	word32 a0_86;
	word32 a1_87;
	word32 a2_88;
	word32 a3_89;
	word32 a4_90;
	word32 a5_91;
	word32 a7_92;
	word32 s2_93;
	word32 s3_94;
	word32 s4_95;
	word32 s5_96;
	word32 s6_97;
	word32 s7_98;
	word32 s8_99;
	word32 s9_100;
	word32 s10_101;
	word32 s11_102;
	word32 t4_103;
	printf(ra, a0_26, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_85, out a0_86, out a1_87, out a2_88, out a3_89, out a4_90, out a5_91, out a7_92, out s2_93, out s3_94, out s4_95, out s5_96, out s6_97, out s7_98, out s8_99, out s9_100, out s10_101, out s11_102, out t4_103);
}

// 2303AB18: void blemesh_set_dev_uuid(Register Eq_2 ra, Register (ptr32 Eq_185380) a1, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0128)
void blemesh_set_dev_uuid(Eq_2 ra, struct Eq_185380 * a1, word32 a2, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0128)
{
	if (a2 == 0x02)
	{
		word32 s1_142;
		word32 a0_143;
		word32 a1_144;
		word32 a2_145;
		word32 a3_146;
		word32 a4_147;
		word32 a5_148;
		word32 a7_149;
		word32 s2_150;
		word32 s3_151;
		word32 s4_152;
		word32 s5_153;
		word32 s6_154;
		word32 s7_155;
		word32 s8_156;
		word32 s9_157;
		word32 s10_158;
		word32 s11_159;
		word32 t4_160;
		printf(ra, &g_t230B681C, a1->t0004, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_142, out a0_143, out a1_144, out a2_145, out a3_146, out a4_147, out a5_148, out a7_149, out s2_150, out s3_151, out s4_152, out s5_153, out s6_154, out s7_155, out s8_156, out s9_157, out s10_158, out s11_159, out t4_160);
		word32 s1_180;
		word32 a0_181;
		word32 a3_182;
		word32 s2_183;
		word32 s3_184;
		get_bytearray_from_string(0x4200D530, 0x10, dwArg0128, out s1_180, out a0_181, out a3_182, out s2_183, out s3_184);
	}
	else
	{
		word32 s1_161;
		word32 a0_162;
		word32 a1_163;
		word32 a2_164;
		word32 a3_165;
		word32 a4_166;
		word32 a5_167;
		word32 a7_168;
		word32 s2_169;
		word32 s3_170;
		word32 s4_171;
		word32 s5_172;
		word32 s6_173;
		word32 s7_174;
		word32 s8_175;
		word32 s9_176;
		word32 s10_177;
		word32 s11_178;
		word32 t4_179;
		printf(ra, &g_t230B67B4, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_161, out a0_162, out a1_163, out a2_164, out a3_165, out a4_166, out a5_167, out a7_168, out s2_169, out s3_170, out s4_171, out s5_172, out s6_173, out s7_174, out s8_175, out s9_176, out s10_177, out s11_178, out t4_179);
	}
}

