pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303AB58: void blemesh_fault_set(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void blemesh_fault_set(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgF8, word32 dwArg0128)
{
	struct Eq_274 * a0_269;
	if (a2 != 0x03)
		a0_269 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		Eq_2 a0_20;
		word32 a3_420;
		word32 a4_421;
		word32 s8_422;
		word32 a1_419;
		get_uint8_from_string(s0, (word32) a3 + 4, fp + -33, out a0_20, out a1_419, out a3_420, out a4_421, out s8_422);
		if ((word32) bLoc21 == 0x00)
		{
			Eq_185491 a2_160 = 0x04;
			word32 a1_428;
			word32 a2_429;
			word32 a5_432;
			word32 a3_430;
			word32 a4_431;
			if (strlen(a0_20, out a1_428, out a2_429, out a3_430, out a4_431, out a5_432) <= 0x07)
			{
				Eq_2 a0_163;
				word32 a1_434;
				word32 a2_435;
				word32 a5_438;
				word32 a3_436;
				word32 a4_437;
				word32 t1_433;
				ra = memset(ra, 0x4200F3F4, 0x00, 0x04, out t1_433, out a0_163, out a1_434, out a2_435, out a3_436, out a4_437, out a5_438);
				word32 a2_440;
				word32 a3_441;
				word32 a4_442;
				word32 a5_443;
				word32 a1_439;
				a2_160 = strlen(a0_163, out a1_439, out a2_440, out a3_441, out a4_442, out a5_443) >> 0x01;
			}
			Eq_2 a3_190;
			word32 s2_446;
			word32 s3_447;
			word32 s1_444;
			word32 a0_445;
			get_bytearray_from_string(0x4200F3F4, a2_160, dwArgF8, out s1_444, out a0_445, out a3_190, out s2_446, out s3_447);
			word32 t4_464;
			word32 s11_463;
			word32 s10_462;
			word32 s9_461;
			word32 s8_460;
			word32 s7_459;
			word32 s6_458;
			word32 a4_452;
			word32 a5_453;
			word32 s4_456;
			word32 s5_457;
			word32 a7_454;
			word32 s2_455;
			word32 a1_450;
			word32 a2_451;
			word32 s1_448;
			word32 a0_449;
			word32 s3_223;
			ra = printf(ra, &g_t230B644C, a3_190, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_448, out a0_449, out a1_450, out a2_451, out a3, out a4_452, out a5_453, out a7_454, out s2_455, out s3_223, out s4_456, out s5_457, out s6_458, out s7_459, out s8_460, out s9_461, out s10_462, out s11_463, out t4_464);
			do
			{
				word32 a1_466;
				word32 a2_467;
				word32 a7_470;
				word32 a4_468;
				word32 a5_469;
				word32 s4_471;
				word32 s1_255;
				word32 s2_258;
				word32 a0_465;
				word32 s5_472;
				word32 s6_473;
				word32 s7_474;
				word32 s8_475;
				word32 s9_476;
				word32 s10_477;
				word32 s11_478;
				word32 t4_479;
				ra = printf(ra, s3_223 + 1116, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_255, out a0_465, out a1_466, out a2_467, out a3, out a4_468, out a5_469, out a7_470, out s2_258, out s3_223, out s4_471, out s5_472, out s6_473, out s7_474, out s8_475, out s9_476, out s10_477, out s11_478, out t4_479);
			} while (s1_255 != s2_258);
		}
		else
		{
			Eq_185491 a2_44 = 0x08;
			word32 a3_425;
			word32 a1_423;
			word32 a2_424;
			word32 a4_426;
			word32 a5_427;
			if (strlen(a0_20, out a1_423, out a2_424, out a3_425, out a4_426, out a5_427) <= 0x0F)
			{
				Eq_2 a0_47;
				word32 t1_499;
				word32 a1_500;
				word32 a2_501;
				word32 a3_502;
				word32 a4_503;
				word32 a5_504;
				ra = memset(ra, 0x4200F40C, 0x00, 0x08, out t1_499, out a0_47, out a1_500, out a2_501, out a3_502, out a4_503, out a5_504);
				word32 a1_505;
				word32 a2_506;
				word32 a3_507;
				word32 a4_508;
				word32 a5_509;
				a2_44 = strlen(a0_47, out a1_505, out a2_506, out a3_507, out a4_508, out a5_509) >> 0x01;
			}
			Eq_2 a3_74;
			word32 s1_510;
			word32 a0_511;
			word32 s2_512;
			word32 s3_513;
			get_bytearray_from_string(0x4200F40C, a2_44, dwArgF8, out s1_510, out a0_511, out a3_74, out s2_512, out s3_513);
			word32 s1_514;
			word32 a0_515;
			word32 a1_516;
			word32 a2_517;
			word32 a4_518;
			word32 a5_519;
			word32 a7_520;
			word32 s2_521;
			word32 s4_522;
			word32 s5_523;
			word32 s6_524;
			word32 s7_525;
			word32 s8_526;
			word32 s9_527;
			word32 s10_528;
			word32 s11_529;
			word32 t4_530;
			word32 s3_107;
			ra = printf(ra, &g_t230B6464, a3_74, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_514, out a0_515, out a1_516, out a2_517, out a3, out a4_518, out a5_519, out a7_520, out s2_521, out s3_107, out s4_522, out s5_523, out s6_524, out s7_525, out s8_526, out s9_527, out s10_528, out s11_529, out t4_530);
			do
			{
				word32 s1_139;
				word32 s2_142;
				word32 a0_531;
				word32 a1_532;
				word32 a2_533;
				word32 a4_534;
				word32 a5_535;
				word32 a7_536;
				word32 s4_537;
				word32 s5_538;
				word32 s6_539;
				word32 s7_540;
				word32 s8_541;
				word32 s9_542;
				word32 s10_543;
				word32 s11_544;
				word32 t4_545;
				ra = printf(ra, s3_107 + 1116, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_139, out a0_531, out a1_532, out a2_533, out a3, out a4_534, out a5_535, out a7_536, out s2_142, out s3_107, out s4_537, out s5_538, out s6_539, out s7_540, out s8_541, out s9_542, out s10_543, out s11_544, out t4_545);
			} while (s1_139 != s2_142);
		}
		a0_269 = (struct Eq_274 *) &g_b230C6900;
	}
	word32 s1_480;
	word32 a0_481;
	word32 a1_482;
	word32 a2_483;
	word32 a3_484;
	word32 a4_485;
	word32 a5_486;
	word32 a7_487;
	word32 s2_488;
	word32 s3_489;
	word32 s4_490;
	word32 s5_491;
	word32 s6_492;
	word32 s7_493;
	word32 s8_494;
	word32 s9_495;
	word32 s10_496;
	word32 s11_497;
	word32 t4_498;
	printf(ra, a0_269, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_480, out a0_481, out a1_482, out a2_483, out a3_484, out a4_485, out a5_486, out a7_487, out s2_488, out s3_489, out s4_490, out s5_491, out s6_492, out s7_493, out s8_494, out s9_495, out s10_496, out s11_497, out t4_498);
	0x00 = dwArg0128;
}

// 2303AC62: void blemesh_pb(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void blemesh_pb(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	byte bLoc11 = SLICE(dwLoc14, byte, 24);
	byte bLoc12 = SLICE(dwLoc14, byte, 16);
	if (a2 != 0x03)
	{
		word32 s1_341;
		word32 a0_342;
		word32 a1_343;
		word32 a2_344;
		word32 a3_345;
		word32 a4_346;
		word32 a5_347;
		word32 a7_348;
		word32 s2_349;
		word32 s3_350;
		word32 s4_351;
		word32 s5_352;
		word32 s6_353;
		word32 s7_354;
		word32 s8_355;
		word32 s9_356;
		word32 s10_357;
		word32 s11_358;
		word32 t4_359;
		printf(ra, &g_t230B67B4, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_341, out a0_342, out a1_343, out a2_344, out a3_345, out a4_346, out a5_347, out a7_348, out s2_349, out s3_350, out s4_351, out s5_352, out s6_353, out s7_354, out s8_355, out s9_356, out s10_357, out s11_358, out t4_359);
		return;
	}
	struct Eq_274 * a0_159;
	Eq_2 a3_128;
	Eq_2 ra_108;
	struct Eq_274 * a0_126;
	word32 a3_16;
	Eq_2 a1_29;
	Eq_2 a3_31;
	Eq_2 a4_32;
	word32 a0_335;
	word32 a1_336;
	word32 a4_337;
	word32 s8_338;
	word32 a0_339;
	word32 s8_340;
	Eq_2 s0_36 = get_uint8_from_string(get_uint8_from_string(s0, (word32) a3 + 4, fp + -18, out a0_335, out a1_336, out a3_16, out a4_337, out s8_338), a3_16 + 8, fp + -0x0011, out a0_339, out a1_29, out a3_31, out a4_32, out s8_340);
	Eq_2 a0_41 = (word32) bLoc12;
	if ((word32) bLoc11 != 0x00)
	{
		word32 a0_90;
		ra_108 = bt_mesh_prov_enable(ra, s0_36, a0_41, a1_29, s2, s4, s5, s6, s11, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg08, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out a0_90, out a3_128);
		word32 a0_121 = (word32) bLoc12;
		if (a0_90 != 0x00)
		{
			bearer2str(a0_121);
			a0_159 = (struct Eq_274 *) &g_t230B6738;
			goto l2303ACC2;
		}
		bearer2str(a0_121);
		a0_126 = (struct Eq_274 *) &g_t230B6758;
	}
	else
	{
		word32 a0_44;
		ra_108 = bt_mesh_prov_disable(ra, s0_36, a0_41, a3_31, a4_32, s2, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a0_44, out a3_128);
		word32 a0_74 = (word32) bLoc12;
		if (a0_44 != 0x00)
		{
			bearer2str(a0_74);
			a0_159 = (struct Eq_274 *) &g_t230B6768;
l2303ACC2:
			word32 s1_360;
			word32 a0_361;
			word32 a1_362;
			word32 a2_363;
			word32 a3_364;
			word32 a4_365;
			word32 a5_366;
			word32 a7_367;
			word32 s2_368;
			word32 s3_369;
			word32 s4_370;
			word32 s5_371;
			word32 s6_372;
			word32 s7_373;
			word32 s8_374;
			word32 s9_375;
			word32 s10_376;
			word32 s11_377;
			word32 t4_378;
			printf(ra_108, a0_159, a3_128, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_360, out a0_361, out a1_362, out a2_363, out a3_364, out a4_365, out a5_366, out a7_367, out s2_368, out s3_369, out s4_370, out s5_371, out s6_372, out s7_373, out s8_374, out s9_375, out s10_376, out s11_377, out t4_378);
			return;
		}
		bearer2str(a0_74);
		a0_126 = (struct Eq_274 *) &g_t230B6788;
	}
	word32 s1_379;
	word32 a0_380;
	word32 a1_381;
	word32 a2_382;
	word32 a3_383;
	word32 a4_384;
	word32 a5_385;
	word32 a7_386;
	word32 s2_387;
	word32 s3_388;
	word32 s4_389;
	word32 s5_390;
	word32 s6_391;
	word32 s7_392;
	word32 s8_393;
	word32 s9_394;
	word32 s10_395;
	word32 s11_396;
	word32 t4_397;
	printf(ra_108, a0_126, a3_128, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_379, out a0_380, out a1_381, out a2_382, out a3_383, out a4_384, out a5_385, out a7_386, out s2_387, out s3_388, out s4_389, out s5_390, out s6_391, out s7_392, out s8_393, out s9_394, out s10_395, out s11_396, out t4_397);
}

// 2303AD0C: void blemesh_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void blemesh_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	struct Eq_274 * a0_160;
	if ((word32) g_b4200F3F0 != 0x00)
		a0_160 = (struct Eq_274 *) &g_t230B6478;
	else
	{
		bt_get_local_public_address(fp + -40);
		Eq_2 a4_51;
		struct Eq_186267 * a5_52;
		word32 a7_317;
		word32 a6_316;
		word32 a3_315;
		word32 a2_314;
		word32 a1_313;
		memcpy(0x4200D530, fp + -32, 0x10, out a1_313, out a2_314, out a3_315, out a4_51, out a5_52, out a6_316, out a7_317);
		dwLoc28.u0 = 0x0AFFFF07;
		word32 a0_86;
		ra = bt_mesh_init(ra, 0x4200F3F0, a4_51, a5_52, mstatus, dwLoc30, dwLoc2C, 0x0AFFFF07, dwLoc20, s0, SEQ((byte) (word32) bLoc23, (byte) (word32) bLoc22, 0x0333), dwLoc0C, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, dwArg54, 0x22221111, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out a0_86, out a3);
		if (a0_86 == 0x00)
		{
			struct Eq_274 * a0_126;
			g_b4200F3F0 = 0x01;
			Eq_2 a3_106;
			word32 s1_318;
			word32 a0_319;
			word32 a1_320;
			word32 a2_321;
			word32 a4_322;
			word32 a5_323;
			word32 a7_324;
			word32 s2_325;
			word32 s3_326;
			word32 s4_327;
			word32 s5_328;
			word32 s6_329;
			word32 s7_330;
			word32 s8_331;
			word32 s9_332;
			word32 s10_333;
			word32 s11_334;
			word32 t4_335;
			Eq_2 ra_109 = printf(ra, &g_t230B64A0, a3, 0x0AFFFF07, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_318, out a0_319, out a1_320, out a2_321, out a3_106, out a4_322, out a5_323, out a7_324, out s2_325, out s3_326, out s4_327, out s5_328, out s6_329, out s7_330, out s8_331, out s9_332, out s10_333, out s11_334, out t4_335);
			if (bt_mesh_is_provisioned() != 0x00)
				a0_126 = (struct Eq_274 *) &g_t230B64B8;
			else
				a0_126 = (struct Eq_274 *) &g_t230B64DC;
			word32 s1_355;
			word32 a0_356;
			word32 a1_357;
			word32 a2_358;
			word32 a3_359;
			word32 a4_360;
			word32 a5_361;
			word32 a7_362;
			word32 s2_363;
			word32 s3_364;
			word32 s4_365;
			word32 s5_366;
			word32 s6_367;
			word32 s7_368;
			word32 s8_369;
			word32 s9_370;
			word32 s10_371;
			word32 s11_372;
			word32 t4_373;
			printf(ra_109, a0_126, a3_106, 0x0AFFFF07, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_355, out a0_356, out a1_357, out a2_358, out a3_359, out a4_360, out a5_361, out a7_362, out s2_363, out s3_364, out s4_365, out s5_366, out s6_367, out s7_368, out s8_369, out s9_370, out s10_371, out s11_372, out t4_373);
			bt_mesh_lpn_set_cb(&g_t2303A4A8);
			return;
		}
		a0_160 = (struct Eq_274 *) &g_t230B648C;
	}
	word32 s1_336;
	word32 a0_337;
	word32 a1_338;
	word32 a2_339;
	word32 a3_340;
	word32 a4_341;
	word32 a5_342;
	word32 a7_343;
	word32 s2_344;
	word32 s3_345;
	word32 s4_346;
	word32 s5_347;
	word32 s6_348;
	word32 s7_349;
	word32 s8_350;
	word32 s9_351;
	word32 s10_352;
	word32 s11_353;
	word32 t4_354;
	printf(ra, a0_160, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_336, out a0_337, out a1_338, out a2_339, out a3_340, out a4_341, out a5_342, out a7_343, out s2_344, out s3_345, out s4_346, out s5_347, out s6_348, out s7_349, out s8_350, out s9_351, out s10_352, out s11_353, out t4_354);
}

// 2303ADF2: void attn_off()
void attn_off()
{
}

// 2303ADF4: void blemesh_iv_update(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void blemesh_iv_update(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	struct Eq_274 * a0_121;
	if (a2 != 0x02)
		a0_121 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		if (bt_mesh_is_provisioned() != 0x00)
		{
			Eq_2 a3_38;
			Eq_2 a4_39;
			word32 a0_59;
			Eq_2 a3_20;
			word32 s8_246;
			word32 a4_245;
			word32 a1_244;
			word32 a0_243;
			get_uint8_from_string(s0, (word32) a3 + 4, fp + -0x0011, out a0_243, out a1_244, out a3_20, out a4_245, out s8_246);
			if ((word32) bLoc11 != 0x00)
			{
				word32 s1_283;
				word32 a0_284;
				word32 a1_285;
				word32 a2_286;
				word32 a5_287;
				word32 a7_288;
				word32 s2_289;
				word32 s3_290;
				word32 s4_291;
				word32 s5_292;
				word32 s6_293;
				word32 s7_294;
				word32 s8_295;
				word32 s9_296;
				word32 s10_297;
				word32 s11_298;
				word32 t4_299;
				printf(ra, &g_t230B65E8, a3_20, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_283, out a0_284, out a1_285, out a2_286, out a3_38, out a4_39, out a5_287, out a7_288, out s2_289, out s3_290, out s4_291, out s5_292, out s6_293, out s7_294, out s8_295, out s9_296, out s10_297, out s11_298, out t4_299);
				if ((atomic_get(0x4200D6C4) >> 3 & 0x01) != 0x00)
					return;
				a0_59 = 0x01;
			}
			else
			{
				word32 s1_266;
				word32 a0_267;
				word32 a1_268;
				word32 a2_269;
				word32 a5_270;
				word32 a7_271;
				word32 s2_272;
				word32 s3_273;
				word32 s4_274;
				word32 s5_275;
				word32 s6_276;
				word32 s7_277;
				word32 s8_278;
				word32 s9_279;
				word32 s10_280;
				word32 s11_281;
				word32 t4_282;
				printf(ra, &g_t230B6608, a3_20, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_266, out a0_267, out a1_268, out a2_269, out a3_38, out a4_39, out a5_270, out a7_271, out s2_272, out s3_273, out s4_274, out s5_275, out s6_276, out s7_277, out s8_278, out s9_279, out s10_280, out s11_281, out t4_282);
				if ((atomic_get(0x4200D6C4) >> 3 & 0x01) == 0x00)
					return;
				a0_59 = 0x00;
			}
			word32 s1_300;
			word32 a0_301;
			word32 a3_302;
			word32 s2_303;
			word32 s3_304;
			word32 s4_305;
			word32 s5_306;
			word32 s6_307;
			word32 s8_308;
			bt_mesh_beacon_ivu_initiator(0x4200D000, a0_59, a3_38, a4_39, mstatus, dwLoc2C, dwArg04, dwArg08, a3, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgF8, dwArg0108, dwArg0148, out s1_300, out a0_301, out a3_302, out s2_303, out s3_304, out s4_305, out s5_306, out s6_307, out s8_308);
			return;
		}
		a0_121 = (struct Eq_274 *) &g_t230B67DC;
	}
	word32 s1_247;
	word32 a0_248;
	word32 a1_249;
	word32 a2_250;
	word32 a3_251;
	word32 a4_252;
	word32 a5_253;
	word32 a7_254;
	word32 s2_255;
	word32 s3_256;
	word32 s4_257;
	word32 s5_258;
	word32 s6_259;
	word32 s7_260;
	word32 s8_261;
	word32 s9_262;
	word32 s10_263;
	word32 s11_264;
	word32 t4_265;
	printf(ra, a0_121, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_247, out a0_248, out a1_249, out a2_250, out a3_251, out a4_252, out a5_253, out a7_254, out s2_255, out s3_256, out s4_257, out s5_258, out s6_259, out s7_260, out s8_261, out s9_262, out s10_263, out s11_264, out t4_265);
}

// 2303AE7E: void fault_get_cur(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack (ptr32 word16) dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack word32 dwArgA4)
void fault_get_cur(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, word16 * dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, word32 dwArgA4)
{
	byte * a1_19;
	byte * a4_22;
	word32 t4_171;
	word32 s9_168;
	word32 s10_169;
	word32 s11_170;
	word32 s6_165;
	word32 s7_166;
	word32 s8_167;
	word32 s3_162;
	word32 s4_163;
	word32 s5_164;
	word32 a5_159;
	word32 a7_160;
	word32 s2_161;
	word32 s1_156;
	word32 a0_157;
	word32 a2_158;
	byte * a3_21;
	printf(ra, &g_t230B6840, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_156, out a0_157, out a1_19, out a2_158, out a3_21, out a4_22, out a5_159, out a7_160, out s2_161, out s3_162, out s4_163, out s5_164, out s6_165, out s7_166, out s8_167, out s9_168, out s10_169, out s11_170, out t4_171);
	0x00 = dwArgA4;
	*a1_19 = 0x00;
	*dwArg44 = 1521;
	up32 a0_45 = (word32) *a4_22;
	*a4_22 = 0x00;
	byte * a5_46 = g_a4200F3F4;
	while ((word32) *a4_22 < a0_45)
	{
		word32 a1_57 = (word32) *a5_46;
		if (a1_57 != 0x00)
		{
			*a3_21 = (byte) a1_57;
			*a4_22 = (byte) ((word32) *a4_22 + 0x01);
			++a3_21;
		}
		++a5_46;
		if (a5_46 == (byte *) ~0x4200F3EF)
			return;
	}
}

// 2303AEEE: void show_faults(Register Eq_2 ra, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC)
// Called from:
//      health_current_status
void show_faults(Eq_2 ra, word32 a2, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC)
{
	if (a3 != 0x00)
	{
		word32 s0_46 = a2;
		word32 a0_181;
		word32 a1_182;
		word32 a2_183;
		word32 a4_184;
		word32 a5_185;
		word32 a7_186;
		word32 s2_187;
		word32 s3_188;
		word32 s4_189;
		word32 s5_190;
		word32 s6_191;
		word32 s7_192;
		word32 s8_193;
		word32 s9_194;
		word32 s10_195;
		word32 s11_196;
		word32 t4_197;
		word32 s1_32;
		Eq_2 a3_28;
		Eq_2 ra_31 = printf(ra, &g_t230B6B1C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_32, out a0_181, out a1_182, out a2_183, out a3_28, out a4_184, out a5_185, out a7_186, out s2_187, out s3_188, out s4_189, out s5_190, out s6_191, out s7_192, out s8_193, out s9_194, out s10_195, out s11_196, out t4_197);
		word32 s2_45 = 0x230B7000;
		while (s0_46 != s1_32)
		{
			++s0_46;
			word32 a0_217;
			word32 a1_218;
			word32 a2_219;
			word32 a4_220;
			word32 a5_221;
			word32 a7_222;
			word32 s3_223;
			word32 s4_224;
			word32 s5_225;
			word32 s6_226;
			word32 s7_227;
			word32 s8_228;
			word32 s9_229;
			word32 s10_230;
			word32 s11_231;
			word32 t4_232;
			ra_31 = printf(ra_31, s2_45 + -1192, a3_28, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_32, out a0_217, out a1_218, out a2_219, out a3_28, out a4_220, out a5_221, out a7_222, out s2_45, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231, out t4_232);
		}
		0x00 = dwArg38;
	}
	else
	{
		word32 s1_198;
		word32 a0_199;
		word32 a1_200;
		word32 a2_201;
		word32 a3_202;
		word32 a4_203;
		word32 a5_204;
		word32 a7_205;
		word32 s2_206;
		word32 s3_207;
		word32 s4_208;
		word32 s5_209;
		word32 s6_210;
		word32 s7_211;
		word32 s8_212;
		word32 s9_213;
		word32 s10_214;
		word32 s11_215;
		word32 t4_216;
		printf(ra, &g_t230B6AE4, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_198, out a0_199, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a7_205, out s2_206, out s3_207, out s4_208, out s5_209, out s6_210, out s7_211, out s8_212, out s9_213, out s10_214, out s11_215, out t4_216);
	}
}

