pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303AF44: void health_current_status(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC)
void health_current_status(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgBC)
{
	Eq_2 a5_21;
	word32 a4_26;
	word32 s1_100;
	word32 a0_101;
	word32 a1_102;
	word32 a2_103;
	word32 a3_104;
	word32 a7_105;
	word32 s2_106;
	word32 s3_107;
	word32 s4_108;
	word32 s5_109;
	word32 s6_110;
	word32 s7_111;
	word32 s8_112;
	word32 s9_113;
	word32 s10_114;
	word32 s11_115;
	word32 t4_116;
	Eq_2 ra_28 = printf(ra, &g_t230B68AC, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_100, out a0_101, out a1_102, out a2_103, out a3_104, out a4_26, out a5_21, out a7_105, out s2_106, out s3_107, out s4_108, out s5_109, out s6_110, out s7_111, out s8_112, out s9_113, out s10_114, out s11_115, out t4_116);
	show_faults(ra_28, a4_26, a5_21, dwArg08, dwArg18, dwArg28, dwArg38, dwArg60, a4, dwArg70, dwArg74, dwArg88, dwArg98, dwArgAC, dwArgBC);
}

// 2303AF78: void blemesh_cli_register()
// Called from:
//      bt_enable_cb
void blemesh_cli_register()
{
}

// 2303AF7C: Register Eq_2 send_friend_poll(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_187080) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_187085) a4Out, Register out Eq_187086 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_lpn_msg_received
//      bt_mesh_lpn_poll
//      ctl_recv
Eq_2 send_friend_poll(Eq_2 ra, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, struct Eq_187080 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, struct Eq_187085 & a4Out, union Eq_187086 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 s1;
	struct Eq_187085 * a4_100;
	ptr32 a0_131;
	word32 t1_244;
	word32 a0_245;
	word32 a2_246;
	word32 a4_247;
	word32 a5_248;
	ptr32 a1_195;
	ptr32 a3_197;
	Eq_2 ra_105 = memset(ra, fp + -0x0022, 0x00, 0x12, out t1_244, out a0_245, out a1_195, out a2_246, out a3_197, out a4_247, out a5_248);
	word16 wLoc28_148 = (word16) (word32) g_w4200D8DC;
	word32 a5_249;
	word16 wLoc2C_154 = (word16) bt_mesh_primary_addr(out a5_249);
	struct Eq_187080 * s0_106 = &g_t4200D6BC;
	Eq_187086 a5_101 = (word32) g_b4200D7E7;
	Eq_2 dwLoc2C_161 = SEQ((word16) ((word32) wLoc2A & -0x0200 | 265), wLoc2C_154);
	Eq_2 dwLoc28_173 = SEQ(~0x00, wLoc28_148);
	Eq_2 dwLoc38_175 = SEQ((byte) (g_t4200D7F0 >> 3 & 0x01), (word24) (fp + -40));
	if (a5_101 != 0x00)
	{
		a4_100 = (struct Eq_187085 *) 0x01;
		a0_131 = 0x00;
		if (a5_101 != 0x01)
		{
			ui32 a5_132 = (word32) g_t4200D7F0;
			g_t4200D7F0 = (byte) (a5_132 | 2);
			a5_101 = a5_132 | 2;
		}
	}
	else
	{
		word32 s5_250;
		word32 s8_251;
		word32 s11_252;
		ra_105 = bt_mesh_ctl_send(ra_105, 0x4200D6BC, fp + -52, 0x00, 588036552, s2, s3, s4, s5, s6, s7, s8, mstatus, dwLoc40, dwLoc38_175, dwLoc34, dwLoc30, dwLoc2C_161, dwLoc28_173, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, 0x4200D8C0, 0x00, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_106, out s1, out a0_131, out a1_195, out a3_197, out a4_100, out a5_101, out s2, out s3, out s4, out s5_250, out s6, out s7, out s8_251, out s9, out s11_252, out mstatus);
		if (a0_131 == 0x00)
		{
			s0_106->t0134 = (byte) ((word32) s0_106->t0134 & ~0x02);
			s0_106->b012B = 0x01;
			a5_101.u0 = 0x01;
		}
	}
	s0Out = s0_106;
	s1Out = s1;
	a0Out = a0_131;
	a1Out = a1_195;
	a3Out = a3_197;
	a4Out = a4_100;
	a5Out = a5_101;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra_105;
}

// 2303B030: Register word32 group_zero(Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      clear_friendship
//      req_sent
//      sub_update
//      ctl_recv
word32 group_zero(Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 s4_14;
	ptr32 s8_15;
	word32 a0_21;
	word32 s0_13 = atomic_set(s1, null, a3, a4, mstatus, out a0_21, out a3_10, out a4_11, out s4_14, out s8_15);
	a3Out = a3_10;
	a4Out = a4_11;
	s4Out = s4_14;
	s8Out = s8_15;
	return s0_13;
}

// 2303B036: Register Eq_2 clear_friendship(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      friend_clear_sent
//      bt_mesh_lpn_disable
//      ctl_recv
Eq_2 clear_friendship(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s0Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	byte bLoc39_449 = SLICE(dwLoc3C, byte, 24);
	Eq_2 a4_182;
	Eq_2 s0_184;
	Eq_2 s3_119;
	Eq_2 s4_185;
	struct Eq_187380 * sp_115 = fp + -80;
	Eq_2 a0_19 = bt_mesh_cfg_get();
	struct Eq_187388 * s0_116 = &g_t4200D6BC;
	if (a0 == 0x00)
	{
		a4.u0 = 0x10;
		if ((g_t4200D7F0 & 48) == 0x10)
		{
			a4 = (word32) g_b4200D7EB;
			if (a4 <= 0x01)
			{
				word32 a5_619;
				word32 a3_617;
				word32 a4_618;
				word32 a1_615;
				word32 a2_616;
				word32 t1_613;
				word32 a0_614;
				Eq_2 ra_279 = memset(ra, fp + -50, 0x00, 0x12, out t1_613, out a0_614, out a1_615, out a2_616, out a3_617, out a4_618, out a5_619);
				word16 wLoc38_439 = (word16) (word32) g_w4200D8DC;
				word32 a5_620;
				word16 wLoc3C_444 = (word16) bt_mesh_primary_addr(out a5_620);
				word32 a5_621;
				byte bLoc3A_445 = (byte) bt_mesh_net_transmit_get(out a5_621);
				uint32 a5_300 = (word32) wLoc3C_444;
				uint32 a5_307 = (word32) g_w4200D7F2;
				ui32 s1_334;
				word32 s8_629;
				word32 s11_630;
				word32 s5_627;
				word32 s6_628;
				word32 a5_625;
				word32 s2_626;
				word32 a1_623;
				word32 a3_624;
				word32 a0_622;
				bt_mesh_ctl_send(ra_279, 0x4200D6BC, fp + -0x0044, 0x00, 588036536, a0, a0_19, s4, s5, s6, s7, s8, mstatus, dwLoc50, SEQ((word16) (a5_307 << 8 | a5_307 >> 0x08), (word16) (a5_300 << 8 | a5_300 >> 0x08)), dwLoc44, dwLoc40, SEQ(bLoc39_449, bLoc3A_445, wLoc3C_444), SEQ(~0x00, wLoc38_439), dwLoc28, dwLoc24, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg18, dwArg24, dwArg28, dwArg2C, 0x4200D8C0, 0x00, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_184, out s1_334, out a0_622, out a1_623, out a3_624, out a4_182, out a5_625, out s2_626, out s3_119, out s4_185, out s5_627, out s6_628, out s7, out s8_629, out s9, out s11_630, out mstatus);
				*((word32) s0_184 + 308) = (byte) ((word32) *((word32) s0_184 + 308) & ~0x04 | s1_334 << 0x02);
				goto l2303B0FC;
			}
		}
	}
	Eq_2 a3_40;
	Eq_2 a4_41;
	word32 s2_600;
	Eq_2 ra_45 = bt_mesh_rx_reset(ra, a3, a4, mstatus, dwLoc48, dwLoc3C, dwLoc38, dwLoc28, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg38, dwArg48, s3, dwArg58, dwArg78, dwArg98, dwArgB8, dwArgD8, out a3_40, out a4_41, out s2_600);
	word32 a4_605;
	word32 a5_606;
	word32 s4_607;
	word32 s8_608;
	word32 a0_601;
	word32 a1_602;
	word32 a2_603;
	word32 a3_604;
	Eq_2 s5_133;
	Eq_2 s6_134;
	Eq_2 s2_118;
	Eq_2 s1_117 = k_delayed_work_cancel(1107351544, a3_40, a4_41, mstatus, dwLoc1C, dwLoc18, dwArg58, dwArg68, dwArg98, dwArgD8, out a0_601, out a1_602, out a2_603, out a3_604, out a4_605, out a5_606, out s2_118, out s3_119, out s4_607, out s5_133, out s6_134, out s8_608);
	word32 a1_610;
	word32 a4_611;
	word32 a5_612;
	word32 a0_609;
	Eq_2 a3_127;
	Eq_2 ra_120 = friend_cred_del(ra_45, (word32) g_w4200D8DC, (word32) g_w4200D7E8, out a0_609, out a1_610, out a3_127, out a4_611, out a5_612);
	Eq_2 a4_103 = 0x00;
	if (((word32) g_t4200D7F0 & 32) == 0x00)
		a4_103 = (word32) g_w4200D7E8;
	<anonymous> * a5_102 = g_ptr4200F414;
	g_w4200D7F4 = (word16) a4_103;
	if (a5_102 != null)
	{
		word32 a0_106 = (word32) g_w4200D7E8;
		if (a0_106 != 0x00)
		{
			word32 s4_132;
			word32 s8_135;
			word32 s10_435;
			word32 s11_436;
			a5_102();
		}
	}
	s0_116->w0134 = (word16) ((word32) s0_116->w0134 & 0x00C3);
	s0_116->b012B = 0x00;
	s0_116->dw012C = 0x00;
	Eq_2 a3_157;
	Eq_2 a4_158;
	word32 s4_631;
	word32 s8_632;
	group_zero(s1_117, a3_127, a4_103, mstatus, out a3_157, out a4_158, out s4_631, out s8_632);
	Eq_2 a3_169;
	Eq_2 a4_170;
	word32 s4_633;
	word32 s8_634;
	group_zero(s1_117, a3_157, a4_158, mstatus, out a3_169, out a4_170, out s4_633, out s8_634);
	Eq_2 s8_186;
	Eq_2 a3_181;
	s0_184 = group_zero(s1_117, a3_169, a4_170, mstatus, out a3_181, out a4_182, out s4_185, out s8_186);
	*((word32) s0_184 + 308) = (byte) ((word32) *((word32) s0_184 + 308) | 1);
	if (((word32) *((word32) s3_119 + 54) & 0x08) != 0x00)
	{
		word32 a5_635;
		word32 s6_638;
		word32 s2_636;
		word32 s11_640;
		word32 s5_637;
		word32 s8_639;
		bt_mesh_heartbeat_send(ra_120, s2_118, s3_119, s4_185, s5_133, s6_134, s7, s8_186, mstatus, sp_115->t0000, sp_115->t0004, sp_115->t0008, sp_115->t0028, sp_115->t0034, sp_115->t0038, sp_115->t003C, sp_115->t004C, sp_115->t0058, sp_115->t0068, sp_115->t0078, sp_115->t0088, sp_115->t0098, sp_115->t00A8, sp_115->t00B8, sp_115->t00C8, sp_115->t00D8, sp_115->t00E8, sp_115->t00F8, sp_115->t0108, sp_115->t0118, out s0_184, out s1_117, out a3_181, out a4_182, out a5_635, out s2_636, out s3_119, out s4_185, out s5_637, out s6_638, out s7, out s8_639, out s9, out s11_640, out mstatus);
	}
	if (s1_117 != 0x00)
		*((word32) s0_184 + 296) = 0x00;
	else
	{
		*((word32) s0_184 + 296) = 0x03;
		word32 a0_642;
		word32 s1_641;
		word32 a2_644;
		word32 a1_643;
		word32 a3_645;
		word32 a5_646;
		word32 s2_647;
		word32 s5_648;
		word32 s6_649;
		word32 s8_650;
		s0_184 = k_delayed_work_submit(0x01FFFF40, a3_181, a4_182, mstatus, sp_115->t0004, sp_115->t0008, sp_115->t0024, sp_115->t0078, sp_115->t0088, sp_115->t0098, sp_115->t00A8, sp_115->t00B8, sp_115->t00C8, sp_115->t00D8, sp_115->t00F8, sp_115->t0108, sp_115->t0118, sp_115->t0128, sp_115->t0148, out s1_641, out a0_642, out a1_643, out a2_644, out a3_645, out a4_182, out a5_646, out s2_647, out s3_119, out s4_185, out s5_648, out s6_649, out s8_650);
	}
l2303B0FC:
	s0Out = s0_184;
	a3Out = s2;
	a4Out = a4_182;
	s3Out = s3_119;
	s4Out = s4_185;
	s7Out = s7;
	s9Out = s9;
	mstatusOut = mstatus;
	return dwLoc08;
}

// 2303B1BC: Register Eq_2 atomic_test_and_clear_bit(Register ui32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      ctl_recv
Eq_2 atomic_test_and_clear_bit(ui32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	Eq_2 s0_8 = 0x01 << a1;
	ui32 a0_15;
	ptr32 a3_18;
	ptr32 a4_19;
	word32 a1_36;
	word32 a2_37;
	word32 a5_38;
	word32 s4_39;
	word32 s8_40;
	Eq_2 s1_21 = atomic_and(s0_8, ~s0_8, a3, a4, mstatus, out a0_15, out a1_36, out a2_37, out a3_18, out a4_19, out a5_38, out s4_39, out s8_40);
	a0Out = (word32) ((a0_15 & s0_8) != 0x00);
	a3Out = a3_18;
	a4Out = a4_19;
	return s1_21;
}

// 2303B1DE: Register Eq_2 atomic_test_bit(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      sub_update
//      bt_mesh_lpn_group_del
//      ctl_recv
Eq_2 atomic_test_bit(Eq_2 a0, Eq_2 a1)
{
	return atomic_get(a0) >> a1 & 0x01;
}

// 2303B1F6: void friend_req_sent(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void friend_req_sent(Eq_2 ra, Eq_2 s0, word32 a0, word32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	if (a1 == 0x00)
	{
		g_w4200D7F6 = (word16) a0;
		word32 s1_132;
		word32 a0_133;
		word32 a1_134;
		word32 a2_135;
		word32 a3_136;
		word32 a4_137;
		word32 a5_138;
		word32 s2_139;
		word32 s3_140;
		word32 s4_141;
		word32 s5_142;
		word32 s6_143;
		word32 s8_144;
		*((word32) k_delayed_work_submit(a0 + 0x044C, a3, a4, mstatus, s0, dwLoc08, dwArg14, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_132, out a0_133, out a1_134, out a2_135, out a3_136, out a4_137, out a5_138, out s2_139, out s3_140, out s4_141, out s5_142, out s6_143, out s8_144) + 296) = 0x05;
	}
	else
	{
		word32 s1_145;
		word32 a0_146;
		word32 a1_147;
		word32 a2_148;
		word32 a3_149;
		word32 a4_150;
		word32 a5_151;
		word32 a7_152;
		word32 s2_153;
		word32 s3_154;
		word32 s4_155;
		word32 s5_156;
		word32 s6_157;
		word32 s7_158;
		word32 s8_159;
		word32 s9_160;
		word32 s10_161;
		word32 s11_162;
		word32 t4_163;
		printf(ra, &g_t230B7448, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_145, out a0_146, out a1_147, out a2_148, out a3_149, out a4_150, out a5_151, out a7_152, out s2_153, out s3_154, out s4_155, out s5_156, out s6_157, out s7_158, out s8_159, out s9_160, out s10_161, out s11_162, out t4_163);
	}
}

// 2303B234: void friend_clear_sent(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void friend_clear_sent(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	word32 a1_17;
	Eq_2 a3_19;
	Eq_2 a4_20;
	ptr32 mstatus_24;
	struct Eq_188190 * s0_26;
	word32 s1_214;
	word32 s2_215;
	word32 s3_216;
	word32 s4_217;
	word32 s5_218;
	word32 s6_219;
	word32 s7_220;
	word32 s8_221;
	word32 s11_222;
	Eq_2 ra_25 = bt_mesh_scan_enable(ra, 0x4200D6BC, s1, a4, s2, s4, mstatus, dwLoc1C, dwLoc18, s0, dwLoc0C, dwLoc08, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg30, dwArg34, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_26, out s1_214, out a1_17, out a3_19, out a4_20, out s2_215, out s3_216, out s4_217, out s5_218, out s6_219, out s7_220, out s8_221, out s11_222, out mstatus_24);
	s0_26->b012F = (byte) ((word32) s0_26->b012F + 0x01);
	if (a1_17 == 0x00)
	{
		s0_26->b0128 = 0x01;
		word32 s1_243;
		word32 a0_244;
		word32 a1_245;
		word32 a2_246;
		word32 a3_247;
		word32 a4_248;
		word32 a5_249;
		word32 s2_250;
		word32 s3_251;
		word32 s4_252;
		word32 s5_253;
		word32 s6_254;
		word32 s8_255;
		k_delayed_work_submit(0x044C, a3_19, a4_20, mstatus_24, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_243, out a0_244, out a1_245, out a2_246, out a3_247, out a4_248, out a5_249, out s2_250, out s3_251, out s4_252, out s5_253, out s6_254, out s8_255);
	}
	else
	{
		Eq_2 a3_88;
		Eq_2 a4_89;
		Eq_2 s3_96;
		Eq_2 s4_97;
		Eq_2 s5_98;
		Eq_2 s6_99;
		Eq_2 s7_100;
		word32 s1_223;
		word32 a0_224;
		word32 a1_225;
		word32 a2_226;
		word32 a5_227;
		word32 a7_228;
		word32 s2_229;
		word32 s8_230;
		word32 s9_231;
		word32 s10_232;
		word32 s11_233;
		word32 t4_234;
		Eq_2 ra_91 = printf(ra_25, &g_t230B7448, a3_19, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_223, out a0_224, out a1_225, out a2_226, out a3_88, out a4_89, out a5_227, out a7_228, out s2_229, out s3_96, out s4_97, out s5_98, out s6_99, out s7_100, out s8_230, out s9_231, out s10_232, out s11_233, out t4_234);
		s0_26->b0128 = 0x03;
		word32 s0_235;
		word32 a3_236;
		word32 a4_237;
		word32 s3_238;
		word32 s4_239;
		word32 s7_240;
		word32 s9_241;
		word32 mstatus_242;
		clear_friendship(ra_91, 0x00, a3_88, a4_89, s3_96, s4_97, s5_98, s6_99, s7_100, dwLoc1C, mstatus_24, dwArg00, dwArg04, dwArg08, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_235, out a3_236, out a4_237, out s3_238, out s4_239, out s7_240, out s9_241, out mstatus_242);
	}
}

