pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303B298: void req_sent(Register Eq_2 ra, Register word32 a0, Register word32 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void req_sent(Eq_2 ra, word32 a0, word32 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (a1 == 0x00)
	{
		Eq_2 a1_21;
		word32 a5_11 = (word32) g_b4200D7EB;
		g_w4200D7F6 = (word16) a0;
		g_b4200D7EB = (byte) (a5_11 + 0x01);
		if (((word32) g_t4200D7F0 & 0x10) != 0x00)
		{
			g_b4200D7E4 = 0x07;
			a1_21.u0 = 90;
		}
		else
			a1_21 = a0 + 100 + (word32) g_b4200D7EA;
		word32 s1_203;
		word32 a0_204;
		word32 a1_205;
		word32 a2_206;
		word32 a3_207;
		word32 a4_208;
		word32 a5_209;
		word32 s2_210;
		word32 s3_211;
		word32 s4_212;
		word32 s5_213;
		word32 s6_214;
		word32 s8_215;
		k_delayed_work_submit(a1_21, a3, 0x4200D000, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_203, out a0_204, out a1_205, out a2_206, out a3_207, out a4_208, out a5_209, out s2_210, out s3_211, out s4_212, out s5_213, out s6_214, out s8_215);
	}
	else
	{
		Eq_2 a3_67;
		Eq_2 a4_68;
		Eq_2 s1_71;
		word32 a5_186;
		word32 a7_187;
		word32 a2_185;
		word32 a1_184;
		word32 a0_183;
		word32 s2_188;
		word32 s3_189;
		word32 s4_190;
		word32 s5_191;
		word32 s6_192;
		word32 s7_193;
		word32 s8_194;
		word32 s9_195;
		word32 s10_196;
		word32 s11_197;
		word32 t4_198;
		printf(ra, &g_t230B7544, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_71, out a0_183, out a1_184, out a2_185, out a3_67, out a4_68, out a5_186, out a7_187, out s2_188, out s3_189, out s4_190, out s5_191, out s6_192, out s7_193, out s8_194, out s9_195, out s10_196, out s11_197, out t4_198);
		g_b4200D7E7 = 0x00;
		word32 a3_199;
		word32 a4_200;
		word32 s4_201;
		word32 s8_202;
		group_zero(s1_71, a3_67, a4_68, mstatus, out a3_199, out a4_200, out s4_201, out s8_202);
	}
}

// 2303B308: Register Eq_2 sub_update(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out Eq_2 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_lpn_group_add
//      bt_mesh_lpn_group_del
//      ctl_recv
Eq_2 sub_update(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s8, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, union Eq_2 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a0_34 = atomic_get(0x4200D82C);
	word32 a0_731;
	word32 t1_730;
	word32 a5_734;
	word32 a1_732;
	word32 a2_733;
	Eq_2 a3_138;
	Eq_2 a4_139;
	Eq_2 ra_171 = memset(ra, fp + -82, 0x00, 0x12, out t1_730, out a0_731, out a1_732, out a2_733, out a3_138, out a4_139, out a5_734);
	word16 wLoc58_327 = (word16) (word32) g_w4200D8DC;
	word16 wLoc54_329 = (word16) (word32) g_w4200D7E8;
	word32 a5_735;
	bt_mesh_primary_addr(out a5_735);
	Eq_2 s3_176 = 0x4200E000;
	Eq_2 s4_10 = a0;
	Eq_2 s6_179 = a0_34;
	Eq_2 s0_244 = 0x4200D000;
	word24 nLoc6F_380 = SLICE(fp + -88, word24, 8);
	Eq_2 dwLoc58_354 = SEQ(~0x00, wLoc58_327);
	Eq_2 dwLoc54_444 = SEQ(SLICE(s8, word16, 16), wLoc54_329);
	if ((word32) g_b4200D7E7 == 0x00)
	{
		s2.u0 = 0x4200D6BC;
		Eq_2 s5_107 = 0x00;
		Eq_2 s0_154 = 0x4200D6BC;
		Eq_2 s1_141 = 0x00;
		s7.u0 = 0x07;
		Eq_2 s8_143 = 0x4200E000;
		s11 = 0x05;
		do
		{
			if ((word32) *((word32) s0_154 + 352) != 0x00)
			{
				if (s4_10 == 0x07)
				{
					if (atomic_test_bit(0x4200D82C, s1_141) == 0x00)
						goto l2303B3BC;
				}
				else if (atomic_test_bit((word32) s8_143 - 0x07CC, s1_141) != 0x00)
				{
l2303B3BC:
					word32 a4_736;
					word32 a5_737;
					if ((word32) s5_107 + __popcountsi2(a0_34, out a4_736, out a5_737) >= (word32) g_b4200D7F1)
					{
						word32 a7_746;
						word32 s10_748;
						word32 t4_749;
						word32 s9_747;
						word32 a1_743;
						word32 a5_745;
						word32 a2_744;
						word32 a0_742;
						ra_171 = printf(ra_171, &g_t230B7568, a3_138, dwLoc78, dwLoc58_354, dwLoc10, dwLoc0C, dwArg18, ra, out s1_141, out a0_742, out a1_743, out a2_744, out a3_138, out a4_139, out a5_745, out a7_746, out s2, out s3_176, out s4_10, out s5_107, out s6_179, out s7, out s8_143, out s9_747, out s10_748, out s11, out t4_749);
						break;
					}
					uint32 a4_110 = (word32) *((word32) s0_154 + 352);
					Eq_2 a3_115 = (s5_107 << 0x01) + (fp + -64);
					uint32 a5_122 = (word32) (word16) (a4_110 >> 0x08 | a4_110 << 8);
					*((word32) a3_115 + 4049) = (byte) a5_122;
					*((word32) a3_115 + 4050) = (byte) (a5_122 >> 8);
					Eq_2 a2_119 = (word32) s5_107 + 1;
					dwArg04 = a2_119;
					word32 a5_741;
					word32 a0_738;
					word32 a2_740;
					word32 a1_739;
					s1_141 = atomic_or(s0_154, 0x01 << s1_141, a3_115, a4_110 << 8, mstatus, out a0_738, out a1_739, out a2_740, out a3_138, out a4_139, out a5_741, out s4_10, out s8_143);
					if (a2_119 == 0x05)
					{
						s5_107.u0 = 0x05;
						goto l2303B442;
					}
					s5_107 = a2_119;
				}
			}
			s1_141 = (word32) s1_141 + 1;
			s0_154 = (word32) s0_154 + 2;
		} while (s1_141 != 0x08);
		if (s5_107 != 0x00)
		{
l2303B442:
			word32 a5_193 = (word32) *((byte) s2.u0 + 297);
			*((byte) s2.u0 + 297) = (byte) (a5_193 + 1);
			byte bLoc70_359 = (byte) a5_193;
			int32 a0_234;
			word32 a5_751;
			word32 s9_753;
			word32 s5_752;
			word32 a1_750;
			bt_mesh_ctl_send(ra_171, s0_154, fp + -100, 0x00, 588036552, s2, s3_176, s4_10, s5_107, s6_179, s7, s8_143, mstatus, dwLoc80, dwLoc78, dwLoc74, SEQ(nLoc6F_380, bLoc70_359), dwLoc6C, dwLoc68, dwLoc58_354, dwLoc54_444, s6, s4, s2, dwLoc40, dwLoc3C, dwLoc38, dwLoc18, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, 0x4200D8C0, dwArg18, s9, s1, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, out s0_244, out s1_141, out a0_234, out a1_750, out a3_138, out a4_139, out a5_751, out s2, out s3_176, out s4_10, out s5_752, out s6_179, out s7, out s8, out s9_753, out s11, out mstatus);
			if (a0_234 >= 0x00)
			{
				*((byte) s2.u0 + 299) = (byte) s4_10;
				*((byte) s2.u0 + 298) = (byte) (word32) bLoc70_359;
l2303B480:
				s0Out = s0_244;
				s1Out = dwArg0118;
				a3Out = dwLoc14;
				a4Out = a4_139;
				s2Out = s2;
				s3Out = s3_176;
				s4Out = s4_10;
				s5Out = dwLoc54_444;
				s6Out = s6_179;
				s7Out = s7;
				s8Out = s8;
				s9Out = dwLoc74;
				s11Out = s11;
				mstatusOut = mstatus;
				return dwArg0158;
			}
		}
		word32 a3_754;
		s0_244 = group_zero(s1_141, a3_138, a4_139, mstatus, out a3_754, out a4_139, out s4_10, out s8);
	}
	goto l2303B480;
}

// 2303B49E: Register Eq_2 friend_response_received.constprop.7(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_lpn_msg_received
//      ctl_recv
Eq_2 friend_response_received.constprop.7(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a4_10 = (word32) g_b4200D7E7;
	if (a4_10 == 0x01)
		g_t4200D7F0 = (byte) ((word32) g_t4200D7F0 ^ 8);
	Eq_2 a3_27;
	Eq_2 a4_28;
	Eq_2 s2_31;
	Eq_2 s3_36;
	word32 s8_176;
	word32 s6_175;
	word32 s5_174;
	word32 s4_173;
	word32 a5_172;
	word32 a2_171;
	word32 a1_170;
	word32 a0_169;
	k_delayed_work_cancel(1107351544, a3, a4_10, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_169, out a1_170, out a2_171, out a3_27, out a4_28, out a5_172, out s2_31, out s3_36, out s4_173, out s5_174, out s6_175, out s8_176);
	ptr32 a3_51;
	ptr32 a4_52;
	ptr32 mstatus_56;
	ptr32 s1_58;
	ptr32 s2_61;
	ptr32 s3_62;
	ptr32 s4_63;
	ptr32 s5_64;
	ptr32 s6_65;
	ptr32 s7_66;
	ptr32 s8_67;
	ptr32 s9_68;
	Eq_2 ra_57 = bt_mesh_scan_disable(ra, 0x4200D6BC, a3_27, a4_28, s2_31, s3_36, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg4C, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_58, out a3_51, out a4_52, out s2_61, out s3_62, out s4_63, out s5_64, out s6_65, out s7_66, out s8_67, out s9_68, out mstatus_56);
	g_b4200D7E4 = 0x06;
	g_b4200D7EB = 0x00;
	g_b4200D7E7 = 0x00;
	s1Out = s1_58;
	a3Out = a3_51;
	a4Out = a4_52;
	s2Out = s2_61;
	s3Out = s3_62;
	s4Out = s4_63;
	s5Out = s5_64;
	s6Out = s6_65;
	s7Out = s7_66;
	s8Out = s8_67;
	s9Out = s9_68;
	mstatusOut = mstatus_56;
	return ra_57;
}

// 2303B4EC: Register Eq_2 send_friend_req.constprop.8(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_lpn_set
//      bt_mesh_lpn_init
Eq_2 send_friend_req.constprop.8(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	word32 a5_164;
	bt_mesh_comp_get(out a5_164);
	word32 t1_165;
	word32 a0_166;
	word32 a1_167;
	word32 a2_168;
	word32 a3_169;
	word32 a4_170;
	word32 a5_171;
	Eq_2 ra_23 = memset(ra, fp + -0x0022, 0x00, 0x12, out t1_165, out a0_166, out a1_167, out a2_168, out a3_169, out a4_170, out a5_171);
	word16 wLoc28_113 = (word16) (word32) g_w4200D8DC;
	word32 a5_172;
	word16 wLoc2C_121 = (word16) bt_mesh_primary_addr(out a5_172);
	uint32 a5_58 = (word32) g_w4200D7F2;
	ptr32 a3_79;
	ptr32 a4_80;
	ptr32 mstatus_84;
	word32 s0_173;
	word32 s1_174;
	word32 a0_175;
	word32 a1_176;
	word32 a5_177;
	word32 s2_178;
	word32 s3_179;
	word32 s4_180;
	word32 s5_181;
	word32 s6_182;
	word32 s7_183;
	word32 s8_184;
	word32 s9_185;
	word32 s11_186;
	Eq_2 ra_85 = bt_mesh_ctl_send(ra_23, 0x4200D6BC, fp + -52, 0x00, 0x230CB9C0, s2, s3, s4, s5, s6, s7, s8, mstatus, 0x01006401, SEQ(SLICE(fp + -40, word16, 16), (word16) (a5_58 << 8 | a5_58 >> 0x08)), dwLoc34, dwLoc30, SEQ(bLoc29, 0x09, wLoc2C_121), SEQ(~0x00, wLoc28_113), dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, 0x4200D8C0, 0x00, dwArg4C, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_173, out s1_174, out a0_175, out a1_176, out a3_79, out a4_80, out a5_177, out s2_178, out s3_179, out s4_180, out s5_181, out s6_182, out s7_183, out s8_184, out s9_185, out s11_186, out mstatus_84);
	a3Out = a3_79;
	a4Out = a4_80;
	mstatusOut = mstatus_84;
	return ra_85;
}

// 2303B598: void lpn_timeout()
void lpn_timeout()
{
	if (((word32) g_b4200D7E4 + ~0x00 & 0x00FF) > 0x07)
		;
}

// 2303B724: Register Eq_189182 poll_timeout.constprop.4(Register out Eq_189182 a3Out, Register out Eq_189184 a4Out)
// Called from:
//      ctl_recv
Eq_189182 poll_timeout.constprop.4(union Eq_189182 & a3Out, union Eq_189184 & a4Out)
{
	Eq_189182 a0_26;
	if (bt_mesh_tx_in_progress() != 0x00)
	{
		ui32 a0_33 = 33553640 - ((word32) g_b4200D7EA + ((word32) g_w4200D7F6 + 100));
		a0_26 = a0_33 << 2;
		if (a0_33 << 2 > 1000)
			a0_26.u0 = 1000;
	}
	else
	{
		ui32 a4_17 = 33553640 - ((word32) g_b4200D7EA + ((word32) g_w4200D7F6 + 100));
		a3 = g_t4200D7EC;
		a4 = a4_17 << 2;
		if (a3 < a4_17 << 2)
		{
			a3 <<= 1;
			if (a4_17 << 2 < a3 << 1)
				a3 = a4_17 << 2;
			g_t4200D7EC = a3;
		}
		a0_26 = g_t4200D7EC;
	}
	a3Out = a3;
	a4Out = a4;
	return a0_26;
}

// 2303B792: Register Eq_2 bt_mesh_lpn_disable(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out Eq_2 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_lpn_set
//      bt_mesh_reset
Eq_2 bt_mesh_lpn_disable(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, ptr32 & s0Out, union Eq_2 & a3Out, ptr32 & mstatusOut)
{
	if ((word32) g_b4200D7E4 == 0x00)
	{
		s0Out = s0;
		a3Out = a3;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a3_21;
		ptr32 s0_27;
		ptr32 mstatus_42;
		word32 a4_119;
		word32 s3_120;
		word32 s4_121;
		word32 s7_122;
		word32 s9_123;
		Eq_2 ra_26 = clear_friendship(ra, a0, a3, a4, s3, s4, s5, s6, s7, s8, mstatus, dwArg00, dwArg04, dwArg08, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_27, out a3_21, out a4_119, out s3_120, out s4_121, out s7_122, out s9_123, out mstatus_42);
		s0Out = s0_27;
		a3Out = a3_21;
		mstatusOut = mstatus_42;
		return ra_26;
	}
}

