pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303B7A4: Register Eq_2 bt_mesh_lpn_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out ptr32 a0Out, Register out Eq_2 a3Out)
// Called from:
//      blemesh_lpn_set
Eq_2 bt_mesh_lpn_set(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, ptr32 & a0Out, union Eq_2 & a3Out)
{
	word32 a5_12 = (word32) g_b4200D7E4;
	if (a0 != 0x00)
	{
		if (a5_12 != 0x00)
			goto l2303B7C0;
	}
	else if (a5_12 == 0x00)
		goto l2303B7C0;
	if (bt_mesh_is_provisioned() == 0x00)
	{
		if (a0 != 0x00)
			g_b4200D7E4 = 0x03;
		else
			g_b4200D7E4 = 0x00;
	}
	else if (a0 != 0x00)
	{
		g_b4200D7E4 = 0x03;
		word32 mstatus_226;
		word32 a4_225;
		ra = send_friend_req.constprop.8(ra, a0, s2, s3, s4, s5, s6, s7, s8, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg3C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out a3, out a4_225, out mstatus_226);
	}
	else
	{
		word32 mstatus_224;
		word32 s0_223;
		ra = bt_mesh_lpn_disable(ra, 0x00, a3, a4, s3, s4, s5, s6, s7, s8, mstatus, dwLoc10, s0, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_223, out a3, out mstatus_224);
	}
l2303B7C0:
	a0Out = 0x00;
	a3Out = a3;
	return ra;
}

// 2303B7FC: Register Eq_2 bt_mesh_lpn_msg_received(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out Eq_189387 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_189390) s4Out, Register out ptr32 s6Out, Register out (ptr32 Eq_189392) s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_trans_recv
Eq_2 bt_mesh_lpn_msg_received(Eq_2 ra, Eq_2 s0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a1Out, union Eq_189387 & a4Out, ptr32 & s2Out, ptr32 & s3Out, struct Eq_189390 & s4Out, ptr32 & s6Out, struct Eq_189392 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a3_6 = (word32) g_b4200D7E4;
	if (a3_6 != 0x02)
	{
		if ((word32) g_b4200D7E7 == 0x01)
		{
			ptr32 mstatus_23;
			Eq_2 s2_28;
			Eq_2 s3_29;
			Eq_2 s4_30;
			Eq_2 s5_31;
			Eq_2 s6_32;
			Eq_2 s7_33;
			Eq_2 s8_34;
			word32 s1_220;
			word32 a3_221;
			word32 a4_222;
			word32 s9_223;
			Eq_2 ra_24 = friend_response_received.constprop.7(ra, s0, a3_6, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1_220, out a3_221, out a4_222, out s2_28, out s3_29, out s4_30, out s5_31, out s6_32, out s7_33, out s8_34, out s9_223, out mstatus_23);
			ptr32 a1_46;
			Eq_189387 a4_49;
			ptr32 mstatus_53;
			Eq_2 s0_55;
			ptr32 s1_56;
			ptr32 s2_59;
			ptr32 s3_60;
			struct Eq_189390 * s4_61;
			ptr32 s6_63;
			struct Eq_189392 * s7_64;
			ptr32 s9_66;
			word32 a0_234;
			word32 a3_235;
			word32 a5_236;
			Eq_2 ra_54 = send_friend_poll(ra_24, s2_28, s3_29, s4_30, s5_31, s6_32, s7_33, s8_34, mstatus_23, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_55, out s1_56, out a0_234, out a1_46, out a3_235, out a4_49, out a5_236, out s2_59, out s3_60, out s4_61, out s6_63, out s7_64, out s9_66, out mstatus_53);
			s0Out = s0_55;
			s1Out = s1_56;
			a1Out = a1_46;
			a4Out = a4_49;
			s2Out = s2_59;
			s3Out = s3_60;
			s4Out = s4_61;
			s6Out = s6_63;
			s7Out = s7_64;
			s9Out = s9_66;
			mstatusOut = mstatus_53;
			return ra_54;
		}
		else
		{
			ptr32 a1_79;
			Eq_189387 a4_82;
			ptr32 s1_85;
			ptr32 s2_88;
			ptr32 s3_89;
			struct Eq_189390 * s4_90;
			ptr32 s6_92;
			struct Eq_189392 * s7_93;
			ptr32 s9_95;
			word32 a0_224;
			word32 a2_225;
			word32 a3_226;
			word32 a5_227;
			word32 a7_228;
			word32 s5_229;
			word32 s8_230;
			word32 s10_231;
			word32 s11_232;
			word32 t4_233;
			Eq_2 ra_84 = printf(ra, &g_t230B7418, a3_6, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_85, out a0_224, out a1_79, out a2_225, out a3_226, out a4_82, out a5_227, out a7_228, out s2_88, out s3_89, out s4_90, out s5_229, out s6_92, out s7_93, out s8_230, out s9_95, out s10_231, out s11_232, out t4_233);
			s0Out = s0;
			s1Out = s1_85;
			a1Out = a1_79;
			a4Out = a4_82;
			s2Out = s2_88;
			s3Out = s3_89;
			s4Out = s4_90;
			s6Out = s6_92;
			s7Out = s7_93;
			s9Out = s9_95;
			mstatusOut = mstatus;
			return ra_84;
		}
	}
	else
	{
		Eq_189387 a4_104;
		ptr32 s1_107;
		ptr32 s2_108;
		ptr32 s3_109;
		struct Eq_189390 * s4_110;
		ptr32 a1_114;
		ptr32 s6_118;
		word32 a0_214;
		word32 a2_215;
		word32 a3_216;
		word32 a5_217;
		word32 s5_218;
		word32 s8_219;
		s0Out = k_delayed_work_submit(0x00, a3_6, 0x02, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_107, out a0_214, out a1_114, out a2_215, out a3_216, out a4_104, out a5_217, out s2_108, out s3_109, out s4_110, out s5_218, out s6_118, out s8_219);
		s1Out = s1_107;
		a1Out = a1_114;
		a4Out = a4_104;
		s2Out = s2_108;
		s3Out = s3_109;
		s4Out = s4_110;
		s6Out = s6_118;
		s7Out = s7;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
}

