pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303B842: Register Eq_2 bt_mesh_lpn_friend_offer(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_lpn_friend_offer(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a3_103;
	ptr32 a1_101;
	Eq_2 a4_104;
	ptr32 s1_113;
	struct Eq_274 * a0_115;
	Eq_2 a3_13 = (word32) *((word32) a1 + 4);
	if (a3_13 > 0x05)
	{
		a3_13 = (word32) g_b4200D7E4;
		if (a3_13 != 0x05)
		{
			word32 s1_289;
			word32 a0_290;
			word32 a2_291;
			word32 a5_292;
			word32 a7_293;
			word32 s2_294;
			word32 s5_295;
			word32 s6_296;
			word32 s8_297;
			word32 s10_298;
			word32 s11_299;
			word32 t4_300;
			ra = printf(ra, &g_t230B726C, a3_13, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_289, out a0_290, out a1_101, out a2_291, out a3_103, out a4_104, out a5_292, out a7_293, out s2_294, out s3, out s4, out s5_295, out s6_296, out s7, out s8_297, out s9, out s10_298, out s11_299, out t4_300);
			s1_113 = 0x00;
		}
		else
		{
			if ((word32) *s1 == 0x00)
			{
				a0_115 = (struct Eq_274 *) &g_t230B7290;
l2303B85E:
				word32 s1_277;
				word32 a0_278;
				word32 a2_279;
				word32 a5_280;
				word32 a7_281;
				word32 s2_282;
				word32 s5_283;
				word32 s6_284;
				word32 s8_285;
				word32 s10_286;
				word32 s11_287;
				word32 t4_288;
				ra = printf(ra, a0_115, a3_13, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_277, out a0_278, out a1_101, out a2_279, out a3_103, out a4_104, out a5_280, out a7_281, out s2_282, out s3, out s4, out s5_283, out s6_284, out s7, out s8_285, out s9, out s10_286, out s11_287, out t4_288);
				s1_113 = ~0x15;
				goto l2303B884;
			}
			uint32 a5_25 = (word32) *((word32) s1 + 5) << 8 | (word32) (*((word32) s1 + 4));
			word32 a0_28 = *a0;
			a1_101 = (word32) *((word32) a0 + 8);
			g_w4200D7E8 = (word16) a1_101;
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg24 = <invalid>;
			Eq_2 stackArg48 = <invalid>;
			Eq_2 stackArg52 = <invalid>;
			Eq_2 stackArg88 = <invalid>;
			Eq_2 stackArg96 = <invalid>;
			Eq_2 stackArg100 = <invalid>;
			Eq_2 stackArg124 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg172 = <invalid>;
			Eq_2 stackArg280 = <invalid>;
			word32 a3_313;
			word32 a4_314;
			word32 s3_315;
			friend_cred_create(ra, a0, a1, a2, a3, stackArg24, stackArg48, stackArg52, stackArg88, stackArg96, stackArg100, stackArg124, stackArg136, stackArg172, stackArg280, out a3_313, out a4_314, out s3_315);
			a4_104 = a0;
			a3_103 = (word32) (word16) (a5_25 >> 0x08 | a5_25 << 8);
			if (a0_28 == 0x00)
			{
				g_w4200D7E8 = 0x00;
				s1_113 = ~0x0B;
			}
			else
			{
				Eq_2 s2_45;
				Eq_2 s3_50;
				Eq_2 s4_51;
				Eq_2 s5_52;
				Eq_2 s6_53;
				Eq_2 s8_54;
				word32 a0_316;
				word32 a1_317;
				word32 a2_318;
				word32 a3_319;
				word32 a4_320;
				word32 a5_321;
				Eq_2 s1_44 = k_delayed_work_cancel(1107351544, a3_103, a0, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_316, out a1_317, out a2_318, out a3_319, out a4_320, out a5_321, out s2_45, out s3_50, out s4_51, out s5_52, out s6_53, out s8_54);
				g_b4200D7EA = (byte) (word32) *s1_44;
				g_b4200D7F1 = (byte) (word32) *((word32) s1_44 + 1);
				ptr32 a0_66;
				struct Eq_189801 * s0_76;
				struct Eq_189802 * s2_80;
				word32 s1_322;
				word32 a5_323;
				word32 s6_324;
				ra = send_friend_poll(ra, s2_45, s3_50, s4_51, s5_52, s6_53, s7, s8_54, mstatus, s2, s0, dwLoc08, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_76, out s1_322, out a0_66, out a1_101, out a3_103, out a4_104, out a5_323, out s2_80, out s3, out s4, out s6_324, out s7, out s9, out mstatus);
				s1_113 = a0_66;
				if (a0_66 != 0x00)
				{
					ra = friend_cred_clear(ra, s2_80, out a1_101, out a3_103, out a4_104);
					s0_76->w012C = 0x00;
					s0_76->b012E = 0x00;
					s0_76->b0135 = 0x00;
				}
				else
					s0_76->w0136 = (word16) ((word32) s0_76->w0136 + 0x01);
			}
		}
l2303B884:
		0x00 = (int8) dwArg38;
		a0Out = s1_113;
		a1Out = a1_101;
		a3Out = a3_103;
		a4Out = a4_104;
		s3Out = s3;
		s4Out = s4;
		s7Out = s7;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		a0_115 = (struct Eq_274 *) &g_t230B7250;
		goto l2303B85E;
	}
}

