pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303B920: Register Eq_2 bt_mesh_lpn_friend_clear_cfm(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_lpn_friend_clear_cfm(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 s9_117;
	ptr32 s7_115;
	ptr32 s4_112;
	ptr32 s3_111;
	ptr32 a3_103;
	ptr32 a1_101;
	ptr32 a0_120;
	ptr32 a4_104;
	Eq_2 ra_106;
	if ((word32) *((word32) a1 + 4) <= 0x03)
	{
		word32 s1_284;
		word32 a0_285;
		word32 a2_286;
		word32 a5_287;
		word32 a7_288;
		word32 s2_289;
		word32 s5_290;
		word32 s6_291;
		word32 s8_292;
		word32 s10_293;
		word32 s11_294;
		word32 t4_295;
		ra_106 = printf(ra, &g_t230B71D0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_284, out a0_285, out a1_101, out a2_286, out a3_103, out a4_104, out a5_287, out a7_288, out s2_289, out s3_111, out s4_112, out s5_290, out s6_291, out s7_115, out s8_292, out s9_117, out s10_293, out s11_294, out t4_295);
		a0_120 = ~0x15;
		goto l2303B942;
	}
	struct Eq_274 * a0_86;
	if ((word32) g_b4200D7E4 != 0x01)
		a0_86 = (struct Eq_274 *) &g_t230B71F4;
	else
	{
		Eq_2 a4_25 = (word32) *(union Eq_2 *) 0x03;
		uint32 s1_24 = (word32) *(union Eq_2 *) 0x02 << 8 | (word32) (*((union Eq_2 *) 0x01));
		uint32 s0_27 = (word32) *(union Eq_2 *) 0x04 << 8 | a4_25;
		word32 a5_308;
		if (bt_mesh_primary_addr(out a5_308) == (word32) ((word16) (s1_24 << 8 | s1_24 >> 0x08)) && (word32) g_w4200D7F2 == (word32) ((word16) (s0_27 << 8 | s0_27 >> 0x08)))
		{
			g_t4200D7F0 = (byte) ((word32) g_t4200D7F0 | 32);
			word32 s0_309;
			ra_106 = clear_friendship(ra, 0x00, a3, a4_25, s3, s4, s5, s6, s7, s8, mstatus, s2, s0, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_309, out a3_103, out a4_104, out s3_111, out s4_112, out s7_115, out s9_117, out mstatus);
l2303B96C:
			a0_120 = 0x00;
l2303B942:
			0x00 = (int8) dwArg38;
			a0Out = a0_120;
			a1Out = a1_101;
			a3Out = a3_103;
			a4Out = a4_104;
			s3Out = s3_111;
			s4Out = s4_112;
			s7Out = s7_115;
			s9Out = s9_117;
			mstatusOut = mstatus;
			return ra_106;
		}
		a0_86 = (struct Eq_274 *) &g_t230B7220;
	}
	word32 s1_296;
	word32 a0_297;
	word32 a2_298;
	word32 a5_299;
	word32 a7_300;
	word32 s2_301;
	word32 s5_302;
	word32 s6_303;
	word32 s8_304;
	word32 s10_305;
	word32 s11_306;
	word32 t4_307;
	ra_106 = printf(ra, a0_86, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_296, out a0_297, out a1_101, out a2_298, out a3_103, out a4_104, out a5_299, out a7_300, out s2_301, out s3_111, out s4_112, out s5_302, out s6_303, out s7_115, out s8_304, out s9_117, out s10_305, out s11_306, out t4_307);
	goto l2303B96C;
}

// 2303B9D8: Register Eq_2 bt_mesh_lpn_group_add(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Register out (ptr32 Eq_190084) s0Out, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s6Out, Register out ptr32 s7Out, Register out Eq_2 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mod_sub_add
//      mod_sub_va_add
//      mod_sub_va_overwrite
//      mod_sub_overwrite
Eq_2 bt_mesh_lpn_group_add(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s8, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, struct Eq_190084 & s0Out, union Eq_2 & s1Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, union Eq_2 & s6Out, ptr32 & s7Out, union Eq_2 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a4_16 = 0x4200D6BC;
	word32 a1_10;
	uint16 * a5_11 = null;
	for (a1_10 = 0x00; a1_10 != 0x08; ++a1_10)
	{
		a3 = (word32) *((word32) a4_16 + 352);
		if (a0 == a3)
		{
			word32 a5_374;
			word32 a2_371;
			word32 a3_372;
			word32 a4_373;
			word32 a0_369;
			word32 a1_370;
			s1 = atomic_and(0x4200D6BC, ~(0x01 << a1_10), a3, a4_16, mstatus, out a0_369, out a1_370, out a2_371, out a3_372, out a4_373, out a5_374, out s4, out s8);
			goto l2303BA22;
		}
		if (a5_11 == null && a3 == 0x00)
			a5_11 = (word32) a4_16 + 352;
		a4_16 = (word32) a4_16 + 2;
	}
	if (a5_11 == null)
	{
		word32 s10_367;
		word32 t4_368;
		word32 a5_364;
		word32 a7_365;
		word32 s5_366;
		word32 a2_361;
		word32 a3_362;
		word32 a4_363;
		word32 a0_359;
		word32 a1_360;
		ra = printf(ra, &g_t230B73F0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_359, out a1_360, out a2_361, out a3_362, out a4_363, out a5_364, out a7_365, out s2, out s3, out s4, out s5_366, out s6, out s7, out s8, out s9, out s10_367, out s11, out t4_368);
	}
	else
	{
		*a5_11 = (word16) a0;
		g_t4200D7F0 = (byte) ((word32) g_t4200D7F0 | 1);
	}
l2303BA22:
	if ((g_t4200D7F0 >> 4 & 0x01) == 0x00 || (word32) g_b4200D7E7 != 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		struct Eq_190084 * s0_131;
		Eq_2 s1_132;
		ptr32 s3_133;
		Eq_2 s4_134;
		Eq_2 s6_136;
		Eq_2 s9_137;
		ptr32 mstatus_142;
		ptr32 s11_144;
		Eq_2 s2_145;
		ptr32 s7_146;
		word32 a4_376;
		word32 s5_377;
		word32 s8_378;
		word32 a3_375;
		Eq_2 ra_130 = sub_update(ra, s1, 0x07, s2, s4, s6, s8, s9, mstatus, dwArg04, dwArg08, dwArg18, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, out s0_131, out s1_132, out a3_375, out a4_376, out s2_145, out s3_133, out s4_134, out s5_377, out s6_136, out s7_146, out s8_378, out s9_137, out s11_144, out mstatus_142);
		s0Out = s0_131;
		s1Out = s1_132;
		s2Out = s2_145;
		s3Out = s3_133;
		s4Out = s4_134;
		s6Out = s6_136;
		s7Out = s7_146;
		s9Out = s9_137;
		s11Out = s11_144;
		mstatusOut = mstatus_142;
		return ra_130;
	}
}

// 2303BA66: Register Eq_2 bt_mesh_lpn_group_del(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ui32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack word32 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mod_sub_del
//      mod_sub_va_del
//      mod_sub_del_all
//      mod_sub_va_overwrite
//      mod_sub_overwrite
Eq_2 bt_mesh_lpn_group_del(Eq_2 ra, Eq_2 s1, Eq_2 a0, ui32 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s6, Eq_2 s8, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, word32 dwArg0198, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 s4_201 = 0x4200D000;
	Eq_2 s1_104 = a0;
	Eq_2 s3_35 = (word32) a0 + (a1 << 1);
	word32 s8_208 = 0x4200E000;
	while (s1_104 != s3_35)
	{
		s6 = (word32) *s1_104;
		if (s6 != 0x00)
		{
			s2 = s4_201 + 0x06BC;
			Eq_2 s0_46 = 0x00;
			s11 = 0x01;
			do
			{
				if ((word32) *((word32) s2 + 352) == s6)
				{
					if (atomic_test_bit(0x4200D82C, s0_46) != 0x00 || atomic_test_bit(s8_208 + -2000, s0_46) != 0x00)
					{
						word32 a0_510;
						word32 a1_511;
						word32 a5_513;
						word32 a2_512;
						s1_104 = atomic_or(s0_46, 0x01 << s0_46, a3, a4, mstatus, out a0_510, out a1_511, out a2_512, out a3, out a4, out a5_513, out s4_201, out s8_208);
						g_t4200D7F0 = (byte) ((word32) g_t4200D7F0 | 1);
					}
					else
						*((word32) s2 + 352) = 0x00;
				}
				s0_46 = (word32) s0_46 + 1;
				s2 = (word32) s2 + 2;
			} while (s0_46 != 0x08);
		}
		s1_104 = (word32) s1_104 + 2;
	}
	if ((g_t4200D7F0 >> 4 & 0x01) == 0x00 || (word32) g_b4200D7E7 != 0x00)
	{
		0x00 = dwArg0198;
		s0Out = dwArg0158;
		s1Out = s1_104;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3_35;
		s4Out = dwLoc14;
		s5Out = 0x4200D6BC;
		s6Out = s6;
		s7Out = 0x4200E000;
		s9Out = 0x4200E000;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		0x00 = dwArg0198;
		Eq_2 a3_169;
		ptr32 s0_174;
		Eq_2 s1_175;
		Eq_2 s3_176;
		Eq_2 s4_177;
		ptr32 s5_178;
		Eq_2 s6_179;
		ptr32 s9_180;
		ptr32 mstatus_185;
		ptr32 s11_187;
		Eq_2 s2_188;
		ptr32 s7_189;
		word32 s8_509;
		word32 a4_508;
		Eq_2 ra_173 = sub_update(ra, s1_104, 0x08, s2, dwLoc14, s6, s8, 0x4200E000, mstatus, dwArg04, dwArg08, dwArg18, s9, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, out s0_174, out s1_175, out a3_169, out a4_508, out s2_188, out s3_176, out s4_177, out s5_178, out s6_179, out s7_189, out s8_509, out s9_180, out s11_187, out mstatus_185);
		s0Out = s0_174;
		s1Out = s1_175;
		a3Out = a3_169;
		s2Out = s2_188;
		s3Out = s3_176;
		s4Out = s4_177;
		s5Out = s5_178;
		s6Out = s6_179;
		s7Out = s7_189;
		s9Out = s9_180;
		s11Out = s11_187;
		mstatusOut = mstatus_185;
		return ra_173;
	}
}

