pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303BB56: Register Eq_2 bt_mesh_lpn_friend_sub_cfm(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s7Out, Register out Eq_2 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_lpn_friend_sub_cfm(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s7Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a1_130;
	ptr32 a3_132;
	ptr32 a4_133;
	Eq_2 ra_138;
	Eq_2 s3_143;
	Eq_2 s7_147;
	Eq_2 s9_149;
	Eq_2 s0_269;
	if ((word32) *((word32) a1 + 4) == 0x00)
	{
		word32 s11_718;
		word32 t4_719;
		word32 s6_715;
		word32 s8_716;
		word32 s10_717;
		word32 s2_712;
		word32 s4_713;
		word32 s5_714;
		word32 a2_709;
		word32 a5_710;
		word32 a7_711;
		word32 s1_707;
		word32 a0_708;
		ra_138 = printf(ra, &g_t230B72B4, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_707, out a0_708, out a1_130, out a2_709, out a3_132, out a4_133, out a5_710, out a7_711, out s2_712, out s3_143, out s4_713, out s5_714, out s6_715, out s7_147, out s8_716, out s9_149, out s10_717, out s11_718, out t4_719);
		s0_269.u0 = ~0x15;
		goto l2303BB78;
	}
	struct Eq_274 * a0_29;
	word32 a5_20 = (word32) g_b4200D7E7;
	Eq_2 s0_110 = 0x4200D6BC;
	if (a5_20 != 0x00)
	{
		if ((word32) *a3 != (word32) g_b4200D7E6)
		{
			word32 t4_745;
			word32 s8_742;
			word32 s10_743;
			word32 s11_744;
			word32 s4_739;
			word32 s5_740;
			word32 s6_741;
			word32 a5_736;
			word32 a7_737;
			word32 s2_738;
			word32 s1_733;
			word32 a0_734;
			word32 a2_735;
			ra_138 = printf(ra, &g_t230B7304, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_733, out a0_734, out a1_130, out a2_735, out a3_132, out a4_133, out a5_736, out a7_737, out s2_738, out s3_143, out s4_739, out s5_740, out s6_741, out s7_147, out s8_742, out s9_149, out s10_743, out s11_744, out t4_745);
l2303BBC4:
			s0_269.u0 = 0x00;
			goto l2303BB78;
		}
		Eq_2 a3_107;
		if (a5_20 == 0x07)
		{
			Eq_2 a3_96;
			Eq_2 a4_97;
			word32 s8_754;
			word32 s8_751;
			word32 a4_752;
			word32 s4_753;
			word32 a2_748;
			word32 a5_749;
			word32 s4_750;
			word32 a0_746;
			word32 a1_747;
			s0_110 = group_zero(atomic_or(0x4200D6BC, atomic_get(0x4200D830), a3, 0x07, mstatus, out a0_746, out a1_747, out a2_748, out a3_96, out a4_97, out a5_749, out s4_750, out s8_751), a3_96, a4_97, mstatus, out a3_107, out a4_752, out s4_753, out s8_754);
		}
		else
		{
			if (a5_20 != 0x08)
			{
				a0_29 = (struct Eq_274 *) &g_t230B7330;
l2303BBA4:
				word32 s10_730;
				word32 s11_731;
				word32 t4_732;
				word32 s5_727;
				word32 s6_728;
				word32 s8_729;
				word32 a7_724;
				word32 s2_725;
				word32 s4_726;
				word32 a0_721;
				word32 a2_722;
				word32 a5_723;
				word32 s1_720;
				ra_138 = printf(ra, a0_29, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_720, out a0_721, out a1_130, out a2_722, out a3_132, out a4_133, out a5_723, out a7_724, out s2_725, out s3_143, out s4_726, out s5_727, out s6_728, out s7_147, out s8_729, out s9_149, out s10_730, out s11_731, out t4_732);
				goto l2303BBC4;
			}
			word32 a0_779;
			word32 a5_782;
			word32 s4_783;
			word32 a2_781;
			word32 s8_784;
			word32 a1_780;
			Eq_2 a4_396;
			atomic_and(0x4200D6BC, ~atomic_get(0x4200D830), a3, 0x08, mstatus, out a0_779, out a1_780, out a2_781, out a3_107, out a4_396, out a5_782, out s4_783, out s8_784);
			ui32 s1_47 = 0x00;
			do
			{
				word32 a0_57;
				ui32 s1_63 = atomic_test_and_clear_bit(s1_47, a3_107, a4_396, mstatus, out a0_57, out a3_107, out a4_396);
				if (a0_57 != 0x00)
				{
					word32 a0_69;
					s1_63 = atomic_test_and_clear_bit(s1_63, a3_107, a4_396, mstatus, out a0_69, out a3_107, out a4_396);
					if (a0_69 != 0x00)
						g_a4200D81C[s1_63 * 0x02] = 0x00;
				}
				s1_47 = s1_63 + 0x01;
			} while (s1_47 != 0x08);
		}
		Eq_2 s1_139;
		Eq_2 s4_144;
		Eq_2 s5_145;
		Eq_2 s6_146;
		Eq_2 s8_148;
		Eq_2 s2_142;
		ra_138 = friend_response_received.constprop.7(ra, s0_110, a3_107, mstatus, dwLoc20, s4, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_139, out a3_132, out a4_133, out s2_142, out s3_143, out s4_144, out s5_145, out s6_146, out s7_147, out s8_148, out s9_149, out mstatus);
		if (((word32) *((word32) s0_110 + 308) & 0x01) != 0x00)
		{
			Eq_2 s1_169;
			Eq_2 s4_171;
			Eq_2 s6_173;
			Eq_2 s9_174;
			ptr32 mstatus_179;
			Eq_2 s2_182;
			Eq_2 s8_184;
			word32 s11_763;
			word32 s7_760;
			word32 s11_761;
			word32 s1_762;
			word32 a4_757;
			word32 s3_758;
			word32 s5_759;
			word32 s0_755;
			word32 a3_756;
			ra_138 = sub_update(sub_update(ra_138, s1_139, 0x07, s2_142, s4_144, s6_146, s8_148, s9_149, mstatus, s4, s2, dwLoc08, dwArg28, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, out s0_755, out s1_169, out a3_756, out a4_757, out s2_182, out s3_758, out s4_171, out s5_759, out s6_173, out s7_760, out s8_184, out s9_174, out s11_761, out mstatus_179), s1_169, 0x08, s2_182, s4_171, s6_173, s8_184, s9_174, mstatus_179, s4, s2, dwLoc08, dwArg28, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, out s0_110, out s1_762, out a3_132, out a4_133, out s2_142, out s3_143, out s4_144, out s5_145, out s6_146, out s7_147, out s8_148, out s9_149, out s11_763, out mstatus);
			if ((word32) *((word32) s0_110 + 299) == 0x00)
				*((word32) s0_110 + 308) = (byte) ((word32) *((word32) s0_110 + 308) & ~0x01);
		}
		if (((word32) *((word32) s0_110 + 308) & 0x02) != 0x00)
		{
			word32 s6_769;
			word32 a5_766;
			word32 s2_767;
			word32 s4_768;
			word32 s1_764;
			word32 a0_765;
			ra_138 = send_friend_poll(ra_138, s2_142, s3_143, s4_144, s5_145, s6_146, s7_147, s8_148, mstatus, dwLoc20, s4, s2, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg2C, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_110, out s1_764, out a0_765, out a1_130, out a3_132, out a4_133, out a5_766, out s2_767, out s3_143, out s4_768, out s6_769, out s7_147, out s9_149, out mstatus);
		}
		s0_269.u0 = 0x00;
		if ((word32) *((word32) s0_110 + 299) == 0x00)
		{
			word32 s8_778;
			Eq_2 a3_272;
			Eq_2 a4_273;
			word32 s4_775;
			word32 s5_776;
			word32 s6_777;
			word32 a2_772;
			word32 a5_773;
			word32 s2_774;
			word32 s1_770;
			word32 a0_771;
			s0_269 = k_delayed_work_submit(poll_timeout.constprop.4(out a3_272, out a4_273), a3_272, a4_273, mstatus, s4, s2, dwArg04, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_770, out a0_771, out a1_130, out a2_772, out a3_132, out a4_133, out a5_773, out s2_774, out s3_143, out s4_775, out s5_776, out s6_777, out s8_778);
		}
l2303BB78:
		s0Out = s1;
		a0Out = s0_269;
		a1Out = a1_130;
		a3Out = a3_132;
		a4Out = a4_133;
		s3Out = s3_143;
		s4Out = dwArg04;
		s7Out = s7_147;
		s9Out = s9_149;
		mstatusOut = mstatus;
		return ra_138;
	}
	else
	{
		a0_29 = (struct Eq_274 *) &g_t230B72DC;
		goto l2303BBA4;
	}
}

