pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303BC9E: Register Eq_2 bt_mesh_lpn_friend_update(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s7Out, Register out Eq_2 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_lpn_friend_update(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s7Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a1_307;
	ptr32 a3_308;
	ptr32 a4_309;
	Eq_2 ra_312;
	Eq_2 s3_315;
	Eq_2 s7_319;
	Eq_2 s9_321;
	Eq_2 s0_441;
	struct Eq_274 * a0_476;
	struct Eq_190892 * sp_162 = fp + ~0x1F;
	if ((word32) *((word32) a1 + 4) <= 0x05)
	{
		a0_476 = (struct Eq_274 *) &g_t230B735C;
		goto l2303BCBE;
	}
	struct Eq_274 * a0_478;
	Eq_2 s0_120 = 0x4200D6BC;
	if ((word32) g_b4200D7E7 != 0x01)
		a0_478 = (struct Eq_274 *) &g_t230B7378;
	else
	{
		Eq_2 s4_133 = *a0;
		Eq_2 s3_132 = a0;
		Eq_2 a4_28 = (word32) *((word32) s4_133 + 31);
		if (a4_28 != 0x02 || ((word32) (*((word32) a0 + 32)) & 0x02) != 0x00)
		{
			Eq_2 s1_128;
			Eq_2 s2_110 = 0x4200D000;
			s1_128 = s1;
			if (atomic_test_bit(0x4200D6C4, 0x03) != 0x00)
			{
				s1_128 = s1;
				if (atomic_test_bit(0x4200D6C4, 0x02) == ((word32) (*s1) >> 1 & 0x01))
				{
					word32 a0_846;
					s0_120 = bt_mesh_beacon_ivu_initiator(0x4200D6BC, 0x00, a3, a4_28, mstatus, s4, dwArg14, dwArg18, s3, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArg0108, dwArg0118, dwArg0158, out s1_128, out a0_846, out a3, out s2_110, out s3_132, out s4_133, out s5, out s6, out s8);
				}
			}
			Eq_2 ra_119;
			ra_119 = ra;
			if (((word32) *((word32) s0_120 + 308) & 0x10) == 0x00)
			{
				Eq_2 a0_83 = bt_mesh_cfg_get();
				if (((word32) *((word32) s3_132 + 32) & 0x04) == 0x00)
				{
					a0_476 = (struct Eq_274 *) &g_t230B73C8;
l2303BCBE:
					word32 s5_827;
					word32 s6_828;
					word32 s8_829;
					word32 s10_830;
					word32 s11_831;
					word32 t4_832;
					word32 s4_826;
					word32 s2_825;
					word32 s1_820;
					word32 a0_821;
					word32 a2_822;
					word32 a5_823;
					word32 a7_824;
					ra_312 = printf(ra, a0_476, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_820, out a0_821, out a1_307, out a2_822, out a3_308, out a4_309, out a5_823, out a7_824, out s2_825, out s3_315, out s4_826, out s5_827, out s6_828, out s7_319, out s8_829, out s9_321, out s10_830, out s11_831, out t4_832);
					s0_441.u0 = ~0x15;
					goto l2303BCEA;
				}
				*((word32) s0_120 + 308) = (byte) ((word32) *((word32) s0_120 + 308) | 16);
				ra_119 = ra;
				if (((word32) *((word32) a0_83 + 54) & 0x08) != 0x00)
				{
					word32 s9_849;
					word32 s11_850;
					word32 a5_848;
					word32 a4_847;
					ra_119 = bt_mesh_heartbeat_send(ra, s2_110, s3_132, s4_133, s5, s6, s7, s8, mstatus, dwLoc20, s4, s2, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg2C, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_120, out s1_128, out a3, out a4_847, out a5_848, out s2_110, out s3_132, out s4_133, out s5, out s6, out s7, out s8, out s9_849, out s11_850, out mstatus);
				}
				<anonymous> * a5_144 = g_ptr4200F414;
				if (a5_144 != null)
				{
					word32 t1_183;
					word32 t5_185;
					word32 t6_186;
					word32 tp_187;
					a5_144();
				}
				*((word32) s0_120 + 304) = 33553640 - ((word32) (*((word32) s0_120 + 302)) + ((word32) (*((word32) s0_120 + 314)) + 100)) << 2;
			}
			struct Eq_191128 * s1_223;
			Eq_2 s4_228;
			word32 s7_857;
			word32 s6_856;
			word32 a3_851;
			word32 a4_852;
			word32 s8_858;
			word32 s9_859;
			word32 s2_853;
			word32 s3_854;
			word32 s5_855;
			Eq_2 ra_222 = friend_response_received.constprop.7(ra_119, s0_120, a3, mstatus, sp_162->t0000, sp_162->t0004, sp_162->t0008, sp_162->t000C, sp_162->t0010, sp_162->t0014, sp_162->t0018, sp_162->t001C, sp_162->t0024, sp_162->t0028, sp_162->t0034, sp_162->t0038, sp_162->t0048, sp_162->t004C, sp_162->t0050, sp_162->t0054, sp_162->t0058, sp_162->t005C, sp_162->t0068, sp_162->t0078, sp_162->t0088, sp_162->t0098, sp_162->t009C, sp_162->t00A8, sp_162->t00B8, sp_162->t00C8, sp_162->t00D8, sp_162->t00E8, sp_162->t00F8, sp_162->t0108, sp_162->t0118, sp_162->t0128, out s1_223, out a3_851, out a4_852, out s2_853, out s3_854, out s4_228, out s5_855, out s6_856, out s7_857, out s8_858, out s9_859, out mstatus);
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			uint32 a5_255 = (word32) s1_223->b0004 << 24 | (((word32) s1_223->b0002 << 8 | (word32) s1_223->b0001) | (word32) s1_223->b0003 << 16);
			Eq_2 stackArg24 = <invalid>;
			Eq_2 stackArg96 = <invalid>;
			Eq_2 stackArg100 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg172 = <invalid>;
			word32 s2_870;
			word32 s3_871;
			word32 a4_869;
			word32 a3_868;
			word32 s1_866;
			word32 a0_867;
			word32 s5_872;
			word32 s6_873;
			word32 s7_874;
			word32 s9_875;
			word32 s10_876;
			bt_mesh_kr_update(ra, a0, a1, a2, a3, stackArg24, stackArg96, stackArg100, stackArg136, stackArg172, out s1_866, out a0_867, out a3_868, out a4_869, out s2_870, out s3_871, out s5_872, out s6_873, out s7_874, out s9_875, out s10_876);
			Eq_2 a3_248 = 0x0FFFFF00;
			Eq_2 s2_268 = a5_255 >> 0x18 | a5_255 << 0x18 | a5_255 >> 0x08 & 0x0FFFFF00 | a5_255 << 8 & 0x00FF0000;
			if (s4_228 != 0x00)
			{
				word32 a1_877;
				word32 a4_878;
				word32 a5_879;
				word32 s3_880;
				word32 s4_881;
				word32 s5_882;
				word32 s8_883;
				s0_120 = bt_mesh_net_beacon_update(ra_222, s4_228, out a1_877, out a3_248, out a4_878, out a5_879, out s3_880, out s4_881, out s5_882, out s8_883);
			}
			word32 a0_884;
			word32 a5_885;
			word32 s11_886;
			Eq_2 s1_304;
			Eq_2 s4_316;
			Eq_2 s5_317;
			Eq_2 s6_318;
			Eq_2 s8_320;
			Eq_2 s2_305;
			ra_312 = bt_mesh_net_iv_update(ra_222, s0_120, s2_268, (word32) s1_223->b0000 >> 1 & 0x01, a3_248, mstatus, sp_162->t0014, sp_162->t0018, sp_162->t0028, sp_162->t0038, sp_162->t0060, sp_162->t0064, sp_162->t0068, sp_162->t0078, sp_162->t0088, sp_162->t0098, sp_162->t00A8, sp_162->t00AC, sp_162->t00B8, sp_162->t00C8, sp_162->t00E8, sp_162->t00F8, sp_162->t0108, sp_162->t0118, sp_162->t0138, out s1_304, out a0_884, out a1_307, out a3_308, out a4_309, out a5_885, out s2_305, out s3_315, out s4_316, out s5_317, out s6_318, out s7_319, out s8_320, out s9_321, out s11_886);
			if (((word32) *((word32) s0_120 + 308) & 0x01) != 0x00)
			{
				Eq_2 s1_341;
				Eq_2 s4_343;
				Eq_2 s6_345;
				Eq_2 s9_346;
				ptr32 mstatus_351;
				Eq_2 s2_354;
				Eq_2 s8_356;
				word32 s0_887;
				word32 a3_888;
				word32 a4_889;
				word32 s3_890;
				word32 s5_891;
				word32 s7_892;
				word32 s11_893;
				word32 s11_894;
				ra_312 = sub_update(sub_update(ra_312, s1_304, 0x07, s2_305, s4_316, s6_318, s8_320, s9_321, mstatus, sp_162->t0004, sp_162->t0008, sp_162->t0018, sp_162->t0048, sp_162->t0058, sp_162->t0068, sp_162->t0078, sp_162->t0088, sp_162->t0098, sp_162->t00A8, sp_162->t00B8, sp_162->t00C8, sp_162->t00D8, out s0_887, out s1_341, out a3_888, out a4_889, out s2_354, out s3_890, out s4_343, out s5_891, out s6_345, out s7_892, out s8_356, out s9_346, out s11_893, out mstatus_351), s1_341, 0x08, s2_354, s4_343, s6_345, s8_356, s9_346, mstatus_351, sp_162->t0004, sp_162->t0008, sp_162->t0018, sp_162->t0048, sp_162->t0058, sp_162->t0068, sp_162->t0078, sp_162->t0088, sp_162->t0098, sp_162->t00A8, sp_162->t00B8, sp_162->t00C8, sp_162->t00D8, out s0_120, out s1_304, out a3_308, out a4_309, out s2_305, out s3_315, out s4_316, out s5_317, out s6_318, out s7_319, out s8_320, out s9_321, out s11_894, out mstatus);
				if ((word32) *((word32) s0_120 + 299) == 0x00)
					*((word32) s0_120 + 308) = (byte) ((word32) *((word32) s0_120 + 308) & ~0x01);
			}
			if ((word32) *((word32) s1_304 + 5) != 0x00)
			{
				word32 s1_895;
				word32 a0_896;
				word32 a5_897;
				word32 s2_898;
				word32 s4_899;
				word32 s6_900;
				ra_312 = send_friend_poll(ra_312, s2_305, s3_315, s4_316, s5_317, s6_318, s7_319, s8_320, mstatus, sp_162->t0000, sp_162->t0004, sp_162->t0008, sp_162->t0028, sp_162->t0034, sp_162->t0038, sp_162->t003C, sp_162->t004C, sp_162->t0058, sp_162->t0068, sp_162->t0078, sp_162->t0088, sp_162->t0098, sp_162->t00A8, sp_162->t00B8, sp_162->t00C8, sp_162->t00D8, sp_162->t00E8, sp_162->t00F8, sp_162->t0108, sp_162->t0118, out s0_120, out s1_895, out a0_896, out a1_307, out a3_308, out a4_309, out a5_897, out s2_898, out s3_315, out s4_899, out s6_900, out s7_319, out s9_321, out mstatus);
			}
			s0_441.u0 = 0x00;
			if ((word32) *((word32) s0_120 + 299) == 0x00)
			{
				Eq_2 a3_444;
				Eq_2 a4_445;
				word32 s1_901;
				word32 a0_902;
				word32 a2_903;
				word32 a5_904;
				word32 s2_905;
				word32 s4_906;
				word32 s5_907;
				word32 s6_908;
				word32 s8_909;
				s0_441 = k_delayed_work_submit(poll_timeout.constprop.4(out a3_444, out a4_445), a3_444, a4_445, mstatus, sp_162->t0004, sp_162->t0008, sp_162->t0024, sp_162->t0078, sp_162->t0088, sp_162->t0098, sp_162->t00A8, sp_162->t00B8, sp_162->t00C8, sp_162->t00D8, sp_162->t00F8, sp_162->t0108, sp_162->t0118, sp_162->t0128, sp_162->t0148, out s1_901, out a0_902, out a1_307, out a2_903, out a3_308, out a4_309, out a5_904, out s2_905, out s3_315, out s4_906, out s5_907, out s6_908, out s8_909);
			}
l2303BCEA:
			s0Out = s1;
			a0Out = s0_441;
			a1Out = a1_307;
			a3Out = a3_308;
			a4Out = a4_309;
			s3Out = s3_315;
			s4Out = dwArg04;
			s7Out = s7_319;
			s9Out = s9_321;
			mstatusOut = mstatus;
			return ra_312;
		}
		a0_478 = (struct Eq_274 *) &g_t230B7394;
	}
	word32 s2_838;
	word32 t4_845;
	word32 s4_839;
	word32 s5_840;
	word32 s6_841;
	word32 s8_842;
	word32 s10_843;
	word32 s11_844;
	word32 a7_837;
	word32 a0_834;
	word32 a2_835;
	word32 a5_836;
	word32 s1_833;
	ra_312 = printf(ra, a0_478, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_833, out a0_834, out a1_307, out a2_835, out a3_308, out a4_309, out a5_836, out a7_837, out s2_838, out s3_315, out s4_839, out s5_840, out s6_841, out s7_319, out s8_842, out s9_321, out s10_843, out s11_844, out t4_845);
	s0_441.u0 = 0x00;
	goto l2303BCEA;
}

// 2303BE6E: Register word32 bt_mesh_lpn_poll(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 a4Out, Register out Eq_191864 a5Out, Register out Eq_2 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_trans_send
word32 bt_mesh_lpn_poll(Eq_2 ra, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & a4Out, union Eq_191864 & a5Out, union Eq_2 & s2Out, ptr32 & mstatusOut)
{
	ui32 a5_5 = (word32) g_t4200D7F0;
	if ((a5_5 & 0x10) == 0x00)
	{
		a4Out = a4;
		a5Out = a5_5 & 0x10;
		s2Out = s2;
		mstatusOut = mstatus;
		return s0;
	}
	else
	{
		ptr32 a4_21;
		Eq_191864 a5_22;
		ptr32 mstatus_25;
		word32 s0_27;
		Eq_2 s2_31;
		word32 s1_119;
		word32 a0_120;
		word32 a1_121;
		word32 a3_122;
		word32 s3_123;
		word32 s4_124;
		word32 s6_125;
		word32 s7_126;
		word32 s9_127;
		send_friend_poll(ra, s2, s3, s4, s5, s6, s7, s8, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_27, out s1_119, out a0_120, out a1_121, out a3_122, out a4_21, out a5_22, out s2_31, out s3_123, out s4_124, out s6_125, out s7_126, out s9_127, out mstatus_25);
		a4Out = a4_21;
		a5Out = a5_22;
		s2Out = s2_31;
		mstatusOut = mstatus_25;
		return s0_27;
	}
}

// 2303BE82: void bt_mesh_lpn_set_cb(Register (ptr32 code) a0)
// Called from:
//      blemesh_init
void bt_mesh_lpn_set_cb(<anonymous> * a0)
{
	g_ptr4200F414 = a0;
}

