pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303BE8C: Register Eq_2 bt_mesh_lpn_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_net_start
Eq_2 bt_mesh_lpn_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 ra_164;
	ptr32 mstatus_163;
	ptr32 a4_159;
	ptr32 a3_158;
	Eq_2 s2_22;
	Eq_2 s4_24;
	word32 a0_187;
	word32 a3_188;
	word32 a4_189;
	word32 a5_190;
	word32 s3_191;
	word32 s5_192;
	Eq_2 s1_21 = k_delayed_work_init(ra, s0, 1107351544, a3, a4, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_187, out a3_188, out a4_189, out a5_190, out s2_22, out s3_191, out s4_24, out s5_192);
	Eq_2 a4_30 = (word32) g_b4200D7E4;
	if (a4_30 == 0x03)
	{
		ptr32 mstatus_68;
		Eq_2 s1_71;
		Eq_2 s2_74;
		Eq_2 s3_75;
		Eq_2 s4_76;
		Eq_2 s5_77;
		Eq_2 s6_78;
		Eq_2 s7_79;
		Eq_2 s8_80;
		word32 s0_204;
		word32 a1_205;
		word32 a3_206;
		word32 a4_207;
		word32 s11_208;
		ra_164 = send_friend_req.constprop.8(bt_mesh_scan_enable(ra, s0, s1_21, a4_30, s2_22, s4_24, mstatus, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg40, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_204, out s1_71, out a1_205, out a3_206, out a4_207, out s2_74, out s3_75, out s4_76, out s5_77, out s6_78, out s7_79, out s8_80, out s11_208, out mstatus_68), s1_71, s2_74, s3_75, s4_76, s5_77, s6_78, s7_79, s8_80, mstatus_68, dwLoc10, dwLoc0C, dwLoc08, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg3C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out a3_158, out a4_159, out mstatus_163);
	}
	else
	{
		word32 s0_193;
		word32 s1_194;
		word32 a1_195;
		word32 s2_196;
		word32 s3_197;
		word32 s4_198;
		word32 s5_199;
		word32 s6_200;
		word32 s7_201;
		word32 s8_202;
		word32 s11_203;
		ra_164 = bt_mesh_scan_enable(ra, s0, s1_21, a4_30, s2_22, s4_24, mstatus, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg40, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_193, out s1_194, out a1_195, out a3_158, out a4_159, out s2_196, out s3_197, out s4_198, out s5_199, out s6_200, out s7_201, out s8_202, out s11_203, out mstatus_163);
	}
	a3Out = a3_158;
	a4Out = a4_159;
	mstatusOut = mstatus_163;
	return ra_164;
}

// 2303BEC8: Register Eq_2 gen_onoff_set.isra.0(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_192060) a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a5, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Register out ptr32 s0Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      gen_onoff_set_unack
//      gen_onoff_set_with_ack
Eq_2 gen_onoff_set.isra.0(Eq_2 ra, Eq_2 s1, struct Eq_192060 * a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a5, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, ptr32 & s0Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s11Out)
{
	if (a0 == null)
	{
		word32 a0_241;
		word32 a1_242;
		word32 s1_240;
		word32 a2_243;
		word32 a3_244;
		word32 a4_245;
		word32 a5_246;
		word32 a7_247;
		word32 s2_248;
		word32 s3_249;
		word32 s4_250;
		word32 s5_251;
		word32 s8_252;
		word32 s10_253;
		word32 t4_254;
		ra = printf(ra, &g_t230B75EC, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_240, out a0_241, out a1_242, out a2_243, out a3_244, out a4_245, out a5_246, out a7_247, out s2_248, out s3_249, out s4_250, out s5_251, out s6, out s7, out s8_252, out s9, out s10_253, out s11, out t4_254);
	}
	else
	{
		word32 a5_239;
		word32 a1_237;
		word32 a2_238;
		if (net_buf_simple_pull_u8(a5, out a1_237, out a2_238, out a5_239) > 0x01)
		{
			word32 s1_258;
			word32 a0_259;
			word32 a1_260;
			word32 a2_261;
			word32 a3_262;
			word32 a4_263;
			word32 a5_264;
			word32 a7_265;
			word32 s2_266;
			word32 s3_267;
			word32 s4_268;
			word32 s5_269;
			word32 s8_270;
			word32 s10_271;
			word32 t4_272;
			ra = printf(ra, &g_t230B760C, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_258, out a0_259, out a1_260, out a2_261, out a3_262, out a4_263, out a5_264, out a7_265, out s2_266, out s3_267, out s4_268, out s5_269, out s6, out s7, out s8_270, out s9, out s10_271, out s11, out t4_272);
		}
		else
		{
			word32 a1_255;
			word32 a2_256;
			word32 a5_257;
			Eq_2 a0_32 = net_buf_simple_pull_u8(0x01, out a1_255, out a2_256, out a5_257);
			ui32 a2_36 = (word32) *((word32) a1 + 6);
			struct Eq_192149 * s3_38 = &a0->b0004 + 4;
			word32 a0_42;
			word32 a1_43;
			struct Eq_192154 * s1_46;
			word32 s4_47;
			struct Eq_192156 * a4_52;
			struct Eq_192157 * s0_45 = bt_mesh_srv_check_rcvd_msg_with_last(a0_32, a2_36, fp + -40, &a0->b0004 + 4, a2, out s1_46, out a0_42, out a1_43, out a4_52, out s4_47);
			if (a0_42 == 0x00)
			{
				struct Eq_192157 * a5_53 = (word32) a0->b0004;
				if (a5_53 != s0_45)
				{
					a5_53 = g_ptr420265A0;
					a0->b0004 = (byte) s0_45;
					if (a5_53 != null)
					{
						word32 a3_73;
						word32 tp_74;
						word32 a7_158;
						word32 s10_159;
						word32 s5_161;
						word32 t0_165;
						word32 t4_166;
						a5_53();
					}
				}
				bt_mesh_srv_update_last_rcvd_msg(s3_38, s4_47, (word32) s1_46->w0004, (word32) s1_46->w0006, a4_52, a5_53);
			}
		}
	}
	s0Out = dwArg0158;
	s4Out = dwArgF4;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s11Out = s11;
	return ra;
}

// 2303BF78: void gen_onoff_set_unack(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_192261) a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a5, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C)
void gen_onoff_set_unack(Eq_2 ra, Eq_2 s1, struct Eq_192261 * a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a5, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C)
{
	struct Eq_192060 * a0_5 = a0->ptr0018;
	word32 s0_40;
	word32 s4_41;
	word32 s6_42;
	word32 s7_43;
	word32 s9_44;
	word32 s11_45;
	gen_onoff_set.isra.0(ra, s1, a0_5, a1, a2, a3, a5, dwArg30, dwArg34, dwArg7C, out s0_40, out s4_41, out s6_42, out s7_43, out s9_44, out s11_45);
}

// 2303BF7E: void send_onoff_status(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack word32 dwArg0128)
// Called from:
//      gen_onoff_set_with_ack
//      gen_onoff_get
void send_onoff_status(Eq_2 ra, Eq_2 a0, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, word32 dwArg0128)
{
	Eq_2 s2_14 = *((word32) a0 + 24);
	Eq_2 a5_30;
	word32 a4_181;
	word32 a2_180;
	word32 a1_179;
	Eq_2 s1_31 = bt_mesh_model_msg_init(0x08000204, fp + -40, out a1_179, out a2_180, out a4_181, out a5_30);
	word32 a5_182;
	net_buf_simple_add_u8(fp + -28, (word32) *((word32) s2_14 + 4), a5_30, out a5_182);
	word32 a0_49;
	Eq_2 a3_52;
	word32 s0_183;
	word32 s1_184;
	word32 a2_185;
	word32 a4_186;
	word32 a5_187;
	word32 mstatus_188;
	Eq_2 ra_58 = bt_mesh_model_send(ra, a0, s1_31, a0, s1_31, fp + -28, 0x00, s2_14, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -40, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_183, out s1_184, out a0_49, out a2_185, out a3_52, out a4_186, out a5_187, out mstatus_188);
	if (a0_49 != 0x00)
	{
		word32 s1_189;
		word32 a0_190;
		word32 a1_191;
		word32 a2_192;
		word32 a3_193;
		word32 a4_194;
		word32 a5_195;
		word32 a7_196;
		word32 s2_197;
		word32 s3_198;
		word32 s4_199;
		word32 s5_200;
		word32 s6_201;
		word32 s7_202;
		word32 s8_203;
		word32 s9_204;
		word32 s10_205;
		word32 s11_206;
		word32 t4_207;
		printf(ra_58, &g_t230B7630, a3_52, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_189, out a0_190, out a1_191, out a2_192, out a3_193, out a4_194, out a5_195, out a7_196, out s2_197, out s3_198, out s4_199, out s5_200, out s6_201, out s7_202, out s8_203, out s9_204, out s10_205, out s11_206, out t4_207);
	}
	0x00 = dwArg0128;
}

// 2303BFE0: void gen_onoff_set_with_ack(Register Eq_2 ra, Register (ptr32 Eq_192429) a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack word32 dwArg0128)
void gen_onoff_set_with_ack(Eq_2 ra, struct Eq_192429 * a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, word32 dwArg0128)
{
	Eq_2 s0_25;
	Eq_2 s4_29;
	Eq_2 s11_36;
	Eq_2 s6_38;
	Eq_2 s7_39;
	Eq_2 s9_40;
	Eq_2 ra_34 = gen_onoff_set.isra.0(ra, a1, a0->ptr0018, a1, a2, a3, a5, dwArg20, dwArg24, dwArg6C, out s0_25, out s4_29, out s6_38, out s7_39, out s9_40, out s11_36);
	send_onoff_status(ra_34, s0_25, s4_29, s6_38, s7_39, s9_40, s11_36, mstatus, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, dwArg0128);
}

// 2303C002: void gen_onoff_get(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 Eq_192484) a5, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack word32 dwArg0128)
void gen_onoff_get(Eq_2 ra, Eq_2 a3, struct Eq_192484 * a5, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, word32 dwArg0128)
{
	Eq_2 a0_5 = a5->t0018;
	if (a5 != null)
		send_onoff_status(ra, a0_5, s4, s6, s7, s9, s11, mstatus, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, dwArg0128);
	else
	{
		word32 s1_133;
		word32 a0_134;
		word32 a1_135;
		word32 a2_136;
		word32 a3_137;
		word32 a4_138;
		word32 a5_139;
		word32 a7_140;
		word32 s2_141;
		word32 s3_142;
		word32 s4_143;
		word32 s5_144;
		word32 s6_145;
		word32 s7_146;
		word32 s8_147;
		word32 s9_148;
		word32 s10_149;
		word32 s11_150;
		word32 t4_151;
		printf(ra, &g_t230B75EC, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_133, out a0_134, out a1_135, out a2_136, out a3_137, out a4_138, out a5_139, out a7_140, out s2_141, out s3_142, out s4_143, out s5_144, out s6_145, out s7_146, out s8_147, out s9_148, out s10_149, out s11_150, out t4_151);
	}
}

