pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303C01E: void publish_start(Register Eq_2 ra, Register word32 a1, Register Eq_2 a3, Register (ptr32 Eq_192571) a4, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void publish_start(Eq_2 ra, word32 a1, Eq_2 a3, struct Eq_192571 * a4, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	if (a1 == 0x00)
	{
		struct Eq_192580 * s0_11 = a4->ptr000C;
		if ((a4 & 0x07) == ((word32) s0_11->b0009 & 0x07))
		{
			word32 a1_142;
			word32 a2_143;
			word32 a5_144;
			k_uptime_get_32(out a1_142, out a2_143, out a5_144)->ptr0010 = s0_11;
		}
	}
	else
	{
		word32 s11_140;
		word32 s10_139;
		word32 s9_138;
		word32 s8_137;
		word32 s7_136;
		word32 s6_135;
		word32 s5_134;
		word32 s4_133;
		word32 s3_132;
		word32 s2_131;
		word32 a7_130;
		word32 a5_129;
		word32 a4_128;
		word32 a3_127;
		word32 a2_126;
		word32 a1_125;
		word32 a0_124;
		word32 s1_123;
		word32 t4_141;
		printf(ra, &g_t230B7844, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_123, out a0_124, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129, out a7_130, out s2_131, out s3_132, out s4_133, out s5_134, out s6_135, out s7_136, out s8_137, out s9_138, out s10_139, out s11_140, out t4_141);
	}
}

// 2303C050: Register Eq_2 model_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0164, Stack Eq_2 dwArg0184, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_192702 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_model_send
//      bt_mesh_model_publish
Eq_2 model_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0164, Eq_2 dwArg0184, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_192702 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	Eq_192702 a0_150;
	ptr32 a3_109;
	ptr32 a4_110;
	ptr32 a5_105;
	Eq_2 ra_112;
	ptr32 s1_113;
	ptr32 s2_116;
	Eq_2 s1_21 = a1;
	if (bt_mesh_is_provisioned() == 0x00)
	{
		word32 a0_390;
		word32 a1_391;
		word32 a2_392;
		word32 a7_393;
		word32 s3_394;
		word32 s4_395;
		word32 s5_396;
		word32 s6_397;
		word32 s7_398;
		word32 s8_399;
		word32 s9_400;
		word32 s10_401;
		word32 s11_402;
		word32 t4_403;
		ra_112 = printf(ra, &g_t230B67DC, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_113, out a0_390, out a1_391, out a2_392, out a3_109, out a4_110, out a5_105, out a7_393, out s2_116, out s3_394, out s4_395, out s5_396, out s6_397, out s7_398, out s8_399, out s9_400, out s10_401, out s11_402, out t4_403);
		a0_150.u0 = ~0x0A;
		goto l2303C080;
	}
	word32 a4_389;
	if (net_buf_simple_tailroom(a3, out a4_389) > 0x03)
	{
		if ((word32) *((word32) a3 + 4) > 0x0044)
		{
			word32 a0_418;
			word32 a1_419;
			word32 a2_420;
			word32 a7_421;
			word32 s3_422;
			word32 s4_423;
			word32 s5_424;
			word32 s6_425;
			word32 s7_426;
			word32 s8_427;
			word32 s9_428;
			word32 s10_429;
			word32 s11_430;
			word32 t4_431;
			ra_112 = printf(ra, &g_t230B77D8, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_113, out a0_418, out a1_419, out a2_420, out a3_109, out a4_110, out a5_105, out a7_421, out s2_116, out s3_422, out s4_423, out s5_424, out s6_425, out s7_426, out s8_427, out s9_428, out s10_429, out s11_430, out t4_431);
			a0_150.u0 = -36;
			goto l2303C080;
		}
		if (a2 == 0x00)
		{
			s1_21 = *(union Eq_2 *) 72;
			word32 a1_40 = (word32) *(uint16 *) 70;
			if ((word32) *((word32) a0 + 0x0C) != a1_40 && (word32) (*((word32) a0 + 0x0E)) != a1_40)
			{
				word32 a0_432;
				word32 a1_433;
				word32 a2_434;
				word32 a7_435;
				word32 s3_436;
				word32 s4_437;
				word32 s5_438;
				word32 s6_439;
				word32 s7_440;
				word32 s8_441;
				word32 s9_442;
				word32 s10_443;
				word32 s11_444;
				word32 t4_445;
				ra_112 = printf(ra, &g_t230B77EC, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_113, out a0_432, out a1_433, out a2_434, out a3_109, out a4_110, out a5_105, out a7_435, out s2_116, out s3_436, out s4_437, out s5_438, out s6_439, out s7_440, out s8_441, out s9_442, out s10_443, out s11_444, out t4_445);
l2303C0AA:
				a0_150.u0 = ~0x15;
l2303C080:
				s0Out = s1;
				s1Out = s1_113;
				a0Out = a0_150;
				a3Out = a3_109;
				a4Out = a4_110;
				a5Out = a5_105;
				s2Out = s2_116;
				mstatusOut = mstatus;
				return ra_112;
			}
		}
		Eq_192702 a0_73;
		ptr32 a3_75;
		ptr32 a4_76;
		ptr32 a5_77;
		Eq_2 s0_80;
		ptr32 s1_81;
		ptr32 s2_84;
		ptr32 mstatus_100;
		Eq_2 ra_79 = bt_mesh_trans_send(ra, s1, s1_21, a3, dwArg48, a5, a0, a4, a2, s6, s7, s4, s9, s11, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg48, dwArg4C, dwArg58, dwArg5C, s1, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0124, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0164, dwArg0184, out s0_80, out s1_81, out a0_73, out a3_75, out a4_76, out a5_77, out s2_84, out mstatus_100);
		s0Out = s0_80;
		s1Out = s1_81;
		a0Out = a0_73;
		a3Out = a3_75;
		a4Out = a4_76;
		a5Out = a5_77;
		s2Out = s2_84;
		mstatusOut = mstatus_100;
		return ra_79;
	}
	else
	{
		word32 a0_404;
		word32 a1_405;
		word32 a2_406;
		word32 a7_407;
		word32 s3_408;
		word32 s4_409;
		word32 s5_410;
		word32 s6_411;
		word32 s7_412;
		word32 s8_413;
		word32 s9_414;
		word32 s10_415;
		word32 s11_416;
		word32 t4_417;
		ra_112 = printf(ra, &g_t230B77B4, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_113, out a0_404, out a1_405, out a2_406, out a3_109, out a4_110, out a5_105, out a7_407, out s2_116, out s3_408, out s4_409, out s5_410, out s6_411, out s7_412, out s8_413, out s9_414, out s10_415, out s11_416, out t4_417);
		goto l2303C0AA;
	}
}

