pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303C110: void mod_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_192925 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg74, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void mod_init(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_192925 a5, ptr32 mstatus, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg74, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 a0_13 = *((word32) a5 + 8);
	Eq_2 s1_16 = a1;
	Eq_2 s2_103 = a3;
	if (a5 != 0x00)
	{
		*a0_13 = a5;
		dwArg64 = a2;
		word32 s5_307;
		word32 s4_306;
		word32 s3_305;
		word32 a5_304;
		word32 a4_303;
		word32 a0_302;
		s1_16 = k_delayed_work_init(ra, a0_13, (word32) *((word32) a0_13 + 8) + 28, a3, a4, mstatus, dwArg74, dwArgA8, dwArgC8, dwArg0108, out a0_302, out a3, out a4_303, out a5_304, out s2_103, out s3_305, out s4_306, out s5_307);
	}
	*(union Eq_2 *) 11 = a0_13;
	int32 a5_51 = s1_16 - g_ptr4200F418->dw000C;
	*((word32) a0_13 + 4) = (byte) (a5_51 >> 4);
	if (a2 == 0x00)
	{
		*((word32) a0_13 + 5) = (byte) ((a0_13 - (a5_51 >> 4) >> 2) + 3067833783);
		if ((word32) *a0_13 == 0x00)
			ra = bt_mesh_cfg_srv_init(ra, a0_13, a3, mstatus, dwLoc08, dwArg40, dwArg44, dwArg64, s1, dwArg8C, dwArg98, dwArgB8, dwArgF8, out a3, out s2_103);
		Eq_2 a4_96 = (word32) *a0_13;
		if (a4_96 != 0x02)
			return;
		bt_mesh_health_srv_init(ra, a0_13, s2_103, a3, a4_96, mstatus, dwArg18, dwArg38, dwArg60, dwArg64, dwArg84, dwArg88, dwArgAC, dwArgB8, dwArgD8, dwArg0118);
	}
	else
		*((word32) a0_13 + 5) = (byte) ((a0_13 - (a5_51 >> 4) >> 2) + 3067833783);
}

// 2303C1BA: Register Eq_2 bt_mesh_model_foreach(Register Eq_2 ra, Register (ptr32 Eq_193069) a0, Register ptr32 a1, Register Eq_2 a4, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_193077 s2Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      bt_mesh_comp_register
//      bt_mesh_comp_unprovision
//      bt_mesh_app_key_del
//      bt_mesh_cfg_reset
Eq_2 bt_mesh_model_foreach(Eq_2 ra, struct Eq_193069 * a0, ptr32 a1, Eq_2 a4, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_193077 & s2Out, ptr32 & s6Out, ptr32 & s7Out)
{
	struct Eq_193069 * s3_106 = a0;
	ptr32 s4_107 = a1;
	Eq_2 s1_100 = 0x00;
	ptr32 s6_101 = 0x4200F000;
	word32 s5_108 = 0x1C;
	while (true)
	{
		Eq_2 a5_33 = *((word32) a4 + 8);
		if (s1_100 >= a4)
			break;
		int32 s2_37 = 0x00;
		struct Eq_193090 * s0_111 = (word32) *((word32) a5_33 + 0x0C) + (s1_100 << 0x04);
		word32 s7_39 = (word32) (s1_100 < 1);
		while (s2_37 < (word32) s0_111->b0004)
		{
			word32 a5_45 = s2_37 + s5_108;
			word32 s0_47 = a0->dw0008;
			s3_106();
		}
		s2.u0 = 0x00;
		s7 = (word32) (s1_100 < 1);
		while (s2 < (word32) s0_111->b0005)
		{
			word32 a5_88 = (word32) s2.u0 + s5_108;
			word32 s0_90 = a0->dw000C;
			s3_106();
		}
		s1_100 = (word32) s1_100 + 1;
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_100;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s6Out = s6_101;
	s7Out = s7;
	return ra;
}

// 2303C24E: Register Eq_193139 bt_mesh_model_pub_period_get(Register (ptr32 Eq_193140) a5, Register out Eq_193141 a3Out, Register out (ptr32 Eq_193142) a4Out)
// Called from:
//      publish_sent
//      mod_publish
//      _mod_pub_set.isra.1
Eq_193139 bt_mesh_model_pub_period_get(struct Eq_193140 * a5, union Eq_193141 & a3Out, struct Eq_193142 & a4Out)
{
	Eq_193139 a0_23;
	if (a5 != null)
	{
		int32 a4_12;
		uint32 a0_11 = (word32) a5->b000A;
		a3.u0 = 0x02;
		if (a0_11 >> 0x06 != 0x02)
		{
			a3.u0 = 0x03;
			if (a0_11 >> 0x06 != 0x03)
			{
				a3.u0 = 0x01;
				if (a0_11 >> 0x06 != 0x01)
					a4_12 = 100;
				else
				{
					a0_11 &= 63;
					a4_12 = 1000;
				}
			}
			else
			{
				a0_11 &= 63;
				a4_12 = 600000;
			}
		}
		else
		{
			a0_11 &= 63;
			a4_12 = 0x02000710;
		}
		ui32 a4_26 = (word32) a5->b000B;
		a0_23 = a0_11 + a4_12;
		a4 = a4_26 & 32;
		if ((a4_26 & 32) != 0x00)
		{
			Eq_193139 a0_30 = a0_23 >> ((word32) a5->b000B & 0x0F);
			a3Out = a3;
			a4Out = a4_26 & 32;
			return a0_30;
		}
	}
	else
		a0_23.u0 = 0x00;
	a3Out = a3;
	a4Out = a4;
	return a0_23;
}

// 2303C2B2: Register (ptr32 Eq_193198) publish_sent(Register Eq_2 ra, Register (ptr32 Eq_193198) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 a3Out)
// Called from:
//      bt_mesh_model_publish
struct Eq_193198 * publish_sent(Eq_2 ra, struct Eq_193198 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & a3Out)
{
	Eq_2 a1_30;
	struct Eq_193226 * s2_13 = a1->ptr0008;
	ui32 a5_15 = (word32) s2_13->b000C;
	if ((a5_15 & 0x07) != 0x00)
	{
		a1_30 = ((word32) s2_13->b0009 >> 3) + 0x33;
		goto l2303C2DA;
	}
	word32 a4_233;
	Eq_2 a0_18 = bt_mesh_model_pub_period_get(a5_15 & 0x07, out a3, out a4_233);
	if (a0_18 != 0x00)
	{
		word32 a5_247;
		word32 a2_246;
		word32 a1_245;
		struct Eq_192645 * a0_23 = k_uptime_get_32(out a1_245, out a2_246, out a5_247);
		int32 a5_27 = s2_13->dw0010;
		a4 = a0_23 - a5_27;
		if (a0_18 < a4)
		{
			word32 s1_248;
			word32 a0_249;
			word32 a1_250;
			word32 a2_251;
			word32 a5_252;
			word32 a7_253;
			word32 s2_254;
			word32 s3_255;
			word32 s4_256;
			word32 s5_257;
			word32 s6_258;
			word32 s7_259;
			word32 s8_260;
			word32 s9_261;
			word32 s10_262;
			word32 s11_263;
			word32 t4_264;
			printf(ra, &g_t230B7810, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_248, out a0_249, out a1_250, out a2_251, out a3, out a4, out a5_252, out a7_253, out s2_254, out s3_255, out s4_256, out s5_257, out s6_258, out s7_259, out s8_260, out s9_261, out s10_262, out s11_263, out t4_264);
			a1_30.u0 = 0x01;
l2303C2DA:
			0x00 = (int8) dwArg38;
			Eq_2 a3_85;
			struct Eq_193198 * s1_89;
			word32 s8_244;
			word32 s6_243;
			word32 s5_242;
			word32 s4_241;
			word32 s3_240;
			word32 s2_239;
			word32 a5_238;
			word32 a4_237;
			word32 a2_236;
			word32 a1_235;
			word32 a0_234;
			k_delayed_work_submit(a1_30, a3, a4, mstatus, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_89, out a0_234, out a1_235, out a2_236, out a3_85, out a4_237, out a5_238, out s2_239, out s3_240, out s4_241, out s5_242, out s6_243, out s8_244);
			a3Out = a3_85;
			return s1_89;
		}
		a1_30 = (word32) a0_18 + a5_27 - a0_23;
		if (a1_30 != 0x00)
			goto l2303C2DA;
	}
	0x00 = (int8) dwArg38;
	a3Out = a3;
	return a1;
}

// 2303C32A: Register Eq_2 bt_mesh_model_elem(Register Eq_2 a0, Register out ptr32 a4Out)
// Called from:
//      bt_mesh_model_send
//      bt_mesh_model_publish
//      mod_publish
//      bt_mesh_heartbeat_send
Eq_2 bt_mesh_model_elem(Eq_2 a0, ptr32 & a4Out)
{
	Eq_2 a0_10 = (word32) a0 + ((word32) (*((word32) a0 + 4)) << 4);
	a4Out = (ptr32) *((word32) a0 + 0x0C);
	return a0_10;
}

