pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303C33E: Register Eq_2 bt_mesh_comp_register(Register Eq_2 ra, Register Eq_2 a4, Register (ptr32 Eq_186267) a5, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out)
// Called from:
//      bt_mesh_init
Eq_2 bt_mesh_comp_register(Eq_2 ra, Eq_2 a4, struct Eq_186267 * a5, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out)
{
	struct Eq_192958 * a0_5 = a5->ptr0008;
	if (a5 == null)
	{
		s1Out = s1;
		a0Out = ~0x15;
		a3Out = a3;
		a4Out = a4;
		return ra;
	}
	else
	{
		g_ptr4200F418 = a0_5;
		ptr32 a3_19;
		Eq_2 a4_20;
		ptr32 s1_25;
		word32 s0_80;
		word32 s2_81;
		word32 s6_82;
		word32 s7_83;
		Eq_2 ra_23 = bt_mesh_model_foreach(ra, &g_t2303C110, 0x00, a4, dwArg0118, out s0_80, out s1_25, out a3_19, out a4_20, out s2_81, out s6_82, out s7_83);
		s1Out = s1_25;
		a0Out = 0x00;
		a3Out = a3_19;
		a4Out = a4_20;
		return ra_23;
	}
}

// 2303C368: void bt_mesh_comp_provision(Register word32 a0, Register Eq_2 a3)
// Called from:
//      bt_mesh_provision
void bt_mesh_comp_provision(word32 a0, Eq_2 a3)
{
	g_w4200F41C = (word16) a0;
	Eq_2 a5_13 = 0x00;
	while (true)
	{
		word32 a4_14 = (word32) a5_13 + a0;
		if (a5_13 >= a3)
			break;
		a3 = (word32) a3 + (a5_13 << 0x04);
		*a3 = (word16) (word32) (word16) a4_14;
		a5_13 = (word32) a5_13 + 1;
	}
}

// 2303C39A: Register Eq_2 bt_mesh_comp_unprovision(Register Eq_2 ra, Register Eq_2 a4, Stack Eq_2 dwArg0128, Register out ptr32 a3Out)
// Called from:
//      bt_mesh_reset
Eq_2 bt_mesh_comp_unprovision(Eq_2 ra, Eq_2 a4, Eq_2 dwArg0128, ptr32 & a3Out)
{
	g_w4200F41C = 0x00;
	ptr32 a3_13;
	word32 s0_31;
	word32 s1_32;
	word32 a4_33;
	word32 s2_34;
	word32 s6_35;
	word32 s7_36;
	Eq_2 ra_17 = bt_mesh_model_foreach(ra, &g_t2303C110, 0x00, a4, dwArg0128, out s0_31, out s1_32, out a3_13, out a4_33, out s2_34, out s6_35, out s7_36);
	a3Out = a3_13;
	return ra_17;
}

// 2303C3B0: Register word32 bt_mesh_primary_addr(Register out ptr32 a5Out)
// Called from:
//      send_friend_poll
//      clear_friendship
//      sub_update
//      send_friend_req.constprop.8
//      heartbeat_sub_set
//      friend_cred_set
//      bt_mesh_net_start
//      send_filter_status
//      bt_mesh_proxy_adv_start
//      ctl_recv
//      send_ack
//      send_friend_clear
//      encode_friend_ctl
//      bt_mesh_friend_clear
word32 bt_mesh_primary_addr(ptr32 & a5Out)
{
	word32 a0_5 = (word32) g_w4200F41C;
	a5Out = 0x4200F000;
	return a0_5;
}

// 2303C3BA: Register Eq_2 bt_mesh_model_find_group(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      mod_sub_del
//      mod_sub_add
//      mod_sub_va_del
//      mod_sub_va_add
Eq_2 bt_mesh_model_find_group(Eq_2 a0, Eq_2 a1)
{
	Eq_2 a5_15;
	word32 a5_10;
	if ((word32) *((word32) a0 + 16) != a1)
	{
		a5_15.u0 = 0x00;
		if ((word32) *((word32) a0 + 18) != a1)
			return a5_15;
		a5_10 = 0x01;
	}
	else
		a5_10 = 0x00;
	a5_15 = (word32) a0 + (a5_10 + 0x08 << 1);
	return a5_15;
}

// 2303C3DC: Register Eq_2 bt_mesh_elem_find(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out Eq_193478 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mod_sub_get
//      mod_sub_get_vnd
//      mod_app_get
//      mod_app_unbind
//      mod_app_bind
//      mod_pub_set
//      mod_pub_get
//      mod_sub_del
//      mod_sub_add
//      mod_sub_va_del
//      mod_pub_va_set
//      mod_sub_va_add
//      mod_sub_del_all
//      mod_sub_va_overwrite
//      mod_sub_overwrite
//      bt_mesh_net_decode
//      bt_mesh_net_recv
//      bt_mesh_ctl_send
//      bt_mesh_friend_req
Eq_2 bt_mesh_elem_find(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, union Eq_193478 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	struct Eq_192958 * t1_5 = g_ptr4200F418;
	Eq_193478 t4_8 = t1_5->t0008;
	Eq_193478 a3_14 = 0x00;
	while (true)
	{
		Eq_2 a5_20;
		if (a3_14 == t4_8)
			break;
		a5_20 = (a3_14 << 0x04) + t1_5->dw000C;
		if ((a0 ^ 0x08000000) <= 0x07FFFF00)
		{
			Eq_2 t5_25 = (word32) *((byte) a5_20.u0 + 4);
			a4.u0 = 0x00;
			while (a4 < t5_25)
			{
				struct Eq_193514 * a2_34 = (word32) a1 + ((byte) a4.u0 + 28);
				a5_20 = *((word32) a1 + 8);
				a1 = (word32) a2_34->w0010;
				if (a1 == a0 || (word32) a2_34->w0012 == a0)
					goto l2303C466;
				a4 = (word32) a4 + 1;
			}
			Eq_2 t5_40 = (word32) *((byte) a5_20.u0 + 5);
			a4.u0 = 0x00;
			while (a4 < t5_40)
			{
				struct Eq_193532 * a2_49 = (word32) a1 + ((byte) a4.u0 + 28);
				a5_20 = *((word32) a1 + 0x0C);
				a1 = (word32) a2_49->w0010;
				if (a1 == a0 || (word32) a2_49->w0012 == a0)
					goto l2303C466;
				a4 = (byte) a4.u0 + 1;
			}
		}
		else
		{
			a4 = (word32) *a5_20.u0;
			if (a4 == a0)
				goto l2303C466;
		}
		a3_14 = (word32) a3_14 + 1;
	}
	a5_20.u0 = 0x00;
l2303C466:
	a1Out = a1;
	a3Out = a3_14;
	a4Out = a4;
	a5Out = a5_20;
	return a5_20;
}

// 2303C46A: Register word32 bt_mesh_elem_count(Register out (ptr32 Eq_192958) a5Out)
// Called from:
//      prov_invite
word32 bt_mesh_elem_count(struct Eq_192958 & a5Out)
{
	struct Eq_192958 * a5_5 = g_ptr4200F418;
	word32 a0_6 = (word32) a5_5->t0008;
	a5Out = a5_5;
	return a0_6;
}

// 2303C478: Register Eq_193573 bt_mesh_fixed_group_match(Register Eq_193573 a0, Register out ptr32 a3Out, Register out Eq_193573 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_mesh_model_recv
//      bt_mesh_net_recv
//      bt_mesh_ctl_send
Eq_193573 bt_mesh_fixed_group_match(Eq_193573 a0, ptr32 & a3Out, union Eq_193573 & a4Out, ptr32 & a5Out)
{
	Eq_193573 a0_12;
	Eq_2 a0_15;
	ptr32 a5_10 = 0x10000000;
	if (a0 != 0x0FFFFFFE)
	{
		a4 = a0;
		a0_12.u0 = 0x01;
		if (a0 > 0x0FFFFFFE)
			goto l2303C4A0;
		a5_10 = 0x0FFFFFFD;
		a0_12.u0 = 0x00;
		if (a0 != 0x0FFFFFFD)
		{
l2303C4A0:
			a3Out = 0x0FFFFFFE;
			a4Out = a4;
			a5Out = a5_10;
			return a0_12;
		}
		a0_15 = bt_mesh_friend_get(out a5_10);
	}
	else
		a0_15 = bt_mesh_relay_get(out a5_10);
	a0_12 = (word32) (a0_15 < ~0x01);
	goto l2303C4A0;
}

// 2303C4AC: Register Eq_2 bt_mesh_model_recv(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_193637) a5, Register Eq_2 s2, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack word32 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack word32 dwArgCC, Stack Eq_2 dwArgEC, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg01A8, Register out Eq_2 s0Out, Register out Eq_2 a3Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s7Out, Register out Eq_193633 s9Out)
// Called from:
//      sdu_recv
Eq_2 bt_mesh_model_recv(Eq_2 ra, Eq_2 a0, union Eq_193637 * a5, Eq_2 s2, Eq_2 s5, Eq_2 dwArg08, word32 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, word32 dwArgCC, Eq_2 dwArgEC, Eq_2 dwArg010C, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188, Eq_2 dwArg01A8, union Eq_2 & s0Out, union Eq_2 & a3Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s7Out, union Eq_193633 & s9Out)
{
	Eq_2 s2_107;
	struct Eq_274 * a0_265;
	Eq_2 a0_41;
	Eq_193637 a1_31 = *a5;
	Eq_2 s3_176 = a0;
	Eq_193637 s0_200 = a1_31;
	struct Eq_193643 * a4_104 = (word32) *a5;
	if (a4_104 >> 0x06 != 0x02)
	{
		if (a4_104 >> 0x06 != 0x03)
		{
			if (a4_104 == (struct Eq_193643 *) 0x007F)
			{
				a0_265 = (struct Eq_274 *) &g_t230B76A0;
				goto l2303C4F2;
			}
			word32 a1_840;
			word32 a2_841;
			word32 a5_842;
			a0_41 = net_buf_simple_pull_u8(0x007F, out a1_840, out a2_841, out a5_842);
l2303C524:
			s2_107 = a0_41;
			goto l2303C526;
		}
		if ((word32) *((word32) a1_31 + 4) > 0x02)
		{
			Eq_2 a5_54;
			word32 a1_878;
			word32 a1_880;
			word32 a5_882;
			word32 a2_881;
			word32 a2_879;
			s2_107 = net_buf_simple_pull_u8(0x02, out a1_878, out a2_879, out a5_54) << 16 | net_buf_simple_pull_le16(a5_54, out a1_880, out a2_881, out a4_104, out a5_882);
l2303C526:
			Eq_2 s6_109 = 0x10000000;
			struct Eq_193643 * s11_187 = null;
			ptr32 s7_183 = 0x4200F000;
			uint32 s5_181 = 0x07FFFF00;
			word32 s8_184 = (word32) a0 + 4;
			Eq_193633 s9_185 = 0x0FFFFFFF;
			word32 s10_186 = 0x230B7000;
			while (true)
			{
				struct Eq_193817 * a5_88 = a4_104->dw0008;
				if (s11_187 >= a4_104)
					break;
				Eq_193573 a0_92 = (word32) *((word32) s3_176 + 0x0A);
				struct Eq_193813 * s4_94 = (s11_187 << 0x04) + a5_88->dw000C;
				if ((int32) (word16) a0_92 > 0x00)
				{
					if ((word32) s4_94->w0000 == a0_92)
						goto l2303C5CA;
					goto l2303C5EA;
				}
				if (s5_181 < (a0_92 ^ 0x08000000))
				{
					if (s11_187 != null)
						goto l2303C5EA;
					word32 a3_883;
					word32 a5_884;
					if (bt_mesh_fixed_group_match(a0_92, out a3_883, out a4_104, out a5_884) == 0x00)
						goto l2303C5EA;
				}
l2303C5CA:
				struct Eq_193851 * s1_112;
				ui32 a2_113;
				if (s2_107 >= s6_109)
				{
					s1_112 = s4_94->ptr000C;
					a2_113 = (word32) s4_94->b0005;
				}
				else
				{
					s1_112 = s4_94->ptr0008;
					a2_113 = (word32) s4_94->b0004;
				}
				a4_104 = (word32) *((word32) s3_176 + 0x0A);
				word32 a1_120 = (word32) *((word32) s3_176 + 6);
				ui32 a5_122 = 0x00;
				while (a2_113 != a5_122)
				{
					if ((s5_181 < (a4_104 ^ 0x08000000) || ((word32) s1_112->w0010 == a4_104 || (word32) s1_112->w0012 == a4_104)) && ((word32) s1_112[1] == a1_120 || (word32) s1_112->w000E == a1_120))
					{
						struct Eq_193919 * s4_141 = s1_112->dw0014;
						while (s4_141->ptr0008 != 0x00)
						{
							if (s4_141->dw0000 == s2_107)
							{
								Eq_2 a4_148 = (word32) *((word32) s0_200 + 4);
								if (a4_148 < s4_141->t0004)
								{
									word32 a3_889;
									word32 a7_891;
									word32 t4_893;
									word32 s4_892;
									word32 a5_890;
									word32 s1_885;
									word32 a0_886;
									word32 a1_887;
									word32 a2_888;
									ra = printf(ra, s10_186 + 1828, a4_104 ^ 0x08000000, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_885, out a0_886, out a1_887, out a2_888, out a3_889, out a4_104, out a5_890, out a7_891, out s2_107, out s3_176, out s4_892, out s5_181, out s6_109, out s7_183, out s8_184, out s9_185, out s10_186, out s11_187, out t4_893);
								}
								else
								{
									*((word32) s3_176 + 24) = 0x01;
									*((word32) s3_176 + 16) = s2_107;
									*((word32) s3_176 + 20) = s1_112;
									Eq_2 a0_157 = net_buf_simple_headroom(a4_148);
									word32 a4_158 = (word32) *((word32) s0_200 + 4);
									struct Eq_193969 * sp_174;
									ui32 a5_189;
									Eq_193637 a0_190[];
									word32 t4_448;
									word32 a7_447;
									s4_141->ptr0008();
									s0_200 = sp_174->t00C4;
									a0_190[(a5_189 & s9_185) / 4] = s0_200;
									*((word32) s0_200 + 4) = (word16) a4_104;
								}
								goto l2303C5EA;
							}
							++s4_141;
						}
					}
					a5_122 = a5_122 + 0x01 & 0x00FF;
					s1_112 = &s1_112->dw0014 + 2;
				}
l2303C5EA:
				s11_187 = (struct Eq_193643 *) ((char *) s11_187 + 1);
			}
			0x00 = (int8) dwArg010C;
			s0Out.u0 = <invalid>;
			a3Out = s2;
			s3Out = s3_176;
			s4Out = dwArg0168;
			s7Out = s7_183;
			s9Out = s9_185;
			return dwLoc08;
		}
		a0_265 = (struct Eq_274 *) &g_t230B76E0;
	}
	else
	{
		if ((word32) *((word32) a1_31 + 4) > 0x01)
		{
			word32 a5_858;
			word32 a1_857;
			a0_41 = net_buf_simple_pull_be16((struct Eq_193726 *) 0x01, out a1_857, out a4_104, out a5_858);
			goto l2303C524;
		}
		a0_265 = (struct Eq_274 *) &g_t230B76B8;
	}
l2303C4F2:
	word32 s2_867;
	word32 s7_872;
	word32 s8_873;
	word32 s4_869;
	word32 s9_874;
	word32 s10_875;
	word32 s6_871;
	word32 s11_876;
	word32 t4_877;
	word32 s5_870;
	word32 s3_868;
	word32 a1_861;
	word32 a2_862;
	word32 a3_863;
	word32 a4_864;
	word32 a0_860;
	word32 a5_865;
	word32 a7_866;
	word32 s1_859;
	printf(ra, a0_265, a4_104 >> 0x06, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_859, out a0_860, out a1_861, out a2_862, out a3_863, out a4_864, out a5_865, out a7_866, out s2_867, out s3_868, out s4_869, out s5_870, out s6_871, out s7_872, out s8_873, out s9_874, out s10_875, out s11_876, out t4_877);
	0x00 = (int8) dwArg010C;
	Eq_2 a3_313;
	Eq_2 s3_321;
	Eq_2 s4_322;
	ptr32 s7_325;
	Eq_193633 s9_327;
	word32 a1_845;
	word32 t4_856;
	word32 s2_850;
	word32 s5_851;
	word32 a4_847;
	word32 s6_852;
	word32 s8_853;
	word32 a7_849;
	word32 s10_854;
	word32 s11_855;
	word32 a5_848;
	word32 a2_846;
	word32 s1_843;
	word32 a0_844;
	Eq_2 ra_316 = printf(dwLoc08, &g_t230B7708, s2, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_843, out a0_844, out a1_845, out a2_846, out a3_313, out a4_847, out a5_848, out a7_849, out s2_850, out s3_321, out s4_322, out s5_851, out s6_852, out s7_325, out s8_853, out s9_327, out s10_854, out s11_855, out t4_856);
	s0Out.u0 = <invalid>;
	a3Out = a3_313;
	s3Out = s3_321;
	s4Out = s4_322;
	s7Out = s7_325;
	s9Out = s9_327;
	return ra_316;
}

// 2303C6A0: Register Eq_2 bt_mesh_model_msg_init(Register Eq_183596 a1, Register Eq_2 a5, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      vendor_data_set
//      gen_onoff_get
//      net_key_get
//      node_identity_get
//      app_key_get
//      send_mod_sub_status
//      krp_set
//      lpn_timeout_get
//      friend_set
//      node_reset
//      mod_sub_get
//      mod_sub_get_vnd
//      create_mod_app_status.isra.5
//      send_mod_pub_status.isra.7
//      mod_app_get
//      dev_comp_data_get
//      app_key_update
//      app_key_add
//      heartbeat_pub_set
//      hb_sub_send_status.constprop.14
//      app_key_del
//      net_transmit_set
//      net_transmit_get
//      relay_set
//      relay_get
//      beacon_set
//      beacon_get
//      node_identity_set
//      gatt_proxy_set
//      default_ttl_set
//      default_ttl_get
//      net_key_del
//      health_period_get
//      health_get_registered
//      health_pub_update
//      attention_set
Eq_2 bt_mesh_model_msg_init(Eq_183596 a1, Eq_2 a5, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_5 = *((word32) a5 + 8);
	if (a5 == 0x00)
	{
		*((word32) a0_5 + 20) = a0_5;
		a5 = (word32) a0_5 + 0x0C;
	}
	Eq_2 a0_10 = *((word32) a5 + 8);
	*((word32) a0_10 + 4) = 0x00;
	*a5 = a0_10;
	if (a1 > 0x00FF)
	{
		Eq_2 s1_29 = (word32) (word16) a1;
		if (a1 >= 0x10000000)
		{
			Eq_2 a5_35;
			net_buf_simple_add_u8(a0_10, a1 >> 16 & 0x00FF, 0x10000000, out a5_35);
			Eq_2 a4_44;
			ptr32 a5_45;
			a1Out = net_buf_simple_add_le16(a0_10, s1_29, a5_35, out a4_44, out a5_45);
			a2Out = dwArg10;
			a4Out = a4_44;
			a5Out = a5_45;
			return s1_29;
		}
		else
		{
			Eq_2 a4_52;
			ptr32 a5_53;
			net_buf_simple_add_be16(a0_10, s1_29, (struct Eq_194075 *) 0x10000000, out a4_52, out a5_53);
			a1Out = s1_29;
			a2Out = dwArg10;
			a4Out = a4_52;
			a5Out = a5_53;
			return s1_29;
		}
	}
	else
	{
		ptr32 a5_57;
		Eq_2 a4_56 = net_buf_simple_add_u8(a0_10, a1 & 0x00FF, 0x00FF, out a5_57);
		a1Out = a1 & 0x00FF;
		a2Out = a2;
		a4Out = a4_56;
		a5Out = a5_57;
		return s1;
	}
}

// 2303C700: Register Eq_2 bt_mesh_model_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0134, Stack Eq_2 dwArg0154, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      vendor_data_set
//      gen_onoff_get
//      net_key_get
//      node_identity_get
//      app_key_get
//      send_mod_sub_status
//      krp_set
//      lpn_timeout_get
//      friend_set
//      node_reset
//      mod_sub_get
//      mod_sub_get_vnd
//      send_mod_pub_status.isra.7
//      mod_app_get
//      mod_app_unbind
//      mod_app_bind
//      dev_comp_data_get
//      app_key_update
//      app_key_add
//      heartbeat_pub_set
//      hb_sub_send_status.constprop.14
//      app_key_del
//      net_transmit_set
//      net_transmit_get
//      relay_set
//      relay_get
//      beacon_set
//      beacon_get
//      node_identity_set
//      gatt_proxy_set
//      default_ttl_set
//      default_ttl_get
//      net_key_del
//      health_period_get
//      health_fault_test
//      health_fault_clear
//      health_fault_get
//      attention_set
Eq_2 bt_mesh_model_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0134, Eq_2 dwArg0154, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 a3_25;
	word32 a4_141;
	word32 a5_142;
	Eq_2 a0_22 = bt_mesh_subnet_get((word32) *a1, out a3_25, out a4_141, out a5_142);
	0x00 = (int8) dwArg34;
	word32 a4_143;
	bt_mesh_model_elem(a0, out a4_143);
	Eq_2 a5_35;
	bt_mesh_net_transmit_get(out a5_35);
	ptr32 a0_53;
	ptr32 a3_56;
	ptr32 a4_57;
	ptr32 a5_58;
	ptr32 mstatus_61;
	ptr32 s1_64;
	word32 s0_144;
	word32 s2_145;
	Eq_2 ra_62 = model_send(ra, s1, dwArg74, fp + -28, 0x00, a2, a3_25, a5_35, s2, s4, s6, s7, s9, s11, mstatus, a1, a3, dwLoc28, a1, dwLoc20, s0, dwLoc18, dwLoc0C, dwLoc08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg4C, a2, a0_22, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0134, dwArg0154, out s0_144, out s1_64, out a0_53, out a3_56, out a4_57, out a5_58, out s2_145, out mstatus_61);
	s0Out = dwArgE4;
	s1Out = s1_64;
	a0Out = a0_53;
	a2Out = dwArg0100;
	a3Out = a3_56;
	a4Out = a4_57;
	a5Out = a5_58;
	mstatusOut = mstatus_61;
	return ra_62;
}

