pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303C756: Register Eq_2 bt_mesh_model_publish(Register Eq_2 ra, Register (ptr32 Eq_194150) s0, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgF4, Register out Eq_194177 a0Out, Register out Eq_2 a3Out)
// Called from:
//      mod_publish
Eq_2 bt_mesh_model_publish(Eq_2 ra, struct Eq_194150 * s0, Eq_2 a0, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgF4, union Eq_194177 & a0Out, union Eq_2 & a3Out)
{
	word24 nLoc68_306 = (word24) dwLoc68;
	Eq_2 a0_25;
	word32 a5_447;
	word32 a4_446;
	word32 a2_445;
	word32 t1_444;
	Eq_2 a1_114;
	Eq_2 a3_181;
	Eq_2 ra_168 = memset(ra, fp + -112, 0x00, 0x18, out t1_444, out a0_25, out a1_114, out a2_445, out a3_181, out a4_446, out a5_447);
	word32 a4_448;
	bt_mesh_model_elem(a0, out a4_448);
	word32 a5_449;
	bt_mesh_net_transmit_get(out a5_449);
	Eq_2 s2_163 = a0;
	Eq_194177 s1_207 = -35;
	if (s0 != null)
	{
		if ((word32) s0->w0004 == 0x00)
		{
l2303C7A6:
			s1_207.u0 = -49;
			goto l2303C7AA;
		}
		struct Eq_194223 * a5_53;
		word32 a4_450;
		Eq_2 a0_49 = bt_mesh_app_key_find((word32) s0->w0006, out a3_181, out a4_450, out a5_53);
		Eq_2 s1_135 = a0_49;
		if (a0_49 == 0x00)
			goto l2303C7A6;
		struct Eq_194244 * s0_55 = a5_53->ptr0014;
		Eq_2 a4_116 = (word32) a5_53->w0004;
		if (a4_116 > 0x0044)
		{
			word32 s1_451;
			word32 a0_452;
			word32 a1_453;
			word32 a2_454;
			word32 a4_455;
			word32 a5_456;
			word32 a7_457;
			word32 s2_458;
			word32 s3_459;
			word32 s4_460;
			word32 s5_461;
			word32 s6_462;
			word32 s7_463;
			word32 s8_464;
			word32 s9_465;
			word32 s10_466;
			word32 s11_467;
			word32 t4_468;
			ra_168 = printf(ra_168, &g_t230B7654, a3_181, fp + -88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, dwArg2C, out s1_451, out a0_452, out a1_453, out a2_454, out a3_181, out a4_455, out a5_456, out a7_457, out s2_458, out s3_459, out s4_460, out s5_461, out s6_462, out s7_463, out s8_464, out s9_465, out s10_466, out s11_467, out t4_468);
			s1_207.u0 = -36;
		}
		else
		{
			ui32 a5_58 = (word32) s0_55->b000C;
			struct Eq_194260 * a5_108 = a5_58 & 0x07;
			if ((a5_58 & 0x07) != 0x00)
			{
				Eq_2 a3_67;
				Eq_2 a4_68;
				word32 s1_479;
				word32 a0_480;
				word32 a1_481;
				word32 a2_482;
				word32 a5_483;
				word32 a7_484;
				word32 s2_485;
				word32 s3_486;
				word32 s4_487;
				word32 s5_488;
				word32 s6_489;
				word32 s8_490;
				word32 s10_491;
				word32 t4_492;
				ra_168 = printf(ra_168, &g_t230B767C, a3_181, fp + -88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, dwArg2C, out s1_479, out a0_480, out a1_481, out a2_482, out a3_67, out a4_68, out a5_483, out a7_484, out s2_485, out s3_486, out s4_487, out s5_488, out s6_489, out s7, out s8_490, out s9, out s10_491, out s11, out t4_492);
				word32 a0_493;
				word32 a2_494;
				word32 a3_495;
				word32 s3_496;
				word32 s5_497;
				word32 s8_498;
				s1_135 = k_delayed_work_cancel(&s0_55->b000C + 16, a3_67, a4_68, mstatus, dwLoc5C, dwLoc58, dwArg18, dwArg28, dwArg58, dwArg98, out a0_493, out a1_114, out a2_494, out a3_495, out a4_116, out a5_108, out s2_163, out s3_496, out s4, out s5_497, out s6, out s8_498);
			}
			struct Eq_194311 * s0_110 = a5_108->ptr0014;
			word32 a1_469;
			word32 a2_470;
			word32 a3_471;
			word32 a4_472;
			word32 a5_473;
			net_buf_simple_add_mem(fp + -0x0088, a1_114, (word32) a5_108->w0004, a4_116, out a1_469, out a2_470, out a3_471, out a4_472, out a5_473);
			word16 wLoc6C_295 = (word16) (word32) s0_110->w0004;
			byte bLoc65_296 = (byte) (word32) s0_110->b0008;
			struct Eq_194345 * s0_139 = ((struct Eq_194345 *[]) 8)[(word32) *((word32) s1_135 + 2) / 4];
			word32 a3_474;
			word32 a4_475;
			word32 a5_476;
			Eq_2 a0_147 = bt_mesh_subnet_get((word32) *s1_135, out a3_474, out a4_475, out a5_476);
			s0_139->b000C = (byte) ((word32) s0_139->b000C & ~0x07 | (word32) s0_139->b0009 & 7);
			Eq_2 dwLoc6C_319 = SEQ(wLoc6A, wLoc6C_295);
			Eq_194177 a0_178;
			Eq_2 a4_182;
			ptr32 mstatus_186;
			struct Eq_194389 * s0_188;
			struct Eq_193198 * s2_192;
			word32 s1_477;
			word32 a5_478;
			ra_168 = model_send(ra_168, s1_135, s2_163, fp + -0x007C, 0x01, fp + -0x0088, 588036560, s2_163, s2_163, s4, s6, s7, s9, s11, mstatus, dwLoc90, fp + -88, fp + -88, a0_25, dwLoc80, dwLoc7C, dwLoc78, dwLoc6C_319, SEQ(bLoc65_296, nLoc68_306), dwLoc48, dwLoc44, dwLoc40, dwLoc3C, dwLoc38, dwLoc34, dwLoc18, dwLoc14, 0x00480000, a0_147, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgF4, out s0_188, out s1_477, out a0_178, out a3_181, out a4_182, out a5_478, out s2_192, out mstatus_186);
			s1_207 = a0_178;
			if (a0_178 != 0x00)
			{
				s0_188->b000C = (byte) ((word32) s0_188->b000C & ~0x07);
				s1_207 = publish_sent(ra_168, s2_192, a3_181, a4_182, mstatus_186, fp + -88, fp + -88, dwLoc78, dwLoc6C_319, dwLoc58, dwLoc30, dwLoc2C, dwLoc18, a0_147, dwArg08, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, out a3_181);
			}
		}
	}
l2303C7AA:
	a0Out = s1_207;
	a3Out = a3_181;
	return ra_168;
}

// 2303C888: void mod_publish(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_194512) a0, Register (ptr32 Eq_193140) a5, Register Eq_2 s2, Register word32 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4)
void mod_publish(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_194512 * a0, struct Eq_193140 * a5, Eq_2 s2, word32 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4)
{
	Eq_2 s2_17 = a0->tFFFFFFE4;
	word32 a3_455;
	word32 a4_456;
	Eq_2 a0_21 = bt_mesh_model_pub_period_get(a5, out a3_455, out a4_456);
	if (((word32) a0->bFFFFFFF0 & 0x07) == 0x00)
	{
		if (a0_21 != 0x00)
		{
			<anonymous> * a5_28 = a0->ptrFFFFFFFC;
			struct Eq_194814 * sp_30;
			struct Eq_194815 * s1_31;
			Eq_2 ra_33;
			struct Eq_194150 * s0_34;
			Eq_2 s4_36;
			word32 a0_37;
			word32 a1_39;
			word32 a2_40;
			Eq_2 a3_42;
			Eq_2 s6_45;
			word32 t0_329;
			word32 t1_330;
			word32 a6_331;
			word32 a7_332;
			word32 t3_335;
			word32 t4_336;
			word32 t6_337;
			word32 tp_338;
			a5_28();
			if (a0_37 != 0x00)
			{
				word32 s1_505;
				word32 a0_506;
				word32 a1_507;
				word32 a2_508;
				word32 a3_509;
				word32 a4_510;
				word32 a5_511;
				word32 a7_512;
				word32 s2_513;
				word32 s3_514;
				word32 s4_515;
				word32 s5_516;
				word32 s6_517;
				word32 s7_518;
				word32 s8_519;
				word32 s9_520;
				word32 s10_521;
				word32 s11_522;
				word32 t4_523;
				printf(ra_33, &g_t230B776C, a3_42, sp_30->t0008, sp_30->t0028, sp_30->t0070, sp_30->t0074, sp_30->t0098, sp_30->t00BC, out s1_505, out a0_506, out a1_507, out a2_508, out a3_509, out a4_510, out a5_511, out a7_512, out s2_513, out s3_514, out s4_515, out s5_516, out s6_517, out s7_518, out s8_519, out s9_520, out s10_521, out s11_522, out t4_523);
			}
			else
			{
				word32 a0_51;
				Eq_2 a3_54;
				Eq_2 ra_57 = bt_mesh_model_publish(ra_33, s0_34, s1_31->tFFFFFFE4, s4_36, s6_45, s7, s9, s11, mstatus, sp_30->t0008, sp_30->t000C, sp_30->t0018, sp_30->t001C, sp_30->t0028, sp_30->t002C, sp_30->t0038, sp_30->t0048, sp_30->t0058, sp_30->t0068, sp_30->t0078, sp_30->t0088, sp_30->t0094, sp_30->t0098, sp_30->t00A8, sp_30->t00B8, sp_30->t00C8, sp_30->t00D4, sp_30->t00F4, out a0_51, out a3_54);
				if (a0_51 != 0x00)
				{
					word32 s1_524;
					word32 a0_525;
					word32 a1_526;
					word32 a2_527;
					word32 a3_528;
					word32 a4_529;
					word32 a5_530;
					word32 a7_531;
					word32 s2_532;
					word32 s3_533;
					word32 s4_534;
					word32 s5_535;
					word32 s6_536;
					word32 s7_537;
					word32 s8_538;
					word32 s9_539;
					word32 s10_540;
					word32 s11_541;
					word32 t4_542;
					printf(ra_57, &g_t230B7794, a3_54, sp_30->t0008, sp_30->t0028, sp_30->t0070, sp_30->t0074, sp_30->t0098, sp_30->t00BC, out s1_524, out a0_525, out a1_526, out a2_527, out a3_528, out a4_529, out a5_530, out a7_531, out s2_532, out s3_533, out s4_534, out s5_535, out s6_536, out s7_537, out s8_538, out s9_539, out s10_540, out s11_541, out t4_542);
				}
			}
		}
	}
	else
	{
		struct Eq_194559 * s0_135 = *((word32) s2_17 + 8);
		Eq_2 a0_140;
		word32 a2_459;
		word32 t1_457;
		word32 a1_458;
		word32 a3_460;
		word32 a4_461;
		word32 a5_462;
		Eq_2 ra_146 = memset(ra, fp + -0x0080, 0x00, 0x18, out t1_457, out a0_140, out a1_458, out a2_459, out a3_460, out a4_461, out a5_462);
		word16 wLoc7C_343 = (word16) (word32) s0_135->w0004;
		byte bLoc75_346 = (byte) (word32) s0_135->b0008;
		word32 a4_463;
		bt_mesh_model_elem(s2_17, out a4_463);
		struct Eq_194601 * a5_163;
		bt_mesh_net_transmit_get(out a5_163);
		Eq_2 dwLoc18_344 = 0x00;
		word32 a4_464;
		word32 a5_465;
		Eq_2 a3_175;
		Eq_2 a0_173 = bt_mesh_app_key_find((word32) a5_163->ptr0008->w0006, out a3_175, out a4_464, out a5_465);
		Eq_2 dwLoc7C_358 = SEQ(wLoc7A, wLoc7C_343);
		Eq_2 dwLoc78_361 = SEQ(bLoc75_346, nLoc78);
		if (a0_173 != 0x00)
		{
			Eq_2 a4_182;
			word32 a3_481;
			word32 a5_482;
			Eq_2 a0_181 = bt_mesh_subnet_get((word32) *a0_173, out a3_481, out a4_182, out a5_482);
			struct Eq_194702 * a5_199;
			word32 a1_483;
			word32 a2_484;
			word32 a3_485;
			word32 a4_486;
			net_buf_simple_add_mem(fp + -0x0098, -49, (word32) ((uint16[]) 4)[(word32) *((word32) a0_173 + 2) / 2], a4_182, out a1_483, out a2_484, out a3_485, out a4_486, out a5_199);
			Eq_2 s0_208 = a5_199->t000C;
			Mem218[s0_208 + 0x0C:byte] = SLICE(CONVERT(Mem190[s0_208 + 0x0C:byte], byte, word32) & ~0x07 | a5_199 + 0x07 & 7, byte, 0);
			dwLoc18_344 = a0_181;
			word32 a0_223;
			word32 s0_487;
			word32 s1_488;
			word32 a4_489;
			word32 a5_490;
			word32 s2_491;
			ra_146 = bt_mesh_trans_send(ra_146, s0_208, fp + -0x008C, fp + -0x0098, 588036560, s2_17, s2_17, a0_21, s5, s6, s7, s8, s9, s11, mstatus, dwLocA0, fp + -0x0068, fp + -0x0068, a0_140, dwLoc90, dwLoc8C, dwLoc88, dwLoc7C_358, dwLoc78_361, s2, s0, dwLoc48, dwLoc44, dwLoc38, dwLoc28, dwLoc24, 0x00480000, a0_181, dwLoc08, dwArg08, dwArg18, s1, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4, out s0_487, out s1_488, out a0_223, out a3_175, out a4_489, out a5_490, out s2_491, out mstatus);
			if (a0_223 == 0x00)
				return;
		}
		Eq_2 a3_264;
		Eq_2 a4_265;
		struct Eq_194633 * s1_268;
		Eq_2 s3_272;
		word32 a0_466;
		word32 a1_467;
		word32 a2_468;
		word32 a5_469;
		word32 a7_470;
		word32 s2_471;
		word32 s4_472;
		word32 s5_473;
		word32 s6_474;
		word32 s7_475;
		word32 s8_476;
		word32 s9_477;
		word32 s10_478;
		word32 s11_479;
		word32 t4_480;
		printf(ra_146, &g_t230B774C, a3_175, fp + -0x0068, dwLoc78_361, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, out s1_268, out a0_466, out a1_467, out a2_468, out a3_264, out a4_265, out a5_469, out a7_470, out s2_471, out s3_272, out s4_472, out s5_473, out s6_474, out s7_475, out s8_476, out s9_477, out s10_478, out s11_479, out t4_480);
		s1_268->b0FF0 = (byte) ((word32) s1_268->bFFFFFFF0 & ~0x07);
		if (s3_272 != 0x00)
		{
			word32 s1_492;
			word32 a0_493;
			word32 a1_494;
			word32 a2_495;
			word32 a3_496;
			word32 a4_497;
			word32 a5_498;
			word32 s2_499;
			word32 s3_500;
			word32 s4_501;
			word32 s5_502;
			word32 s6_503;
			word32 s8_504;
			k_delayed_work_submit(s3_272, a3_264, a4_265, mstatus, fp + -0x0068, fp + -0x0068, dwLoc7C_358, dwLoc28, dwLoc18_344, dwLoc08, dwArg08, dwArg18, s1, dwArg38, dwArg58, dwArg68, dwArg78, dwArg88, dwArgA8, out s1_492, out a0_493, out a1_494, out a2_495, out a3_496, out a4_497, out a5_498, out s2_499, out s3_500, out s4_501, out s5_502, out s6_503, out s8_504);
		}
	}
}

// 2303C9D4: Register Eq_2 bt_mesh_model_find_vnd(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register out Eq_195026 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mod_sub_get_vnd
//      get_model
Eq_2 bt_mesh_model_find_vnd(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, union Eq_195026 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	uint32 a6_5 = (word32) *((word32) a0 + 5);
	Eq_195026 a3_22 = 0x00;
	while (true)
	{
		Eq_2 a5_16;
		if ((a3_22 & 0x00FF) >= a6_5)
			break;
		a5_16 = (word32) a4 + ((word32) a3_22.u0 + 28);
		a4 = (word32) *a5_16;
		if (a4 == a1)
		{
			a4 = (word32) *((word32) a5_16 + 2);
			if (a4 == a2)
				goto l2303C9E6;
		}
		a3_22 = (word32) a3_22.u0 + 1;
	}
	a5_16.u0 = 0x00;
l2303C9E6:
	a3Out = a3_22;
	a4Out = a4;
	a5Out = a5_16;
	return a5_16;
}

// 2303CA06: Register Eq_2 bt_mesh_model_find(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_195058 a3Out, Register out Eq_195059 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mod_sub_get
//      get_model
Eq_2 bt_mesh_model_find(Eq_2 a0, Eq_2 a1, union Eq_195058 & a3Out, union Eq_195059 & a4Out, union Eq_2 & a5Out)
{
	Eq_195058 a3_5 = (word32) *((word32) a0 + 4);
	Eq_195059 a4_15 = 0x00;
	do
	{
		Eq_2 a5_16;
		Eq_195058 a5_9 = a4_15 & 0x00FF;
		if (a5_9 >= a3_5)
		{
			a5_16.u0 = 0x00;
			break;
		}
		a5_16 = (word32) a5_9.u0 + ((word32) a4_15.u0 + 28);
		a4_15 = (word32) a4_15.u0 + 1;
	} while ((word32) *a5_16 != a1);
	a3Out = a3_5;
	a4Out = a4_15;
	a5Out = a5_16;
	return a5_16;
}

// 2303CA30: Register (ptr32 Eq_192958) bt_mesh_comp_get(Register out ptr32 a5Out)
// Called from:
//      send_friend_req.constprop.8
//      dev_comp_data_get
//      health_pub_update
struct Eq_192958 * bt_mesh_comp_get(ptr32 & a5Out)
{
	struct Eq_192958 * a0_5 = g_ptr4200F418;
	a5Out = 0x4200F000;
	return a0_5;
}

