pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303CA3A: void adv_alloc()
void adv_alloc()
{
}

// 2303CA4C: void adv_thread(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack word32 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack word32 dwArgCC, Stack Eq_2 dwArgD8, Stack ptr32 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack ptr32 dwArg0124, Stack Eq_2 dwArg0138, Stack word32 dwArg0158)
void adv_thread(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s8, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, word32 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, word32 dwArgCC, Eq_2 dwArgD8, ptr32 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, ptr32 dwArg0124, Eq_2 dwArg0138, word32 dwArg0158)
{
	word32 s3_11 = 0x4200F000;
	Eq_2 dwLoc38_498 = s10;
	Eq_2 s5_144 = 0x4200F000;
	Eq_2 s7_146 = 0x230B8000;
	s0_171 = s0;
l2303CA84:
	Eq_2 s0_171;
	Eq_2 a0_46;
	word32 s4_971;
	word32 a3_967;
	word32 a4_968;
	word32 s3_970;
	word32 a5_969;
	word32 a2_966;
	Eq_2 s2_141;
	Eq_2 s8_147;
	Eq_2 a1_131;
	Eq_2 s1_138 = net_buf_get(ra, s0_171, s3_11 + -344, 0x00, a3, a4, mstatus, dwLoc08, dwArgA8, dwArgE8, out a0_46, out a1_131, out a2_966, out a3_967, out a4_968, out a5_969, out s2_141, out s3_970, out s4_971, out s8_147);
	Eq_2 s9_148 = a0_46;
	while (true)
	{
		word16 wLoc3A_583 = SLICE(dwLoc3C, word16, 16);
		word16 wLoc36_563 = SLICE(dwLoc38_498, word16, 16);
		if (s9_148 != 0x00)
			break;
		Eq_2 a0_76;
		Eq_2 a3_78;
		Eq_2 a4_79;
		word32 s5_87;
		ptr32 mstatus_96;
		Eq_2 ra_97 = bt_mesh_proxy_adv_start(ra, s1_138, s2_141, s7_146, s8_147, s9_148, mstatus, s2, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg28, dwArg38, dwArg3C, s9, s1, dwArg68, dwArg78, dwArg88, dwArg8C, dwArgE4, dwArg0158, out s0_171, out a0_76, out a3_78, out a4_79, out s5_87, out mstatus_96);
		Eq_2 a3_110;
		Eq_2 a4_111;
		word32 s4_936;
		word32 a2_932;
		word32 a0_930;
		word32 s8_937;
		word32 a5_933;
		word32 s3_935;
		word32 s2_934;
		word32 a1_931;
		net_buf_get(ra_97, s0_171, s5_87 + -344, a0_76, a3_78, a4_79, mstatus_96, dwLoc08, dwArgA8, dwArgE8, out a0_930, out a1_931, out a2_932, out a3_110, out a4_111, out a5_933, out s2_934, out s3_935, out s4_936, out s8_937);
		ra = bt_mesh_proxy_adv_stop(ra_97, s0_171, a3_110, a4_111, mstatus_96, dwLoc40, dwLoc3C, dwLoc38_498, s4, s2, s0, dwLoc18, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg30, dwArg38, s9, s1, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, out s1_138, out a1_131, out s2_141, out s5_144, out s7_146, out s8_147, out s9_148, out mstatus);
	}
	Eq_2 a4_156 = *((word32) s9_148 + 20);
	ui32 a5_157 = (word32) *((word32) a4_156 + 8);
	if ((a5_157 & 4) == 0x00)
	{
		word32 s4_944;
		word32 a1_940;
		word32 s6_945;
		word32 s8_946;
		word32 a2_941;
		word32 s2_943;
		word32 a5_942;
		word32 a0_939;
		word32 s1_938;
		ra = net_buf_unref(ra, s1_138, s9_148, a1_131, a4_156, mstatus, dwLoc40, dwLoc3C, dwLoc38_498, dwLoc18, dwArg38, dwArg44, s1, dwArg64, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_171, out s1_938, out a0_939, out a1_940, out a2_941, out a3, out a4, out a5_942, out s2_943, out s3_11, out s4_944, out s5_144, out s6_945, out s8_946, out mstatus);
		goto l2303CB5A;
	}
	*((word32) a4_156 + 8) = (byte) (a5_157 & ~0x04);
	Eq_195375 a5_190 = 0x14;
	if ((word32) *((word32) s1_138 + 16) <= 0x08)
		a5_190.u0 = 100;
	Eq_195383 a5_206;
	uint32 a4_196 = (word32) *((word32) *((word32) s9_148 + 20) + 9);
	Eq_195392 a2_202 = (a4_196 >> 0x03) + 0x01;
	if ((word32) a2_202 + 0x0A >= a5_190)
		a5_206 = (word32) a2_202 + 0x0A;
	else
		a5_206 = (word32) (word16) a5_190;
	Eq_195424 a4_213 = (word32) a5_206 + 0x0A;
	uint32 a5_241 = (a5_206 << 3 ^ 0x05) << 16;
	Eq_2 a4_235 = *((word32) s9_148 + 8);
	dwLoc38_498 = SEQ(wLoc36_563, SLICE(CONVERT(Mem229[s9_148 + 0x0C:uint16], uint16, word32), byte, 0), SLICE(CONVERT(Mem220[(a4_213 & 0x03) + s2_141:byte], byte, word32), byte, 0));
	dwLoc3C = SEQ(wLoc3A_583, (word16) (a5_241 >> 16));
	dwLoc40 = SEQ((word16) (a5_241 >> 16), 0x00);
	dwArg44 = a4_235;
	word32 a0_256;
	Eq_2 a1_258;
	Eq_2 a4_261;
	ptr32 mstatus_264;
	Eq_2 s1_267;
	word32 s7_275;
	Eq_2 s9_277;
	<anonymous> * a5_292;
	word32 s1_298;
	word32 s4_958;
	word32 s8_953;
	word32 a3_948;
	word32 s5_959;
	word32 s6_960;
	word32 a0_954;
	word32 s2_956;
	word32 s3_957;
	word32 a1_955;
	word32 s2_949;
	word32 s5_951;
	word32 s6_952;
	word32 s3_950;
	word32 s0_947;
	word32 s8_304;
	Eq_2 a4_291;
	Eq_2 a2_289;
	ra = net_buf_unref(bt_le_adv_start(ra, s0_171, fp + -64, 0x00, s2_141, s5_144, s7_146, (word32) (word16) ((word32) a4_213 + ((a4_196 & 7) + 0x01) + 0x1E), mstatus, dwLoc3C, dwLoc38_498, s8, s2, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwLoc04, dwArg18, dwArg28, dwArg38, s9, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArg0124, out s0_947, out s1_267, out a0_256, out a1_258, out a3_948, out a4_261, out s2_949, out s3_950, out s5_951, out s6_952, out s7_275, out s8_953, out s9_277, out mstatus_264), s1_267, s9_277, a1_258, a4_261, mstatus_264, dwLoc40, dwLoc3C, dwLoc38_498, dwLoc18, dwArg38, a4_235, s1, dwArg64, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_171, out s1_298, out a0_954, out a1_955, out a2_289, out a3, out a4_291, out a5_292, out s2_956, out s3_957, out s4_958, out s5_959, out s6_960, out s8_304, out mstatus);
	if (s0_171 != 0x00)
	{
		s0_171 = *a5_292;
		if (a5_292 != null)
			a5_292();
	}
	struct Eq_274 * a0_428;
	if (a0_256 != 0x00)
		a0_428 = s7_275 + -0x07A0;
	else
	{
		Eq_2 a3_353;
		Eq_2 a4_354;
		s0_171 = k_sleep(s8_304, a2_289, a3, a4_291, mstatus, dwLoc1C, dwLoc18, dwArgF8, dwArg0138, out a3_353, out a4_354);
		struct Eq_195597 * a5_370;
		word32 a0_393;
		word32 s2_962;
		word32 s4_963;
		word32 s9_965;
		word32 s8_964;
		word32 s1_961;
		word32 s6_382;
		ra = bt_le_adv_stop(ra, s0_171, a3_353, a4_354, mstatus, dwLoc40, dwLoc3C, s6, s4, s2, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg24, dwArg28, dwArg38, s9, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s1_961, out a0_393, out a3, out a4, out a5_370, out s2_962, out s3_11, out s4_963, out s5_144, out s6_382, out s7_146, out s8_964, out s9_965, out mstatus);
		word32 s8_394 = a0_393;
		if (s0_171 != 0x00)
		{
			s0_171 = a5_370->t0004;
			if (a5_370 != null)
				a5_370();
		}
		if (s8_394 == 0x00)
		{
l2303CB5A:
			k_yield();
			goto l2303CA84;
		}
		a0_428 = s6_382 + -0x0780;
	}
	word32 s11_984;
	word32 s6_980;
	word32 a2_975;
	word32 t4_985;
	word32 s8_981;
	word32 s10_983;
	word32 s9_982;
	word32 a5_976;
	word32 s2_978;
	word32 s4_979;
	word32 a7_977;
	word32 s1_972;
	word32 a1_974;
	word32 a0_973;
	ra = printf(ra, a0_428, a3, dwLoc38_498, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_972, out a0_973, out a1_974, out a2_975, out a3, out a4, out a5_976, out a7_977, out s2_978, out s3_11, out s4_979, out s5_144, out s6_980, out s7_146, out s8_981, out s9_982, out s10_983, out s11_984, out t4_985);
	goto l2303CB5A;
}

// 2303CBA6: void bt_mesh_scan_cb(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack word32 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128)
void bt_mesh_scan_cb(Eq_2 ra, Eq_2 s0, ptr32 a1, word32 a2, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s8, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, word32 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, word32 dwArg0128)
{
	if (a2 != 0x03)
		return;
	Eq_2 s0_165 = a3;
	ptr32 s3_126 = a1;
	Eq_2 s5_127 = 0x01;
	Eq_2 s6_128 = 42;
	Eq_2 s7_106 = 43;
	Eq_2 s8_104 = 41;
	Eq_2 s2_125 = 0x0FFFFFFF;
	while (true)
	{
		Eq_2 a5_42 = (word32) *((word32) s0_165 + 4);
		if (s5_127 >= a5_42)
			break;
		word32 a1_478;
		word32 a2_479;
		word32 a5_480;
		Eq_2 a0_45 = net_buf_simple_pull_u8(a5_42, out a1_478, out a2_479, out a5_480);
		Eq_2 s4_114 = a0_45;
		if (a0_45 == 0x00)
			break;
		Eq_2 a5_50 = (word32) *((word32) s0_165 + 4);
		Eq_2 s1_52 = (word32) (word16) a0_45;
		if (a5_50 < s1_52)
		{
			0x00 = dwArg0128;
			0x00 = (int8) dwArg1C;
			word32 s1_484;
			word32 a3_488;
			word32 a4_489;
			word32 a7_491;
			word32 s2_492;
			word32 s5_495;
			word32 t4_502;
			word32 s10_500;
			word32 s11_501;
			word32 s9_499;
			word32 a0_485;
			word32 a1_486;
			word32 a2_487;
			word32 a5_490;
			word32 s3_493;
			word32 s4_494;
			word32 s6_496;
			word32 s7_497;
			word32 s8_498;
			printf(ra, &g_t230B78E4, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_484, out a0_485, out a1_486, out a2_487, out a3_488, out a4_489, out a5_490, out a7_491, out s2_492, out s3_493, out s4_494, out s5_495, out s6_496, out s7_497, out s8_498, out s9_499, out s10_500, out s11_501, out t4_502);
			return;
		}
		Eq_2 a0_55 = net_buf_simple_headroom(a4);
		word32 s9_130 = (word32) *((word32) s0_165 + 4);
		word32 a1_481;
		word32 a5_483;
		word32 a2_482;
		Eq_2 a0_109 = net_buf_simple_pull_u8(a5_50, out a1_481, out a2_482, out a5_483);
		((word32) s0_165 + 4)->u2 = (word16) ((word32) s1_52 - 1);
		Eq_2 s10_123 = a0_55;
		if (a0_109 != s6_128)
		{
			if (a0_109 != s7_106)
			{
				if (a0_109 == s8_104)
					ra = bt_mesh_pb_adv_recv(ra, s0_165, a3, a4, s2_125, s6, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg94, out a0_109, out a3, out a4, out s2_125, out s3_126, out s4_114, out s5_127, out s6_128, out s7_106, out s8_104, out s9_130, out s10_123);
			}
			else
			{
				word32 a5_507;
				ra = bt_mesh_beacon_recv(ra, s0_165, s0_165, a3, s2_125, a0_45, s5_127, mstatus, s10, s8, s6, s4, dwLoc18, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg48, dwArg4C, s5, s3, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, out a0_109, out a3, out a4, out a5_507, out s2_125, out s3_126, out s4_114, out s5_127, out s6_128, out s7_106, out s8_104, out s9_130, out s10_123, out mstatus);
			}
		}
		else
		{
			word32 s0_503;
			word32 s1_504;
			word32 a1_505;
			word32 a5_506;
			ra = bt_mesh_net_recv(ra, s0_165, (word32) s1_52 - 1, s0_165, s3_126, 0x00, s2_125, a0_45, s8_104, a0_55, mstatus, s10, s8, s6, s4, s0, dwLoc18, dwLoc14, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, out s0_503, out s1_504, out a0_109, out a1_505, out a3, out a4, out a5_506, out s2_125, out s3_126, out s4_114, out s5_127, out s6_128, out s7_106, out s8_104, out s9_130, out s10_123, out mstatus);
		}
		s0_165 = *((word32) a0_109 + 8);
		((word32) s0_165 + 4)->u2 = (word16) s9_130;
		*((word32) a0_109 + (s10_123 & s2_125)) = s0_165;
		word32 a1_508;
		word32 a5_509;
		net_buf_simple_pull(s0_165, s4_114, out a1_508, out a5_509);
	}
	0x00 = dwArg0128;
	0x00 = (int8) dwArg1C;
}

// 2303CC94: Register Eq_2 bt_mesh_adv_create_from_pool(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_196126 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_adv_create
//      create_friend_pdu
Eq_2 bt_mesh_adv_create_from_pool(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_196126 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s8_129;
	ptr32 s6_127;
	ptr32 s5_126;
	ptr32 s4_125;
	ptr32 s3_124;
	Eq_196126 s2_104;
	Eq_2 s1_120;
	Eq_2 ra_100;
	ptr32 a1_114;
	ptr32 a3_116;
	ptr32 a4_117;
	ptr32 a5_112;
	Eq_2 s0_133;
	if ((atomic_get(0x4200D6C4) >> 1 & 0x01) != 0x00)
	{
		word32 a0_221;
		word32 a2_222;
		word32 a7_223;
		word32 t4_224;
		ra_100 = printf(ra, &g_t230B78A8, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_120, out a0_221, out a1_114, out a2_222, out a3_116, out a4_117, out a5_112, out a7_223, out s2_104, out s3_124, out s4_125, out s5_126, out s6_127, out s7, out s8_129, out s9, out s10, out s11, out t4_224);
		s0_133.u0 = 0x00;
	}
	else
	{
		Eq_2 a0_35;
		word32 s0_220;
		ra_100 = net_buf_alloc_fixed(ra, a4, a3, a4, a5, s5, mstatus, dwArg84, dwArg98, dwArgD8, dwArgF8, out s0_220, out s1_120, out a0_35, out a1_114, out a3_116, out a4_117, out a5_112, out s2_104, out s3_124, out s4_125, out s5_126, out s6_127, out s8_129, out mstatus);
		s0_133 = a0_35;
		if (a0_35 != 0x00)
		{
			word32 a3_62;
			word32 a4_63;
			word32 a5_64;
			net_buf_id(a0_35, out a3_62, out a4_63, out a5_64);
			Eq_2 a0_65;
			Eq_2 ra_74;
			ui32 s2_77;
			s1_120();
			*((word32) a0_65 + 20) = s0_133;
			word32 t1_225;
			word32 a0_226;
			word32 a2_227;
			ra_100 = memset(ra_74, a0_65, 0x00, 0x0C, out t1_225, out a0_226, out a1_114, out a2_227, out a3_116, out a4_117, out a5_112);
			ui32 a2_103 = (word32) *((word32) a0_65 + 8);
			*((word32) a0_65 + 9) = (byte) s3_124;
			*((word32) a0_65 + 8) = (byte) (a2_103 & ~0x03 | s2_77 & 3);
			s1_120 = a0_65;
			s2_104 = s2_77 & 3;
		}
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_120;
	a0Out = s0_133;
	a1Out = a1_114;
	a3Out = a3_116;
	a4Out = a4_117;
	a5Out = a5_112;
	s2Out = s2_104;
	s3Out = s3_124;
	s4Out = s4_125;
	s5Out = s5_126;
	s6Out = s6_127;
	s7Out = s7;
	s8Out = s8_129;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra_100;
}

// 2303CD12: Register Eq_2 bt_mesh_adv_create(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out Eq_184704 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      blemesh_net_send
//      bt_mesh_adv_update
//      beacon_send
//      bt_mesh_net_recv
//      adv_buf_create
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
Eq_2 bt_mesh_adv_create(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0128, union Eq_184704 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a1_18;
	ptr32 a3_20;
	ptr32 a4_21;
	ptr32 a5_22;
	ptr32 mstatus_25;
	Eq_184704 s0_27;
	ptr32 s1_28;
	ptr32 s2_29;
	ptr32 s3_30;
	ptr32 s4_31;
	ptr32 s5_32;
	ptr32 s6_33;
	ptr32 s8_34;
	ptr32 a0_42;
	ptr32 s10_43;
	ptr32 s11_44;
	ptr32 s7_45;
	ptr32 s9_46;
	Eq_2 ra_26 = bt_mesh_adv_create_from_pool(ra, a1, a2, a5, s5, mstatus, dwArg40, dwArg44, dwArg68, dwArg84, dwArg8C, dwArg98, dwArgD8, dwArgF8, dwArg0128, out s0_27, out s1_28, out a0_42, out a1_18, out a3_20, out a4_21, out a5_22, out s2_29, out s3_30, out s4_31, out s5_32, out s6_33, out s7_45, out s8_34, out s9_46, out s10_43, out s11_44, out mstatus_25);
	s0Out = s0_27;
	s1Out = s1_28;
	a0Out = a0_42;
	a1Out = a1_18;
	a3Out = a3_20;
	a4Out = a4_21;
	a5Out = a5_22;
	s2Out = s2_29;
	s3Out = s3_30;
	s4Out = s4_31;
	s5Out = s5_32;
	s6Out = s6_33;
	s7Out = s7_45;
	s8Out = s8_34;
	s9Out = s9_46;
	s10Out = s10_43;
	s11Out = s11_44;
	mstatusOut = mstatus_25;
	return ra_26;
}

// 2303CD2C: Register Eq_2 bt_mesh_adv_update(Register Eq_2 ra, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out (ptr32 Eq_196347) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_196352) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      net_key_add
//      node_identity_set
//      gatt_proxy_set
//      bt_mesh_prov_enable
//      bt_mesh_net_start
//      proxy_disconnected
//      proxy_connected
//      bt_mesh_proxy_identity_enable
//      bt_mesh_proxy_prov_disable
Eq_2 bt_mesh_adv_update(Eq_2 ra, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & s0Out, struct Eq_196347 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_196352 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a4_16;
	ptr32 mstatus_20;
	Eq_2 s0_22;
	ptr32 s11_25;
	ptr32 s7_31;
	ptr32 s9_33;
	word32 s1_101;
	word32 a0_102;
	word32 a1_103;
	word32 a3_104;
	word32 a5_105;
	word32 s2_106;
	word32 s3_107;
	word32 s4_108;
	word32 s5_109;
	word32 s6_110;
	word32 s8_111;
	word32 s10_112;
	Eq_2 ra_21 = bt_mesh_adv_create(ra, 0x00, 0x00, a5, s5, mstatus, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArg88, dwArgC8, dwArgE8, dwArg0118, out s0_22, out s1_101, out a0_102, out a1_103, out a3_104, out a4_16, out a5_105, out s2_106, out s3_107, out s4_108, out s5_109, out s6_110, out s7_31, out s8_111, out s9_33, out s10_112, out s11_25, out mstatus_20);
	Eq_2 a0_41 = *((word32) a4_16 + 20);
	*((word32) a4_16 + 8) = (byte) ((word32) *((word32) a4_16 + 8) & ~0x04);
	Eq_2 a5_45 = net_buf_ref(a0_41);
	ptr32 a0_51;
	ptr32 a3_54;
	ptr32 a4_55;
	ptr32 a5_56;
	struct Eq_196352 * s2_60;
	ptr32 s3_61;
	ptr32 s4_62;
	ptr32 s5_63;
	ptr32 s6_64;
	ptr32 s8_65;
	word32 a1_113;
	struct Eq_196347 * s1_59 = net_buf_put(ra_21, s0_22, 0x4200EEA8, a0_41, a4_16, a5_45, mstatus_20, dwArgE8, dwArg0128, dwArg0168, out a0_51, out a1_113, out a3_54, out a4_55, out a5_56, out s2_60, out s3_61, out s4_62, out s5_63, out s6_64, out s8_65);
	s0Out = s0_22;
	s1Out = s1_59;
	a0Out = a0_51;
	a3Out = a3_54;
	a4Out = a4_55;
	a5Out = a5_56;
	s2Out = s2_60;
	s3Out = s3_61;
	s4Out = s4_62;
	s5Out = s5_63;
	s6Out = s6_64;
	s7Out = s7_31;
	s8Out = s8_65;
	s9Out = s9_33;
	s11Out = s11_25;
	mstatusOut = mstatus_20;
	return ra_21;
}

// 2303CD5C: Register (ptr32 Eq_196347) bt_mesh_adv_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_196483) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      beacon_send
//      bt_mesh_net_resend
//      bt_mesh_net_recv
//      send_reliable
//      prov_retransmit
//      gen_prov_start
//      bt_mesh_ctl_send
//      friend_timeout
struct Eq_196347 * bt_mesh_adv_send(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_196483 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	*a1 = a4;
	*((word32) a2 + 4) = a4;
	Eq_2 a0_13 = *((word32) a4 + 20);
	*((word32) a4 + 8) = (byte) ((word32) *((word32) a4 + 8) | 4);
	Eq_2 a5_17 = net_buf_ref(a0_13);
	ptr32 a1_26;
	ptr32 a3_28;
	ptr32 a4_29;
	struct Eq_196483 * a5_30;
	ptr32 s2_34;
	ptr32 s3_35;
	ptr32 s5_37;
	ptr32 s6_38;
	ptr32 s8_39;
	word32 a0_61;
	word32 s4_62;
	struct Eq_196347 * s1_33 = net_buf_put(ra, s0, 0x4200EEA8, a0_13, a4, a5_17, mstatus, dwArgE8, dwArg0128, dwArg0168, out a0_61, out a1_26, out a3_28, out a4_29, out a5_30, out s2_34, out s3_35, out s4_62, out s5_37, out s6_38, out s8_39);
	a1Out = a1_26;
	a3Out = a3_28;
	a4Out = a4_29;
	a5Out = a5_30;
	s2Out = s2_34;
	s3Out = s3_35;
	s5Out = s5_37;
	s6Out = s6_38;
	s8Out = s8_39;
	return s1_33;
}

