pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303CD8C: Register Eq_2 bt_mesh_adv_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bt_mesh_init
Eq_2 bt_mesh_adv_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a3Out, ptr32 & a4Out)
{
	Eq_2 a3_16;
	Eq_2 a4_17;
	Eq_2 a5_18;
	word32 s2_85;
	word32 s3_86;
	k_queue_init(ra, 60, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a3_16, out a4_17, out a5_18, out s2_85, out s3_86);
	Eq_2 s3_39;
	word32 a3_87;
	word32 a4_88;
	word32 a5_89;
	word32 s2_90;
	Eq_2 s1_37 = k_queue_init(ra, 0x14, a3_16, a4_17, a5_18, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a3_87, out a4_88, out a5_89, out s2_90, out s3_39);
	ptr32 a3_57;
	ptr32 a4_58;
	word32 s1_91;
	word32 a0_92;
	word32 a5_93;
	word32 s2_94;
	word32 s3_95;
	Eq_2 ra_61 = k_thread_create(ra, s1_37, 0x4200F420, 0x0400, 0x1C, s3_39, mstatus, dwArg00, dwArg04, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_91, out a0_92, out a3_57, out a4_58, out a5_93, out s2_94, out s3_95);
	a3Out = a3_57;
	a4Out = a4_58;
	return ra_61;
}

// 2303CDD4: Register Eq_2 bt_mesh_scan_enable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_188234 s0Out, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      friend_clear_sent
//      bt_mesh_lpn_init
//      bt_mesh_prov_enable
Eq_2 bt_mesh_scan_enable(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_188234 & s0Out, ptr32 & s1Out, ptr32 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_188234 a0_22;
	ptr32 mstatus_37;
	ptr32 a1_124;
	Eq_2 a3_126;
	ptr32 a4_127;
	ptr32 s1_133;
	ptr32 s11_135;
	ptr32 s2_136;
	ptr32 s3_137;
	ptr32 s4_138;
	ptr32 s5_139;
	ptr32 s6_140;
	ptr32 s7_141;
	Eq_2 ra_132 = bt_le_scan_start(ra, s0, s1, fp + ~0x17, s2, s4, mstatus, dwLoc20, a4, dwLoc18, SEQ(SLICE(s0, word16, 16), (word16) (word32) *((word32) *a4 + 4)), dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_133, out a0_22, out a1_124, out a3_126, out a4_127, out s2_136, out s3_137, out s4_138, out s5_139, out s6_140, out s7_141, out s11_135, out mstatus_37);
	Eq_188234 s0_51 = a0_22;
	if (a0_22 != 0x00)
	{
		if (a0_22 != -69)
		{
			word32 a0_163;
			word32 a2_164;
			word32 a5_165;
			word32 a7_166;
			word32 s8_167;
			word32 s9_168;
			word32 s10_169;
			word32 t4_170;
			ra_132 = printf(ra_132, &g_t230B7914, a3_126, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_133, out a0_163, out a1_124, out a2_164, out a3_126, out a4_127, out a5_165, out a7_166, out s2_136, out s3_137, out s4_138, out s5_139, out s6_140, out s7_141, out s8_167, out s9_168, out s10_169, out s11_135, out t4_170);
		}
		else
			s0_51.u0 = 0x00;
	}
	s0Out = s0_51;
	s1Out = s1_133;
	a1Out = a1_124;
	a3Out = a3_126;
	a4Out = a4_127;
	s2Out = s2_136;
	s3Out = s3_137;
	s4Out = s4_138;
	s5Out = s5_139;
	s6Out = s6_140;
	s7Out = s7_141;
	s8Out = a4;
	s11Out = s11_135;
	mstatusOut = mstatus_37;
	return ra_132;
}

// 2303CE24: Register Eq_2 bt_mesh_scan_disable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      friend_response_received.constprop.7
//      bt_mesh_reset
//      bt_mesh_prov_disable
Eq_2 bt_mesh_scan_disable(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	int32 a0_13;
	ptr32 mstatus_25;
	Eq_2 a3_121;
	ptr32 a4_122;
	ptr32 s1_128;
	ptr32 s2_131;
	ptr32 s3_132;
	ptr32 s4_133;
	ptr32 s5_134;
	ptr32 s6_135;
	ptr32 s7_136;
	ptr32 s8_137;
	ptr32 s9_138;
	Eq_2 ra_127 = bt_le_scan_stop(ra, s0, a3, a4, s2, s3, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg44, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_128, out a0_13, out a3_121, out a4_122, out s2_131, out s3_132, out s4_133, out s5_134, out s6_135, out s7_136, out s8_137, out s9_138, out mstatus_25);
	if (a0_13 != 0x00 && a0_13 != -69)
	{
		word32 a0_158;
		word32 a1_159;
		word32 a2_160;
		word32 a5_161;
		word32 a7_162;
		word32 s10_163;
		word32 s11_164;
		word32 t4_165;
		ra_127 = printf(ra_127, &g_t230B78F4, a3_121, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_128, out a0_158, out a1_159, out a2_160, out a3_121, out a4_122, out a5_161, out a7_162, out s2_131, out s3_132, out s4_133, out s5_134, out s6_135, out s7_136, out s8_137, out s9_138, out s10_163, out s11_164, out t4_165);
	}
	s1Out = s1_128;
	a3Out = a3_121;
	a4Out = a4_122;
	s2Out = s2_131;
	s3Out = s3_132;
	s4Out = s4_133;
	s5Out = s5_134;
	s6Out = s6_135;
	s7Out = s7_136;
	s8Out = s8_137;
	s9Out = s9_138;
	mstatusOut = mstatus_25;
	return ra_127;
}

// 2303CE56: void beacon_complete()
void beacon_complete()
{
	word32 a1_9;
	word32 a2_20;
	word32 a5_21;
	k_uptime_get_32(out a1_9, out a2_20, out a5_21)->dw0000 = a1_9;
}

// 2303CE6A: Register Eq_2 bt_mesh_beacon_create(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out)
// Called from:
//      beacon_send
//      beacon_send
Eq_2 bt_mesh_beacon_create(Eq_2 a0, Eq_2 a1, Eq_2 a5, union Eq_2 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out)
{
	Eq_2 a0_18 = bt_mesh_net_flags(a0);
	word32 a5_108;
	net_buf_simple_add_u8(a1, 0x01, a5, out a5_108);
	Eq_2 a5_27 = (word32) *((word32) a0 + 30);
	ptr32 s2_28 = (word32) a0 + 0x0089;
	if (a5_27 == 0x00)
		s2_28 = (word32) a0 + 48;
	word32 a5_109;
	word32 a1_110;
	word32 a2_111;
	word32 a3_112;
	word32 a4_113;
	word32 a5_114;
	net_buf_simple_add_mem(a1, s2_28 + 33, 0x08, net_buf_simple_add_u8(a1, a0_18, a5_27, out a5_109), out a1_110, out a2_111, out a3_112, out a4_113, out a5_114);
	word32 a5_115;
	Eq_2 a4_62 = net_buf_simple_add_be32(a1, g_t4200D6BC, &g_dw4200D000, out a5_115);
	ptr32 a3_78;
	ptr32 a4_79;
	word32 a1_116;
	word32 a2_117;
	word32 a5_118;
	net_buf_simple_add_mem(a1, (word32) a0 + 40, 0x08, a4_62, out a1_116, out a2_117, out a3_78, out a4_79, out a5_118);
	s1Out = a0;
	a3Out = a3_78;
	a4Out = a4_79;
	s2Out = s2_28;
	return a1;
}

// 2303CED0: void beacon_send(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void beacon_send(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a1_611;
	if (bt_prov_active() != 0x00)
	{
l2303CEEC:
		a1_611.u0 = 0x01000388;
		goto l2303CFBE;
	}
	if (bt_mesh_is_provisioned() != 0x00)
	{
		word32 a5_408 = (word32) g_b4200F424;
		g_b4200F424 = (byte) (a5_408 ^ 1);
		a4.u0 = 0x4200F424;
		Eq_2 s0_410 = 0x4200D6BC;
		if ((a5_408 ^ 1) == 0x00)
		{
			if ((word32) g_w4200D8DC != 0x0FFFFFFF)
			{
				word32 a5_416 = (word32) g_b4200D8C5;
				g_b4200D8C5 = 0x00;
				g_t4200D8C4 = (byte) a5_416;
			}
			a4 = (word32) g_w4200D9C0;
			if (a4 != 0x0FFFFFFF)
			{
				word32 a5_424 = (word32) g_b4200D9A9;
				g_b4200D9A9 = 0x00;
				g_b4200D9A8 = (byte) a5_424;
			}
		}
		word32 a2_1322;
		word32 a5_1323;
		word32 a1_1321;
		struct Eq_192645 * s6_435 = k_uptime_get_32(out a1_1321, out a2_1322, out a5_1323);
		Eq_2 s5_437 = 0x4200D884;
		Eq_2 s1_438 = 0x0FFFFFFF;
		Eq_2 s2_439 = 599999;
		word32 s3_441 = 0x02000710;
		word32 s4_442 = ~0x01000387;
		do
		{
			Eq_2 a5_445 = (word32) *((word32) s0_410 + 544);
			if (a5_445 != s1_438)
			{
				a4 = s6_435 - *((word32) s0_410 + 516);
				if (s2_439 >= a4)
				{
					a5_445 = (word32) *((word32) s0_410 + 520) + 0x01 + s3_441 + s4_442;
					if (a4 >= a5_445)
						goto l2303CF94;
				}
				else
				{
l2303CF94:
					word32 a0_470;
					Eq_2 a3_473;
					Eq_2 a5_475;
					word32 s0_480;
					word32 s7_489;
					word32 s5_1330;
					word32 s6_1331;
					word32 s8_1332;
					word32 s9_1333;
					word32 s10_1334;
					word32 s11_1335;
					word32 s3_1328;
					word32 s4_1329;
					word32 a1_1325;
					word32 a4_1326;
					word32 s2_1327;
					word32 s1_1324;
					Eq_2 ra_479 = bt_mesh_adv_create(ra, 0x08, 0x00, a5_445, s5_437, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, dwArg1C, dwArg28, dwArg68, dwArg88, dwArgB8, out s0_480, out s1_1324, out a0_470, out a1_1325, out a3_473, out a4_1326, out a5_475, out s2_1327, out s3_1328, out s4_1329, out s5_1330, out s6_1331, out s7_489, out s8_1332, out s9_1333, out s10_1334, out s11_1335, out mstatus);
					if (a0_470 == 0x00)
					{
						word32 s6_1360;
						word32 s7_1361;
						word32 s8_1362;
						word32 s9_1363;
						word32 s10_1364;
						word32 t4_1366;
						word32 s11_1365;
						word32 a5_1354;
						word32 s3_1357;
						word32 s4_1358;
						word32 s5_1359;
						word32 s2_1356;
						word32 a7_1355;
						word32 a0_1351;
						word32 a1_1352;
						word32 a2_1353;
						word32 s1_1350;
						printf(ra_479, &g_t230B7934, a3_473, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_1350, out a0_1351, out a1_1352, out a2_1353, out a3, out a4, out a5_1354, out a7_1355, out s2_1356, out s3_1357, out s4_1358, out s5_1359, out s6_1360, out s7_1361, out s8_1362, out s9_1363, out s10_1364, out s11_1365, out t4_1366);
						break;
					}
					dwArg14 = s0_480 + 516;
					Eq_2 a4_508;
					Eq_2 a1_528;
					Eq_2 a4_531;
					Eq_2 s8_541;
					word32 a0_1345;
					word32 a1_1346;
					word32 a2_1347;
					word32 a5_1348;
					word32 s8_1349;
					word32 a3_1339;
					word32 s3_1342;
					word32 s5_1343;
					word32 s6_1344;
					word32 s2_1341;
					word32 a5_1340;
					word32 s1_1336;
					word32 a3_1337;
					word32 s2_1338;
					ra = net_buf_unref(ra_479, bt_mesh_adv_send(ra_479, bt_mesh_beacon_create(s0_480 + 516, a0_470 + 8, a5_475, out s1_1336, out a3_1337, out a4_508, out s2_1338), s7_489 + -1556, s0_480 + 516, a4_508, mstatus, dwArg78, dwArgB8, dwArgF8, out a1_528, out a3_1339, out a4_531, out a5_1340, out s2_1341, out s3_1342, out s5_1343, out s6_1344, out s8_541), s8_541, a1_528, a4_531, mstatus, dwLoc70, dwLoc6C, dwLoc68, s6, dwArg08, s0_480 + 516, dwArg28, s7, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_410, out s1_438, out a0_1345, out a1_1346, out a2_1347, out a3, out a4, out a5_1348, out s2_439, out s3_441, out s4_442, out s5_437, out s6_435, out s8_1349, out mstatus);
				}
			}
			s0_410 = (word32) s0_410 + 228;
		} while (s0_410 != s5_437);
		word32 a5_1479;
		if (bt_mesh_beacon_get(out a5_1479) != 0x01 && (atomic_get(0x4200D6C4) >> 3 & 0x01) == 0x00)
			return;
		a1_611.u0 = 0x02000710;
l2303CFBE:
		word32 a5_1299;
		word32 s8_1305;
		word32 a0_1294;
		word32 s1_1293;
		word32 a2_1296;
		word32 a1_1295;
		word32 a3_1297;
		word32 a4_1298;
		word32 s2_1300;
		word32 s4_1302;
		word32 s3_1301;
		word32 s6_1304;
		word32 s5_1303;
		k_delayed_work_submit(a1_611, a3, a4, mstatus, dwLoc6C, dwLoc68, s8, dwArg08, dwArg18, dwArg28, s5, dwArg48, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s1_1293, out a0_1294, out a1_1295, out a2_1296, out a3_1297, out a4_1298, out a5_1299, out s2_1300, out s3_1301, out s4_1302, out s5_1303, out s6_1304, out s8_1305);
		return;
	}
	struct Eq_274 * a0_376;
	word32 a0_37;
	word32 a1_1308;
	word32 s5_1314;
	word32 s7_1316;
	word32 s6_1315;
	word32 s9_1318;
	word32 s0_1306;
	word32 s1_1307;
	word32 a5_1310;
	word32 s2_1311;
	word32 a4_1309;
	word32 s3_1312;
	word32 s4_1313;
	word32 s8_1317;
	word32 s11_1320;
	word32 s10_1319;
	Eq_2 a3_236;
	Eq_2 ra_242 = bt_mesh_adv_create(ra, 0x0A, 0x00, a5, s5, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, dwArg1C, dwArg28, dwArg68, dwArg88, dwArgB8, out s0_1306, out s1_1307, out a0_37, out a1_1308, out a3_236, out a4_1309, out a5_1310, out s2_1311, out s3_1312, out s4_1313, out s5_1314, out s6_1315, out s7_1316, out s8_1317, out s9_1318, out s10_1319, out s11_1320, out mstatus);
	if (a0_37 == 0x00)
	{
		a0_376 = (struct Eq_274 *) &g_t230B7934;
		goto l2303D040;
	}
	Eq_2 a1_132;
	Eq_2 a5_68;
	bt_mesh_prov_get(out a5_68);
	word32 a5_1367;
	Eq_2 a4_74 = net_buf_simple_add_u8(a0_37 + 8, 0x00, a5_68, out a5_1367);
	Eq_2 s0_76 = null;
	word32 a2_1369;
	word32 a4_1371;
	word32 a3_1370;
	word32 a1_1368;
	struct Eq_194075 * a5_116;
	net_buf_simple_add_mem(a0_37 + 8, 0x00, 0x10, a4_74, out a1_1368, out a2_1369, out a3_1370, out a4_1371, out a5_116);
	Eq_2 s3_93 = *((word32) s0_76 + 4);
	if (s3_93 != 0x00)
	{
		word32 a4_1375;
		word32 a5_1376;
		word32 a1_1372;
		word32 a2_1373;
		word32 a3_1374;
		dwArg1C = strlen(s3_93, out a1_1372, out a2_1373, out a3_1374, out a4_1375, out a5_1376);
		dwArg28.u0 = 0x00;
		word32 s4_1381;
		word32 s5_1382;
		word32 s8_1383;
		word32 a3_1378;
		word32 s3_1380;
		word32 a4_1379;
		word32 a2_1377;
		if (bt_mesh_aes_cmac(ra_242, fp + -64, out a2_1377, out a3_1378, out a4_1379, out a5_116, out s3_1380, out s4_1381, out s5_1382, out s8_1383) == 0x00)
		{
			a1_132 = (word32) *((word32) s0_76 + 8) | 2;
l2303D092:
			struct Eq_197680 * a5_143;
			Eq_2 a4_142;
			net_buf_simple_add_be16(a0_37 + 8, a1_132, a5_116, out a4_142, out a5_143);
			Eq_2 s0_145 = a5_143->t0004;
			if (a5_143 != null)
			{
				word32 a3_1403;
				word32 a5_1404;
				word32 a1_1401;
				word32 a2_1402;
				net_buf_simple_add_mem(a0_37 + 8, fp + -80, 0x04, a4_142, out a1_1401, out a2_1402, out a3_1403, out a4_142, out a5_1404);
			}
			Eq_2 a1_182;
			Eq_2 a4_185;
			word32 s6_1389;
			word32 s8_1390;
			word32 s2_1386;
			word32 s3_1387;
			word32 s5_1388;
			word32 a3_1384;
			word32 a5_1385;
			Eq_2 s1_189 = bt_mesh_adv_send(ra_242, s0_145, 0x00, 0x00, a4_142, mstatus, dwArg78, dwArgB8, dwArgF8, out a1_182, out a3_1384, out a4_185, out a5_1385, out s2_1386, out s3_1387, out s5_1388, out s6_1389, out s8_1390);
			Eq_2 a5_209;
			Eq_2 s5_219;
			word32 s3_1397;
			word32 s8_1400;
			word32 s6_1399;
			word32 s4_1398;
			word32 s0_1391;
			word32 s1_1392;
			word32 a1_1394;
			word32 a2_1395;
			word32 s2_1396;
			word32 a0_1393;
			Eq_2 ra_213 = net_buf_unref(ra_242, s1_189, s1_189, a1_182, a4_185, mstatus, dwLoc70, dwLoc6C, dwLoc68, s6, dwArg08, dwArg14, dwArg28, s7, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_1391, out s1_1392, out a0_1393, out a1_1394, out a2_1395, out a3, out a4, out a5_209, out s2_1396, out s3_1397, out s4_1398, out s5_219, out s6_1399, out s8_1400, out mstatus);
			if (a5_209 == 0x00)
				goto l2303CEEC;
			Eq_2 a0_233;
			word32 a4_1408;
			word32 s8_1416;
			word32 s11_1419;
			word32 s10_1418;
			word32 s9_1417;
			word32 a5_1409;
			word32 s2_1410;
			word32 s3_1411;
			word32 s5_1413;
			word32 s6_1414;
			word32 s7_1415;
			word32 s4_1412;
			word32 s1_1406;
			word32 a1_1407;
			word32 s0_1405;
			ra_242 = bt_mesh_adv_create(ra_213, 0x0A, 0x00, a5_209, s5_219, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg14, dwArg1C, dwArg28, dwArg68, dwArg88, dwArgB8, out s0_1405, out s1_1406, out a0_233, out a1_1407, out a3_236, out a4_1408, out a5_1409, out s2_1410, out s3_1411, out s4_1412, out s5_1413, out s6_1414, out s7_1415, out s8_1416, out s9_1417, out s10_1418, out s11_1419, out mstatus);
			if (a0_233 != 0x00)
			{
				Eq_2 a4_300;
				Eq_2 a1_297;
				Eq_2 s1_304;
				Eq_2 a3_266;
				Eq_2 a1_269;
				word32 a5_1422;
				word32 a2_1420;
				word32 a4_1421;
				Eq_2 a0_265 = strlen(a0_233, out a1_269, out a2_1420, out a3_266, out a4_1421, out a5_1422);
				Eq_2 a4_274;
				if (net_buf_simple_tailroom((word32) a0_233 + 8, out a4_274) < a0_265)
				{
					word32 s10_1464;
					word32 s11_1465;
					word32 t4_1466;
					word32 s4_1458;
					word32 s7_1461;
					word32 s8_1462;
					word32 s9_1463;
					word32 s6_1460;
					word32 s5_1459;
					word32 a0_1451;
					word32 a2_1452;
					word32 a3_1453;
					word32 a7_1455;
					word32 s2_1456;
					word32 s3_1457;
					word32 a5_1454;
					ra_242 = printf(ra_242, &g_t230B7978, a3_266, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_304, out a0_1451, out a1_297, out a2_1452, out a3_1453, out a4_300, out a5_1454, out a7_1455, out s2_1456, out s3_1457, out s4_1458, out s5_1459, out s6_1460, out s7_1461, out s8_1462, out s9_1463, out s10_1464, out s11_1465, out t4_1466);
				}
				else
				{
					Eq_2 s0_277 = *((word32) a1_269 + 4);
					Eq_2 a4_283;
					word32 a2_1441;
					word32 a3_1442;
					word32 a5_1443;
					word32 a1_1440;
					net_buf_simple_add_mem((word32) a0_233 + 8, a1_269, a0_265, a4_274, out a1_1440, out a2_1441, out a3_1442, out a4_283, out a5_1443);
					word32 s8_1450;
					word32 a3_1444;
					word32 s3_1447;
					word32 s5_1448;
					word32 s6_1449;
					word32 s2_1446;
					word32 a5_1445;
					s1_304 = bt_mesh_adv_send(ra_242, s0_277, 0x00, 0x00, a4_283, mstatus, dwArg78, dwArgB8, dwArgF8, out a1_297, out a3_1444, out a4_300, out a5_1445, out s2_1446, out s3_1447, out s5_1448, out s6_1449, out s8_1450);
				}
				word32 s8_1478;
				word32 s5_1476;
				word32 s6_1477;
				word32 s2_1473;
				word32 s3_1474;
				word32 s4_1475;
				word32 a2_1471;
				word32 a5_1472;
				word32 s1_1468;
				word32 a0_1469;
				word32 a1_1470;
				word32 s0_1467;
				net_buf_unref(ra_242, s1_304, s1_304, a1_297, a4_300, mstatus, dwLoc70, dwLoc6C, dwLoc68, s6, dwArg08, a0_265, dwArg28, s7, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_1467, out s1_1468, out a0_1469, out a1_1470, out a2_1471, out a3, out a4, out a5_1472, out s2_1473, out s3_1474, out s4_1475, out s5_1476, out s6_1477, out s8_1478, out mstatus);
				goto l2303CEEC;
			}
			a0_376 = (struct Eq_274 *) &g_t230B7958;
l2303D040:
			word32 s9_1436;
			word32 s10_1437;
			word32 s11_1438;
			word32 t4_1439;
			word32 s3_1430;
			word32 s6_1433;
			word32 s7_1434;
			word32 s8_1435;
			word32 s5_1432;
			word32 s4_1431;
			word32 s1_1423;
			word32 a0_1424;
			word32 a1_1425;
			word32 a5_1427;
			word32 a7_1428;
			word32 s2_1429;
			word32 a2_1426;
			printf(ra_242, a0_376, a3_236, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_1423, out a0_1424, out a1_1425, out a2_1426, out a3, out a4, out a5_1427, out a7_1428, out s2_1429, out s3_1430, out s4_1431, out s5_1432, out s6_1433, out s7_1434, out s8_1435, out s9_1436, out s10_1437, out s11_1438, out t4_1439);
			goto l2303CEEC;
		}
	}
	a1_132 = (word32) *((word32) s0_76 + 8);
	goto l2303D092;
}

// 2303D11A: Register Eq_2 bt_mesh_beacon_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_mesh_init
Eq_2 bt_mesh_beacon_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a3_16;
	ptr32 a4_17;
	ptr32 a5_18;
	word32 a0_34;
	word32 s2_35;
	word32 s3_36;
	word32 s4_37;
	word32 s5_38;
	k_delayed_work_init(ra, s0, 0x42014334, a3, a4, mstatus, dwArg94, dwArgC8, dwArgE8, dwArg0128, out a0_34, out a3_16, out a4_17, out a5_18, out s2_35, out s3_36, out s4_37, out s5_38);
	a4Out = a4_17;
	a5Out = a5_18;
	return a3_16;
}

