pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303D12E: Register Eq_2 bt_mesh_beacon_ivu_initiator(Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out (ptr32 Eq_2) s3Out, Register out (ptr32 Eq_186720) s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      blemesh_iv_update
//      bt_mesh_beacon_recv
//      ivu_refresh
//      bt_mesh_next_seq
//      ctl_recv
Eq_2 bt_mesh_beacon_ivu_initiator(Eq_2 s0, word32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, ptr32 & s2Out, union Eq_2 & s3Out, struct Eq_186720 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	if (a0 == 0x00)
	{
		Eq_2 a3_17;
		Eq_2 a4_18;
		struct Eq_186720 * s4_21;
		ptr32 s8_22;
		word32 a0_151;
		word32 a1_152;
		word32 a2_153;
		word32 a5_154;
		Eq_2 s1_20 = atomic_and(s0, ~0x08, a3, a4, mstatus, out a0_151, out a1_152, out a2_153, out a3_17, out a4_18, out a5_154, out s4_21, out s8_22);
		word32 a5_155;
		Eq_2 a0_24 = bt_mesh_beacon_get(out a5_155);
		if (a0_24 != 0x00)
		{
			s1Out = s1_20;
			a0Out = a0_24;
			a3Out = a3_17;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4_21;
			s5Out = s5;
			s6Out = s6;
			s8Out = s8_22;
			return s0;
		}
		else
		{
			Eq_2 a0_32;
			Eq_2 a3_34;
			ptr32 s2_38;
			union Eq_2 * s3_43;
			struct Eq_186720 * s4_44;
			ptr32 s5_45;
			ptr32 s6_46;
			ptr32 s8_47;
			word32 a1_165;
			word32 a2_166;
			word32 a4_167;
			word32 a5_168;
			s1Out = k_delayed_work_cancel(0x42014334, a3_17, a4_18, mstatus, dwArg34, dwArg38, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out a0_32, out a1_165, out a2_166, out a3_34, out a4_167, out a5_168, out s2_38, out s3_43, out s4_44, out s5_45, out s6_46, out s8_47);
			a0Out = a0_32;
			a3Out = a3_34;
			s2Out = s2_38;
			s3Out = s3_43;
			s4Out = s4_44;
			s5Out = s5_45;
			s6Out = s6_46;
			s8Out = s8_47;
			return s0;
		}
	}
	else
	{
		Eq_2 a3_59;
		Eq_2 a4_60;
		word32 a0_156;
		word32 a1_157;
		word32 a2_158;
		word32 a5_159;
		word32 s4_160;
		word32 s8_161;
		atomic_or(s0, 0x08, a3, a4, mstatus, out a0_156, out a1_157, out a2_158, out a3_59, out a4_60, out a5_159, out s4_160, out s8_161);
		Eq_2 a0_70;
		Eq_2 a3_73;
		Eq_2 s1_79;
		ptr32 s2_80;
		union Eq_2 * s3_81;
		struct Eq_186720 * s4_82;
		ptr32 s5_83;
		ptr32 s6_84;
		ptr32 s8_85;
		word32 a1_162;
		word32 a4_163;
		word32 a5_164;
		Eq_2 s0_78 = k_work_submit(0x42014334, a3_59, a4_60, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_79, out a0_70, out a1_162, out a3_73, out a4_163, out a5_164, out s2_80, out s3_81, out s4_82, out s5_83, out s6_84, out s8_85);
		s1Out = s1_79;
		a0Out = a0_70;
		a3Out = a3_73;
		s2Out = s2_80;
		s3Out = s3_81;
		s4Out = s4_82;
		s5Out = s5_83;
		s6Out = s6_84;
		s8Out = s8_85;
		return s0_78;
	}
}

// 2303D178: Register Eq_2 bt_mesh_beacon_recv(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_196012 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_196017 s6Out, Register out Eq_196018 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_scan_cb
//      proxy_complete_pdu
Eq_2 bt_mesh_beacon_recv(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_196012 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_196017 & s6Out, union Eq_196018 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 a0_105;
	Eq_196012 a5_108;
	Eq_2 s5_115;
	struct Eq_274 * a0_358;
	byte bLoc21_446 = SLICE(s4, byte, 24);
	Eq_2 a5_19 = (word32) *((word32) a0 + 4);
	if (a5_19 == 0x00)
	{
		a0_358 = (struct Eq_274 *) &g_t230B79A0;
		goto l2303D196;
	}
	word32 a2_838;
	word32 a1_837;
	a0_105 = net_buf_simple_pull_u8(a5_19, out a1_837, out a2_838, out a5_108);
	s5_115 = s5;
	if (a0_105 == 0x00)
		goto l2303D21E;
	struct Eq_274 * a0_28;
	if (a0_105 != 0x01)
	{
		a0_28 = (struct Eq_274 *) &g_t230B79D8;
		goto l2303D1BE;
	}
	if ((word32) *((word32) a0 + 4) <= 0x14)
	{
		a0_28 = (struct Eq_274 *) &g_t230B79B4;
l2303D1BE:
		word32 a1_840;
		word32 s1_839;
		word32 a2_841;
		word32 a7_842;
		word32 s4_843;
		word32 s8_844;
		word32 s11_845;
		word32 t4_846;
		ra = printf(ra, a0_28, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_839, out a0_105, out a1_840, out a2_841, out a3, out a4, out a5_108, out a7_842, out s2, out s3, out s4_843, out s5_115, out s6, out s7, out s8_844, out s9, out s10, out s11_845, out t4_846);
		goto l2303D21E;
	}
	Eq_2 s0_133;
	s2 = *a0;
	if ((word32) g_w4200D8DC != 0x0FFFFFFF)
	{
		word32 a5_849;
		word32 a1_847;
		word32 a2_848;
		if (memcmp(1107351750, s2, 0x15, out a1_847, out a2_848, out a3, out a4, out a5_849) == 0x00)
		{
			s0_133.u0 = 0x4200D8C0;
			s5_115 = s5;
			goto l2303D2FA;
		}
	}
	Eq_2 a5_54 = 0x0FFFFFFF;
	if ((word32) g_w4200D9C0 != 0x0FFFFFFF)
	{
		word32 a2_851;
		word32 a1_850;
		if (memcmp(0x4200D9AA, s2, 0x15, out a1_850, out a2_851, out a3, out a4, out a5_54) == 0x00)
		{
			s0_133.u0 = 0x4200D9A4;
			s5_115 = s5;
			goto l2303D2FA;
		}
	}
	word32 a2_853;
	word32 a5_854;
	word32 a1_852;
	net_buf_simple_pull_u8(a5_54, out a1_852, out a2_853, out a5_854);
	Eq_2 a4_83;
	word32 a1_855;
	word32 a5_856;
	Eq_2 a0_81 = net_buf_simple_pull_mem(a0, 0x08, out a1_855, out a4_83, out a5_856);
	word32 a5_858;
	word32 a1_857;
	net_buf_simple_pull_be32(a4_83, out a1_857, out a5_858);
	Eq_2 s4_114;
	ra = bt_mesh_subnet_find(ra, a0_81, s2, s0, dwArg2C, dwArg78, out a0_105, out a3, out a4, out a5_108, out s2, out s3, out s4_114, out s5_115, out s6, out s7, out s9, out s10);
	s0_133 = a0_105;
	if (a0_105 == 0x00)
		goto l2303D21E;
	if ((word32) *((word32) a0_105 + 31) == 0x02 && (word32) bLoc21_446 == 0x00)
	{
		a0_358 = (struct Eq_274 *) &g_t230B7394;
l2303D196:
		word32 a7_871;
		word32 s8_873;
		word32 s11_874;
		word32 t4_875;
		word32 s4_872;
		word32 a1_869;
		word32 a2_870;
		word32 s1_868;
		ra = printf(ra, a0_358, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_868, out a0_105, out a1_869, out a2_870, out a3, out a4, out a5_108, out a7_871, out s2, out s3, out s4_872, out s5_115, out s6, out s7, out s8_873, out s9, out s10, out s11_874, out t4_875);
l2303D21E:
		0x00 = (int8) dwArg0128;
		a0Out = a0_105;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_108;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg78;
		s5Out = s5_115;
		s6Out = s6;
		s7Out = s7;
		s8Out = s5;
		s9Out = s9;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	word32 a6_865;
	word32 a7_866;
	word32 a1_860;
	word32 a2_861;
	word32 a3_862;
	word32 a4_863;
	word32 a5_864;
	memcpy((word32) a0_105 + 6, s4_114, 0x15, out a1_860, out a2_861, out a3_862, out a4_863, out a5_864, out a6_865, out a7_866);
	word32 a5_867;
	if (bt_mesh_subnet_get(0x00, out a3, out a4, out a5_867) != 0x00)
	{
		Eq_2 a5_161 = (word32) *((word32) a0_105 + 28);
		if (a5_161 != 0x00 && a5_161 < s3)
			goto l2303D2FA;
	}
	Eq_2 s1_172 = s2 >> 0x01 & 0x01;
	if ((atomic_get(0x4200D6C4) >> 3 & 0x01) != 0x00 && s1_172 == (atomic_get(0x4200D6C4) >> 2 & 0x01))
	{
		word32 s4_891;
		word32 s6_893;
		word32 s8_894;
		word32 s5_892;
		word32 a0_889;
		word32 s2_890;
		s0_133 = bt_mesh_beacon_ivu_initiator(a0_105, 0x00, a3, a4, mstatus, dwLoc2C, dwArg04, dwArg08, dwArg54, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgF8, dwArg0108, dwArg0148, out s1_172, out a0_889, out a3, out s2_890, out s3, out s4_891, out s5_892, out s6_893, out s8_894);
	}
	Eq_2 a0_304;
	ui32 s2_228;
	Eq_2 a3_231;
	word32 a0_256;
	Eq_2 s1_264;
	word32 s4_882;
	word32 s6_884;
	word32 s7_885;
	word32 s8_886;
	word32 s9_887;
	word32 s11_888;
	word32 s5_883;
	word32 a5_880;
	word32 s3_881;
	word32 a1_878;
	word32 a4_879;
	word32 s1_876;
	word32 a0_877;
	ra = bt_mesh_kr_update(bt_mesh_net_iv_update(ra, s0_133, s3, s1_172, a3, mstatus, s0, dwLoc18, dwLoc08, dwArg08, dwArg30, dwArg34, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s1_876, out a0_877, out a1_878, out a3_231, out a4_879, out a5_880, out s2_228, out s3_881, out s4_882, out s5_883, out s6_884, out s7_885, out s8_886, out s9_887, out s11_888), s0_133, s2_228 & 1, (word32) bLoc21_446, a3_231, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out s1_264, out a0_256, out a3, out a4, out s2, out s3, out s5_115, out s6, out s7, out s9, out s10);
	if (a0_256 != 0x00)
	{
		word32 a5_898;
		word32 s4_900;
		word32 s5_901;
		word32 s8_902;
		word32 s3_899;
		word32 a1_895;
		word32 a3_896;
		word32 a4_897;
		a0_304 = bt_mesh_net_beacon_update(ra, s0_133, out a1_895, out a3_896, out a4_897, out a5_898, out s3_899, out s4_900, out s5_901, out s8_902);
		if (s1_264 == 0x00)
			goto l2303D2F6;
	}
	else if (s1_264 == 0x00)
		goto l2303D2FA;
	a0_304.u0 = 0x00;
l2303D2F6:
	word32 s4_907;
	word32 s8_908;
	word32 s11_909;
	word32 a5_906;
	word32 s1_903;
	word32 a0_904;
	word32 a1_905;
	ra = bt_mesh_net_sec_update(ra, s1_264, a0_304, s2, mstatus, dwLoc28, s2, dwLoc18, dwLoc14, dwArg00, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, out s0_133, out s1_903, out a0_904, out a1_905, out a3, out a4, out a5_906, out s2, out s3, out s4_907, out s5_115, out s6, out s7, out s8_908, out s9, out s10, out s11_909, out mstatus);
l2303D2FA:
	word32 a5_859;
	a0_105 = bt_mesh_beacon_get(out a5_859);
	a5_108.u0 = 0x01;
	if (a0_105 == 0x01)
	{
		a5_108 = (word32) *((byte) s0_133.u0 + 5);
		a4.u0 = 0x00FF;
		if (a5_108 != 0x00FF)
		{
			*((byte) s0_133.u0 + 5) = (byte) ((word32) a5_108 + 1);
			a5_108 = (word32) a5_108 + 1;
		}
	}
	goto l2303D21E;
}

