pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303D326: Register Eq_2 bt_mesh_beacon_enable(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      beacon_set
//      bt_mesh_prov_enable
//      bt_mesh_net_start
Eq_2 bt_mesh_beacon_enable(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	if (bt_mesh_is_provisioned() != 0x00)
	{
		Eq_2 s0_15 = 0x4200D6BC;
		if ((word32) g_w4200D8DC != 0x0FFFFFFF)
		{
			g_t4200D8C4.u1 = 0x00;
			word32 s3_139;
			word32 s5_141;
			word32 s8_142;
			word32 s4_140;
			word32 a4_137;
			word32 a5_138;
			word32 a1_136;
			s0_15 = bt_mesh_net_beacon_update(ra, 0x4200D8C0, out a1_136, out a3, out a4_137, out a5_138, out s3_139, out s4_140, out s5_141, out s8_142);
		}
		a4 = (word32) *((word32) s0_15 + 772);
		if (a4 != 0x0FFFFFFF)
		{
			*((word32) s0_15 + 748) = 0x00;
			word32 a1_148;
			word32 a5_149;
			word32 s3_150;
			word32 s4_151;
			word32 s5_152;
			word32 s8_153;
			bt_mesh_net_beacon_update(ra, 0x4200D9A4, out a1_148, out a3, out a4, out a5_149, out s3_150, out s4_151, out s5_152, out s8_153);
		}
	}
	ptr32 a3_87;
	ptr32 a4_88;
	ptr32 a5_89;
	ptr32 s2_94;
	ptr32 s4_96;
	ptr32 s5_97;
	ptr32 s6_98;
	word32 s1_143;
	word32 a0_144;
	word32 a1_145;
	word32 s3_146;
	word32 s8_147;
	Eq_2 s0_92 = k_work_submit(0x42014334, a3, a4, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_143, out a0_144, out a1_145, out a3_87, out a4_88, out a5_89, out s2_94, out s3_146, out s4_96, out s5_97, out s6_98, out s8_147);
	a3Out = a3_87;
	a4Out = a4_88;
	a5Out = a5_89;
	s2Out = s2_94;
	s4Out = s4_96;
	s5Out = s5_97;
	s6Out = s6_98;
	return s0_92;
}

// 2303D388: Register Eq_2 bt_mesh_beacon_disable(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      beacon_set
//      bt_mesh_reset
//      bt_mesh_prov_disable
//      bt_mesh_net_start
Eq_2 bt_mesh_beacon_disable(Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0128, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	if ((atomic_get(0x4200D6C4) >> 3 & 0x01) != 0x00)
	{
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		return a3;
	}
	else
	{
		Eq_2 a3_22;
		Eq_2 a4_23;
		ptr32 a5_24;
		ptr32 s2_26;
		ptr32 s3_31;
		ptr32 s4_32;
		ptr32 s5_33;
		ptr32 s6_34;
		word32 a0_98;
		word32 a1_99;
		word32 a2_100;
		word32 s8_101;
		k_delayed_work_cancel(0x42014334, a3, a4, mstatus, dwArg34, dwArg38, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out a0_98, out a1_99, out a2_100, out a3_22, out a4_23, out a5_24, out s2_26, out s3_31, out s4_32, out s5_33, out s6_34, out s8_101);
		a4Out = a4_23;
		a5Out = a5_24;
		s2Out = s2_26;
		s3Out = s3_31;
		s4Out = s4_32;
		s5Out = s5_33;
		s6Out = s6_34;
		return a3_22;
	}
}

// 2303D3B4: void hb_pub_status(Register Eq_2 ra, Register (ptr32 Eq_198524) s1, Register word32 a1, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void hb_pub_status(Eq_2 ra, struct Eq_198524 * s1, word32 a1, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	Eq_2 a4_3 = 0x4200F000;
	if (a1 == 0x06)
	{
		word32 a1_216;
		word32 a2_217;
		Eq_2 a5_29;
		*s1->ptr0000 = (byte) net_buf_simple_pull_u8(s1->t0014, out a1_216, out a2_217, out a5_29);
		struct Eq_198565 * s2_31 = s1->ptr0004;
		if (s2_31 != null)
		{
			Eq_2 a5_37;
			word32 a1_237;
			word32 a2_238;
			s2_31->w0000 = (word16) net_buf_simple_pull_le16(a5_29, out a1_237, out a2_238, out a4_3, out a5_37);
			Eq_2 a5_44;
			word32 a1_239;
			word32 a2_240;
			s1->ptr0004->b0002 = (byte) net_buf_simple_pull_u8(a5_37, out a1_239, out a2_240, out a5_44);
			Eq_2 a5_51;
			word32 a1_241;
			word32 a2_242;
			s1->ptr0004->b0003 = (byte) net_buf_simple_pull_u8(a5_44, out a1_241, out a2_242, out a5_51);
			Eq_2 a5_58;
			word32 a1_243;
			word32 a2_244;
			s1->ptr0004->b0004 = (byte) net_buf_simple_pull_u8(a5_51, out a1_243, out a2_244, out a5_58);
			Eq_2 a5_64;
			word32 a1_245;
			word32 a2_246;
			*((word32) a5_64 + 6) = (word16) net_buf_simple_pull_u8(a5_58, out a1_245, out a2_246, out a5_64);
			word32 a1_247;
			word32 a2_248;
			*((word32) a5_29 + 8) = (word16) net_buf_simple_pull_u8(a5_64, out a1_247, out a2_248, out a5_29);
		}
		int32 a0_76 = g_dw4200F428;
		word32 s0_249;
		word32 s1_250;
		word32 a0_251;
		word32 a1_252;
		word32 a2_253;
		word32 a3_254;
		word32 a4_255;
		word32 a5_256;
		word32 s2_257;
		word32 s3_258;
		word32 s4_259;
		word32 s5_260;
		word32 s6_261;
		word32 s7_262;
		word32 s8_263;
		word32 s9_264;
		word32 s10_265;
		word32 s11_266;
		k_sem_give(ra, a0_76 + 0x04, 0x06, a4_3, a5_29, mstatus, dwArg14, dwArg18, dwArg60, s3, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_249, out s1_250, out a0_251, out a1_252, out a2_253, out a3_254, out a4_255, out a5_256, out s2_257, out s3_258, out s4_259, out s5_260, out s6_261, out s7_262, out s8_263, out s9_264, out s10_265, out s11_266);
	}
	else
	{
		word32 s1_218;
		word32 a0_219;
		word32 a1_220;
		word32 a2_221;
		word32 a3_222;
		word32 a4_223;
		word32 a5_224;
		word32 a7_225;
		word32 s2_226;
		word32 s3_227;
		word32 s4_228;
		word32 s5_229;
		word32 s6_230;
		word32 s7_231;
		word32 s8_232;
		word32 s9_233;
		word32 s10_234;
		word32 s11_235;
		word32 t4_236;
		printf(ra, &g_t230B7B18, 0x06, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_218, out a0_219, out a1_220, out a2_221, out a3_222, out a4_223, out a5_224, out a7_225, out s2_226, out s3_227, out s4_228, out s5_229, out s6_230, out s7_231, out s8_232, out s9_233, out s10_234, out s11_235, out t4_236);
	}
}

// 2303D45C: void hb_sub_status(Register Eq_2 ra, Register (ptr32 Eq_198774) s1, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void hb_sub_status(Eq_2 ra, struct Eq_198774 * s1, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	if (a3 == 0x0800003C)
	{
		Eq_2 a5_29;
		word32 a1_199;
		word32 a2_200;
		*s1->ptr0000 = (byte) net_buf_simple_pull_u8(0x0800003C, out a1_199, out a2_200, out a5_29);
		Eq_2 a5_37;
		word32 a1_201;
		word32 a2_202;
		word32 a4_203;
		s1->ptr0004->w0000 = (word16) net_buf_simple_pull_le16(a5_29, out a1_201, out a2_202, out a4_203, out a5_37);
		Eq_2 a4_44;
		Eq_2 a5_45;
		word32 a1_204;
		word32 a2_205;
		s1->ptr0004->w0002 = (word16) net_buf_simple_pull_le16(a5_37, out a1_204, out a2_205, out a4_44, out a5_45);
		Eq_2 a5_52;
		word32 a1_206;
		word32 a2_207;
		s1->ptr0004->b0004 = (byte) net_buf_simple_pull_u8(a5_45, out a1_206, out a2_207, out a5_52);
		Eq_2 a5_59;
		word32 a1_208;
		word32 a2_209;
		s1->ptr0004->b0005 = (byte) net_buf_simple_pull_u8(a5_52, out a1_208, out a2_209, out a5_59);
		Eq_2 a5_66;
		word32 a1_210;
		word32 a2_211;
		s1->ptr0004->b0006 = (byte) net_buf_simple_pull_u8(a5_59, out a1_210, out a2_211, out a5_66);
		Eq_2 a5_73;
		word32 a1_212;
		word32 a2_213;
		s1->ptr0004->b0007 = (byte) net_buf_simple_pull_u8(a5_66, out a1_212, out a2_213, out a5_73);
		int32 a0_76 = g_dw4200F428;
		word32 s0_233;
		word32 s1_234;
		word32 a0_235;
		word32 a1_236;
		word32 a2_237;
		word32 a3_238;
		word32 a4_239;
		word32 a5_240;
		word32 s2_241;
		word32 s3_242;
		word32 s4_243;
		word32 s5_244;
		word32 s6_245;
		word32 s7_246;
		word32 s8_247;
		word32 s9_248;
		word32 s10_249;
		word32 s11_250;
		k_sem_give(ra, a0_76 + 0x04, a3, a4_44, a5_73, mstatus, dwArg14, dwArg18, dwArg60, s3, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_233, out s1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240, out s2_241, out s3_242, out s4_243, out s5_244, out s6_245, out s7_246, out s8_247, out s9_248, out s10_249, out s11_250);
	}
	else
	{
		word32 s1_214;
		word32 a0_215;
		word32 a1_216;
		word32 a2_217;
		word32 a3_218;
		word32 a4_219;
		word32 a5_220;
		word32 a7_221;
		word32 s2_222;
		word32 s3_223;
		word32 s4_224;
		word32 s5_225;
		word32 s6_226;
		word32 s7_227;
		word32 s8_228;
		word32 s9_229;
		word32 s10_230;
		word32 s11_231;
		word32 t4_232;
		printf(ra, &g_t230B7B4C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_214, out a0_215, out a1_216, out a2_217, out a3_218, out a4_219, out a5_220, out a7_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231, out t4_232);
	}
}

// 2303D512: void mod_pub_status(Register Eq_2 ra, Register (ptr32 Eq_198990) s1, Register (ptr32 Eq_198991) a2, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void mod_pub_status(Eq_2 ra, struct Eq_198990 * s1, struct Eq_198991 * a2, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	struct Eq_274 * a0_207;
	if (a3 != 0x08000019)
	{
		a0_207 = (struct Eq_274 *) &g_t230B7BD4;
		goto l2303D538;
	}
	ui32 a4_33;
	Eq_2 a5_32;
	ui32 a1_23 = (word32) s1->w0002;
	struct Eq_199020 * a4_26 = (word32) a2->w0004;
	if (a1_23 != 0x0FFFFFFF)
	{
		if (a4_26 <= (struct Eq_199020 *) 0x0D)
		{
			a0_207 = (struct Eq_274 *) &g_t230B7BFC;
			goto l2303D538;
		}
		a4_33 = (word32) *((word32) a3 + 11) << 8 | (word32) (*((word32) a3 + 0x0A));
		a5_32 = (word32) *((word32) a3 + 0x0D) << 8 | (word32) (*((word32) a3 + 0x0C));
	}
	else
	{
		if (a4_26 > (struct Eq_199020 *) 0x0C)
		{
			a0_207 = (struct Eq_274 *) &g_t230B7C28;
			goto l2303D538;
		}
		a5_32 = (word32) a4_26->b000B << 8 | (word32) a4_26->b000A;
		a4_33 = a1_23;
	}
	a3 = (word32) s1->w0000;
	if (a3 == a5_32 && a1_23 == a4_33)
	{
		word32 a2_411;
		word32 a1_410;
		Eq_2 a5_58;
		Eq_2 a0_55 = net_buf_simple_pull_u8(a5_32, out a1_410, out a2_411, out a5_58);
		word32 a1_412;
		word32 a5_414;
		word32 a2_413;
		Eq_2 a4_143;
		Eq_2 a0_61 = net_buf_simple_pull_le16(a5_58, out a1_412, out a2_413, out a4_143, out a5_414);
		Eq_2 a5_119 = (word32) s1->w0004;
		if (a5_119 == a0_61)
		{
			struct Eq_199135 * s1_68 = *((word32) a5_119 + 8);
			if (a5_119 != 0x00)
				*a5_119 = (byte) a0_55;
			struct Eq_199187 * s3_72 = s1_68->ptr000C;
			if (s3_72 != null)
			{
				Eq_2 a5_80;
				word32 a1_434;
				word32 a2_435;
				word32 a4_436;
				s3_72->w0000 = (word16) net_buf_simple_pull_le16(a5_119, out a1_434, out a2_435, out a4_436, out a5_80);
				word32 a1_437;
				word32 a2_438;
				word32 a5_439;
				s1_68->ptr000C->w0002 = (word16) net_buf_simple_pull_le16(a5_80, out a1_437, out a2_438, out a4_143, out a5_439);
				*((word32) a4_143 + 4) = (byte) ((word32) *((word32) a4_143 + 2) >> 0x0C & 0x01);
				struct Eq_199242 * s1_96 = *((word32) a4_143 + 0x0C);
				Eq_2 a5_99 = (word32) (word12) (word32) *((word32) a4_143 + 2);
				((word32) a4_143 + 2)->u2 = (word16) a5_99;
				Eq_2 a5_105;
				word32 a1_440;
				word32 a2_441;
				s1_96->ptr000C->b0005 = (byte) net_buf_simple_pull_u8(a5_99, out a1_440, out a2_441, out a5_105);
				Eq_2 a5_112;
				word32 a1_442;
				word32 a2_443;
				s1_96->ptr000C->b0006 = (byte) net_buf_simple_pull_u8(a5_105, out a1_442, out a2_443, out a5_112);
				word32 a1_444;
				word32 a2_445;
				s1_96->ptr000C->b0007 = (byte) net_buf_simple_pull_u8(a5_112, out a1_444, out a2_445, out a5_119);
			}
			int32 a0_125 = g_dw4200F428;
			word32 s0_446;
			word32 s1_447;
			word32 a0_448;
			word32 a1_449;
			word32 a2_450;
			word32 a3_451;
			word32 a4_452;
			word32 a5_453;
			word32 s2_454;
			word32 s3_455;
			word32 s4_456;
			word32 s5_457;
			word32 s6_458;
			word32 s7_459;
			word32 s8_460;
			word32 s9_461;
			word32 s10_462;
			word32 s11_463;
			k_sem_give(ra, a0_125 + 0x04, a3, a4_143, a5_119, mstatus, dwArg14, dwArg18, dwArg60, s3, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_446, out s1_447, out a0_448, out a1_449, out a2_450, out a3_451, out a4_452, out a5_453, out s2_454, out s3_455, out s4_456, out s5_457, out s6_458, out s7_459, out s8_460, out s9_461, out s10_462, out s11_463);
			return;
		}
		else
		{
			word32 s1_415;
			word32 a2_418;
			word32 a0_416;
			word32 a1_417;
			word32 a3_419;
			word32 a4_420;
			word32 a5_421;
			word32 s2_423;
			word32 s3_424;
			word32 a7_422;
			word32 s6_427;
			word32 s4_425;
			word32 s5_426;
			word32 s7_428;
			word32 s8_429;
			word32 s9_430;
			word32 s10_431;
			word32 s11_432;
			word32 t4_433;
			printf(ra, &g_t230B7C84, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_415, out a0_416, out a1_417, out a2_418, out a3_419, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432, out t4_433);
			return;
		}
	}
	a0_207 = (struct Eq_274 *) &g_t230B7C58;
l2303D538:
	word32 s10_407;
	word32 s11_408;
	word32 t4_409;
	word32 a0_392;
	word32 a1_393;
	word32 s9_406;
	word32 s1_391;
	word32 a3_395;
	word32 a4_396;
	word32 s2_399;
	word32 a2_394;
	word32 a5_397;
	word32 a7_398;
	word32 s4_401;
	word32 s5_402;
	word32 s3_400;
	word32 s8_405;
	word32 s6_403;
	word32 s7_404;
	printf(ra, a0_207, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_391, out a0_392, out a1_393, out a2_394, out a3_395, out a4_396, out a5_397, out a7_398, out s2_399, out s3_400, out s4_401, out s5_402, out s6_403, out s7_404, out s8_405, out s9_406, out s10_407, out s11_408, out t4_409);
}

// 2303D674: void relay_status(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void relay_status(Eq_2 ra, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	Eq_2 a4_18 = *((word32) a3 + 16);
	if (a3 == 0x08000028)
	{
		struct Eq_199366 * s2_21 = *((word32) a4_18 + 20);
		Eq_2 a5_29;
		word32 a1_162;
		word32 a2_163;
		*s2_21->ptr0000 = (byte) net_buf_simple_pull_u8(0x08000028, out a1_162, out a2_163, out a5_29);
		byte * s2_31 = s2_21->ptr0004;
		Eq_2 a5_36;
		word32 a1_164;
		word32 a2_165;
		Eq_2 a0_33 = net_buf_simple_pull_u8(a5_29, out a1_164, out a2_165, out a5_36);
		*s2_31 = (byte) a0_33;
		word32 s0_185;
		word32 s1_186;
		word32 a0_187;
		word32 a1_188;
		word32 a2_189;
		word32 a3_190;
		word32 a4_191;
		word32 a5_192;
		word32 s2_193;
		word32 s3_194;
		word32 s4_195;
		word32 s5_196;
		word32 s6_197;
		word32 s7_198;
		word32 s8_199;
		word32 s9_200;
		word32 s10_201;
		word32 s11_202;
		k_sem_give(ra, (word32) a0_33 + 4, a3, a4_18, a5_36, mstatus, dwArg14, dwArg18, dwArg60, s3, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_185, out s1_186, out a0_187, out a1_188, out a2_189, out a3_190, out a4_191, out a5_192, out s2_193, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202);
	}
	else
	{
		word32 s1_166;
		word32 a0_167;
		word32 a1_168;
		word32 a2_169;
		word32 a3_170;
		word32 a4_171;
		word32 a5_172;
		word32 a7_173;
		word32 s2_174;
		word32 s3_175;
		word32 s4_176;
		word32 s5_177;
		word32 s6_178;
		word32 s7_179;
		word32 s8_180;
		word32 s9_181;
		word32 s10_182;
		word32 s11_183;
		word32 t4_184;
		printf(ra, &g_t230B7D70, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_166, out a0_167, out a1_168, out a2_169, out a3_170, out a4_171, out a5_172, out a7_173, out s2_174, out s3_175, out s4_176, out s5_177, out s6_178, out s7_179, out s8_180, out s9_181, out s10_182, out s11_183, out t4_184);
	}
}

// 2303D6E4: Register word32 key_idx_unpack(Register (ptr32 word16) a1, Register (ptr32 word16) a2, Register Eq_2 a3, Register (ptr32 Eq_199488) a4, Register out ptr32 a5Out)
// Called from:
//      app_key_status
//      net_key_status
word32 key_idx_unpack(word16 * a1, word16 * a2, Eq_2 a3, struct Eq_199488 * a4, ptr32 & a5Out)
{
	*a1 = (word16) (word32) (word12) ((word32) *((word32) a3 + 1) << 8 | (word32) (*a3));
	Eq_2 a0_15 = a4->t0000;
	*a2 = (word16) (((word32) a4->b0002 << 8 | (word32) a4->b0001) >> 4);
	ptr32 a5_26;
	word32 a1_28;
	word32 a0_24 = net_buf_simple_pull(a0_15, 0x03, out a1_28, out a5_26);
	a5Out = a5_26;
	return a0_24;
}

// 2303D714: void app_key_status(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 a3, Register (ptr32 Eq_199488) a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void app_key_status(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 a3, struct Eq_199488 * a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_274 * a0_83;
	uint16 wLoc14_128 = (uint16) s0;
	uint16 wLoc12_129 = SLICE(s0, uint16, 16);
	if (a4 != (struct Eq_199488 *) 0x08000003)
		a0_83 = (struct Eq_274 *) &g_t230B79F8;
	else
	{
		word32 a1_224;
		word32 a2_225;
		word32 a5_226;
		Eq_2 a0_22 = net_buf_simple_pull_u8(0x08000003, out a1_224, out a2_225, out a5_226);
		struct Eq_199572 * a5_35;
		key_idx_unpack(fp + ~0x13, fp + ~0x11, a3, a4, out a5_35);
		word32 a0_38 = a5_35->dw0014;
		a3 = (word32) a5_35->w0004;
		if (a3 == (word32) wLoc14_128)
		{
			a3 = (word32) a5_35->w0006;
			Eq_2 a4_41 = (word32) wLoc12_129;
			if (a3 == a4_41)
			{
				Eq_2 a5_42 = a5_35->t0000;
				if (a5_42 != 0x00)
					*a5_42 = (byte) a0_22;
				word32 s0_246;
				word32 s1_247;
				word32 a0_248;
				word32 a1_249;
				word32 a2_250;
				word32 a3_251;
				word32 a4_252;
				word32 a5_253;
				word32 s2_254;
				word32 s3_255;
				word32 s4_256;
				word32 s5_257;
				word32 s6_258;
				word32 s7_259;
				word32 s8_260;
				word32 s9_261;
				word32 s10_262;
				word32 s11_263;
				k_sem_give(ra, a0_38 + 0x04, a3, a4_41, a5_42, mstatus, dwLoc0C, dwLoc08, dwArg40, dwArg44, s1, dwArg74, dwArg8C, dwArgE8, dwArg0128, dwArg0168, out s0_246, out s1_247, out a0_248, out a1_249, out a2_250, out a3_251, out a4_252, out a5_253, out s2_254, out s3_255, out s4_256, out s5_257, out s6_258, out s7_259, out s8_260, out s9_261, out s10_262, out s11_263);
				return;
			}
		}
		a0_83 = (struct Eq_274 *) &g_t230B7A1C;
	}
	word32 s1_227;
	word32 a1_229;
	word32 a0_228;
	word32 a3_231;
	word32 a2_230;
	word32 a4_232;
	word32 a5_233;
	word32 a7_234;
	word32 s2_235;
	word32 s3_236;
	word32 s4_237;
	word32 s5_238;
	word32 s6_239;
	word32 s7_240;
	word32 s8_241;
	word32 s9_242;
	word32 s10_243;
	word32 s11_244;
	word32 t4_245;
	printf(ra, a0_83, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_227, out a0_228, out a1_229, out a2_230, out a3_231, out a4_232, out a5_233, out a7_234, out s2_235, out s3_236, out s4_237, out s5_238, out s6_239, out s7_240, out s8_241, out s9_242, out s10_243, out s11_244, out t4_245);
}

