pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303D796: void net_key_status(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 a3, Register (ptr32 Eq_199488) a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void net_key_status(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 a3, struct Eq_199488 * a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_274 * a0_81;
	uint16 wLoc14_122 = (uint16) s0;
	if (a4 != (struct Eq_199488 *) 0x08000044)
		a0_81 = (struct Eq_274 *) &g_t230B7D20;
	else
	{
		word32 a5_204;
		word32 a2_203;
		word32 a1_202;
		Eq_2 a0_22 = net_buf_simple_pull_u8(0x08000044, out a1_202, out a2_203, out a5_204);
		struct Eq_199727 * a5_35;
		key_idx_unpack(fp + ~0x13, fp + ~0x11, a3, a4, out a5_35);
		Eq_2 a4_37 = (word32) wLoc14_122;
		word32 a0_38 = a5_35->dw0014;
		a3 = (word32) a5_35->w0004;
		if (a3 == a4_37)
		{
			Eq_2 a5_40 = a5_35->t0000;
			if (a5_40 != 0x00)
				*a5_40 = (byte) a0_22;
			word32 s0_224;
			word32 s1_225;
			word32 a0_226;
			word32 a1_227;
			word32 a2_228;
			word32 a3_229;
			word32 a4_230;
			word32 a5_231;
			word32 s2_232;
			word32 s3_233;
			word32 s4_234;
			word32 s5_235;
			word32 s6_236;
			word32 s7_237;
			word32 s8_238;
			word32 s9_239;
			word32 s10_240;
			word32 s11_241;
			k_sem_give(ra, a0_38 + 0x04, a3, a4_37, a5_40, mstatus, dwLoc0C, dwLoc08, dwArg40, dwArg44, s1, dwArg74, dwArg8C, dwArgE8, dwArg0128, dwArg0168, out s0_224, out s1_225, out a0_226, out a1_227, out a2_228, out a3_229, out a4_230, out a5_231, out s2_232, out s3_233, out s4_234, out s5_235, out s6_236, out s7_237, out s8_238, out s9_239, out s10_240, out s11_241);
			return;
		}
		a0_81 = (struct Eq_274 *) &g_t230B7D44;
	}
	word32 s1_205;
	word32 a0_206;
	word32 a1_207;
	word32 a2_208;
	word32 a3_209;
	word32 a4_210;
	word32 a5_211;
	word32 a7_212;
	word32 s2_213;
	word32 s3_214;
	word32 s4_215;
	word32 s5_216;
	word32 s6_217;
	word32 s7_218;
	word32 s8_219;
	word32 s9_220;
	word32 s10_221;
	word32 s11_222;
	word32 t4_223;
	printf(ra, a0_81, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_205, out a0_206, out a1_207, out a2_208, out a3_209, out a4_210, out a5_211, out a7_212, out s2_213, out s3_214, out s4_215, out s5_216, out s6_217, out s7_218, out s8_219, out s9_220, out s10_221, out s11_222, out t4_223);
}

// 2303D80E: void comp_data_status(Register Eq_2 ra, Register (ptr32 Eq_199842) a1, Register (ptr32 Eq_199843) a2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void comp_data_status(Eq_2 ra, struct Eq_199842 * a1, struct Eq_199843 * a2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	struct Eq_199861 * a4_8 = a1->ptr0010;
	if (a1 == (struct Eq_199842 *) 0x02)
	{
		struct Eq_199867 * s2_20 = a4_8->ptr0014;
		Eq_2 a1_27;
		word32 a2_199;
		word32 a5_200;
		*s2_20->ptr0000 = (byte) net_buf_simple_pull_u8(0x4200F000, out a1_27, out a2_199, out a5_200);
		Eq_2 a4_33;
		Eq_2 a0_32 = net_buf_simple_tailroom(s2_20->t0004, out a4_33);
		Eq_2 a2_35 = (word32) a2->w0004;
		if (a0_32 < a2_35)
			a2_35 = net_buf_simple_tailroom(s2_20->t0004, out a4_33);
		Eq_2 a3_51;
		Eq_2 a4_52;
		Eq_2 a5_53;
		word32 a1_220;
		word32 a2_221;
		Eq_2 a0_48 = net_buf_simple_add_mem(s2_20->t0004, a1_27, a2_35, a4_33, out a1_220, out a2_221, out a3_51, out a4_52, out a5_53);
		word32 s0_222;
		word32 s1_223;
		word32 a0_224;
		word32 a1_225;
		word32 a2_226;
		word32 a3_227;
		word32 a4_228;
		word32 a5_229;
		word32 s2_230;
		word32 s3_231;
		word32 s4_232;
		word32 s5_233;
		word32 s6_234;
		word32 s7_235;
		word32 s8_236;
		word32 s9_237;
		word32 s10_238;
		word32 s11_239;
		k_sem_give(ra, (word32) a0_48 + 4, a3_51, a4_52, a5_53, mstatus, dwArg14, dwArg18, dwArg60, s3, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_222, out s1_223, out a0_224, out a1_225, out a2_226, out a3_227, out a4_228, out a5_229, out s2_230, out s3_231, out s4_232, out s5_233, out s6_234, out s7_235, out s8_236, out s9_237, out s10_238, out s11_239);
	}
	else
	{
		word32 s1_201;
		word32 a0_202;
		word32 a1_203;
		word32 a2_204;
		word32 a3_205;
		word32 a4_206;
		word32 a5_207;
		word32 a7_208;
		word32 s2_209;
		word32 s3_210;
		word32 s4_211;
		word32 s5_212;
		word32 s6_213;
		word32 s7_214;
		word32 s8_215;
		word32 s9_216;
		word32 s10_217;
		word32 s11_218;
		word32 t4_219;
		printf(ra, &g_t230B7AF0, 0x02, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_201, out a0_202, out a1_203, out a2_204, out a3_205, out a4_206, out a5_207, out a7_208, out s2_209, out s3_210, out s4_211, out s5_212, out s6_213, out s7_214, out s8_215, out s9_216, out s10_217, out s11_218, out t4_219);
	}
}

// 2303D886: void mod_sub_status(Register Eq_2 ra, Register (ptr32 Eq_200006) a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void mod_sub_status(Eq_2 ra, struct Eq_200006 * a2, Eq_2 a3, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	struct Eq_274 * a0_159;
	if (a3 != 0x0800001F)
	{
		a0_159 = (struct Eq_274 *) &g_t230B7CB8;
		goto l2303D8A0;
	}
	Eq_2 s1_51;
	Eq_2 a5_32;
	word32 a1_357;
	word32 a2_358;
	Eq_2 a0_29 = net_buf_simple_pull_u8(0x0800001F, out a1_357, out a2_358, out a5_32);
	Eq_2 a5_39;
	word32 a2_360;
	word32 a1_359;
	word32 a4_361;
	Eq_2 a0_35 = net_buf_simple_pull_le16(a5_32, out a1_359, out a2_360, out a4_361, out a5_39);
	word32 a1_362;
	word32 a4_364;
	word32 a2_363;
	word32 a5_365;
	Eq_2 a0_42 = net_buf_simple_pull_le16(a5_39, out a1_362, out a2_363, out a4_364, out a5_365);
	Eq_2 a5_48 = 0x03;
	if ((word32) a2->w0004 > 0x03)
	{
		word32 a1_385;
		word32 a2_386;
		word32 a4_387;
		s1_51 = net_buf_simple_pull_le16(0x03, out a1_385, out a2_386, out a4_387, out a5_48);
	}
	else
		s1_51.u0 = 0x0FFFFFFF;
	struct Eq_200122 * a5_66;
	word32 a4_390;
	word32 a2_389;
	word32 a1_388;
	Eq_2 a0_62 = net_buf_simple_pull_le16(a5_48, out a1_388, out a2_389, out a4_390, out a5_66);
	Eq_2 a4_70 = a5_66->t0014;
	a3 = (word32) a5_66->w0004;
	if (a3 == a0_35)
	{
		a3 = (word32) a5_66->w0010;
		if (a3 != a0_62)
			goto l2303D914;
		struct Eq_200129 * a5_74 = *((word32) a3 + 0x0C);
		if (a3 == 0x00)
		{
l2303D90C:
			a3 = (word32) a5_74->w0012;
			if (a3 == s1_51)
			{
				union Eq_2 * a5_82 = *((word32) a3 + 8);
				if (a3 != 0x00)
					a3->u2 = (word16) a0_42;
				Eq_2 a5_87 = *a5_82;
				if (a5_87 != 0x00)
					*a5_87 = (byte) a0_29;
				word32 s0_391;
				word32 a2_395;
				word32 a1_394;
				word32 a0_393;
				word32 s1_392;
				word32 a4_397;
				word32 a5_398;
				word32 s2_399;
				word32 s5_402;
				word32 s6_403;
				word32 a3_396;
				word32 s3_400;
				word32 s4_401;
				word32 s7_404;
				word32 s8_405;
				word32 s9_406;
				word32 s10_407;
				word32 s11_408;
				k_sem_give(ra, (word32) a4_70 + 4, a3, a4_70, a5_87, mstatus, dwArg14, dwArg18, s5, s3, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_391, out s1_392, out a0_393, out a1_394, out a2_395, out a3_396, out a4_397, out a5_398, out s2_399, out s3_400, out s4_401, out s5_402, out s6_403, out s7_404, out s8_405, out s9_406, out s10_407, out s11_408);
				return;
			}
			goto l2303D914;
		}
		a3 = (word32) *a3;
		if (a3 == a0_42)
			goto l2303D90C;
	}
l2303D914:
	a0_159 = (struct Eq_274 *) &g_t230B7CE8;
l2303D8A0:
	word32 t4_384;
	word32 s8_380;
	word32 s9_381;
	word32 s10_382;
	word32 s11_383;
	word32 s4_376;
	word32 s5_377;
	word32 s6_378;
	word32 s7_379;
	word32 a5_372;
	word32 a7_373;
	word32 s2_374;
	word32 s3_375;
	word32 a2_369;
	word32 a3_370;
	word32 a4_371;
	word32 s1_366;
	word32 a1_368;
	word32 a0_367;
	printf(ra, a0_159, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_366, out a0_367, out a1_368, out a2_369, out a3_370, out a4_371, out a5_372, out a7_373, out s2_374, out s3_375, out s4_376, out s5_377, out s6_378, out s7_379, out s8_380, out s9_381, out s10_382, out s11_383, out t4_384);
}

// 2303D95C: void mod_app_status(Register Eq_2 ra, Register (ptr32 Eq_200224) a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void mod_app_status(Eq_2 ra, struct Eq_200224 * a2, Eq_2 a3, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	struct Eq_274 * a0_139;
	if (a3 != 0x0800003E)
		a0_139 = (struct Eq_274 *) &g_t230B7B80;
	else
	{
		Eq_2 s1_51;
		Eq_2 a5_32;
		word32 a2_298;
		word32 a1_297;
		Eq_2 a0_29 = net_buf_simple_pull_u8(0x0800003E, out a1_297, out a2_298, out a5_32);
		Eq_2 a5_39;
		word32 a1_299;
		word32 a4_301;
		word32 a2_300;
		Eq_2 a0_35 = net_buf_simple_pull_le16(a5_32, out a1_299, out a2_300, out a4_301, out a5_39);
		word32 a1_302;
		word32 a4_304;
		word32 a5_305;
		word32 a2_303;
		Eq_2 a0_42 = net_buf_simple_pull_le16(a5_39, out a1_302, out a2_303, out a4_304, out a5_305);
		Eq_2 a5_48 = 0x03;
		if ((word32) a2->w0004 > 0x03)
		{
			word32 a1_325;
			word32 a2_326;
			word32 a4_327;
			s1_51 = net_buf_simple_pull_le16(0x03, out a1_325, out a2_326, out a4_327, out a5_48);
		}
		else
			s1_51.u0 = 0x0FFFFFFF;
		struct Eq_200340 * a5_66;
		word32 a1_328;
		word32 a2_329;
		word32 a4_330;
		Eq_2 a0_62 = net_buf_simple_pull_le16(a5_48, out a1_328, out a2_329, out a4_330, out a5_66);
		Eq_2 a4_70 = a5_66->t0014;
		a3 = (word32) a5_66->w0004;
		if (a3 == a0_35)
		{
			a3 = (word32) a5_66->w0006;
			if (a3 == a0_42)
			{
				a3 = (word32) a5_66->w0008;
				if (a3 == a0_62)
				{
					a3 = (word32) a5_66->w000A;
					if (a3 == s1_51)
					{
						Eq_2 a5_78 = a5_66->t0000;
						if (a5_78 != 0x00)
							*a5_78 = (byte) a0_29;
						word32 s0_331;
						word32 s1_332;
						word32 a0_333;
						word32 a1_334;
						word32 a2_335;
						word32 a3_336;
						word32 a4_337;
						word32 a5_338;
						word32 s2_339;
						word32 s3_340;
						word32 s4_341;
						word32 s5_342;
						word32 s6_343;
						word32 s7_344;
						word32 s8_345;
						word32 s9_346;
						word32 s10_347;
						word32 s11_348;
						k_sem_give(ra, (word32) a4_70 + 4, a3, a4_70, a5_78, mstatus, dwArg14, dwArg18, s5, s3, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_331, out s1_332, out a0_333, out a1_334, out a2_335, out a3_336, out a4_337, out a5_338, out s2_339, out s3_340, out s4_341, out s5_342, out s6_343, out s7_344, out s8_345, out s9_346, out s10_347, out s11_348);
						return;
					}
				}
			}
		}
		a0_139 = (struct Eq_274 *) &g_t230B7BA8;
	}
	word32 a1_308;
	word32 a0_307;
	word32 a3_310;
	word32 a2_309;
	word32 a5_312;
	word32 s2_314;
	word32 a4_311;
	word32 a7_313;
	word32 s1_306;
	word32 s3_315;
	word32 s4_316;
	word32 s5_317;
	word32 s6_318;
	word32 s7_319;
	word32 s8_320;
	word32 s9_321;
	word32 s10_322;
	word32 s11_323;
	word32 t4_324;
	printf(ra, a0_139, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_306, out a0_307, out a1_308, out a2_309, out a3_310, out a4_311, out a5_312, out a7_313, out s2_314, out s3_315, out s4_316, out s5_317, out s6_318, out s7_319, out s8_320, out s9_321, out s10_322, out s11_323, out t4_324);
}

// 2303DA28: void state_status_u8.isra.2(Register Eq_2 ra, Register Eq_2 s1, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
// Called from:
//      gatt_proxy_status
//      friend_status
//      ttl_status
//      beacon_status
void state_status_u8.isra.2(Eq_2 ra, Eq_2 s1, word32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	if (a1 == a1)
	{
		Eq_2 a5_20;
		word32 a1_157;
		word32 a2_158;
		Eq_2 a0_17 = net_buf_simple_pull_u8(*((word32) s1 + 20), out a1_157, out a2_158, out a5_20);
		*s1 = (byte) a0_17;
		word32 s0_159;
		word32 s1_160;
		word32 a0_161;
		word32 a1_162;
		word32 a2_163;
		word32 a3_164;
		word32 a4_165;
		word32 a5_166;
		word32 s2_167;
		word32 s3_168;
		word32 s4_169;
		word32 s5_170;
		word32 s6_171;
		word32 s7_172;
		word32 s8_173;
		word32 s9_174;
		word32 s10_175;
		word32 s11_176;
		k_sem_give(ra, (word32) a0_17 + 4, a3, a4, a5_20, mstatus, dwArg14, dwArg18, dwArg60, dwArg64, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_159, out s1_160, out a0_161, out a1_162, out a2_163, out a3_164, out a4_165, out a5_166, out s2_167, out s3_168, out s4_169, out s5_170, out s6_171, out s7_172, out s8_173, out s9_174, out s10_175, out s11_176);
	}
	else
	{
		word32 s1_138;
		word32 a0_139;
		word32 a1_140;
		word32 a2_141;
		word32 a3_142;
		word32 a4_143;
		word32 a5_144;
		word32 a7_145;
		word32 s2_146;
		word32 s3_147;
		word32 s4_148;
		word32 s5_149;
		word32 s6_150;
		word32 s7_151;
		word32 s8_152;
		word32 s9_153;
		word32 s10_154;
		word32 s11_155;
		word32 t4_156;
		printf(ra, &g_t230B7D94, a3, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_138, out a0_139, out a1_140, out a2_141, out a3_142, out a4_143, out a5_144, out a7_145, out s2_146, out s3_147, out s4_148, out s5_149, out s6_150, out s7_151, out s8_152, out s9_153, out s10_154, out s11_155, out t4_156);
	}
}

