pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303DA70: void gatt_proxy_status(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void gatt_proxy_status(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	state_status_u8.isra.2(ra, s1, 0x08000014, a3, a4, mstatus, dwArg08, dwArg14, dwArg18, dwArg28, dwArg60, dwArg64, dwArg88, dwArg94, dwArg98, dwArgAC, dwArgBC, dwArg0108, dwArg0148, dwArg0188);
}

// 2303DA7A: void friend_status(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void friend_status(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	state_status_u8.isra.2(ra, s1, 0x08000011, a3, a4, mstatus, dwArg08, dwArg14, dwArg18, dwArg28, dwArg60, dwArg64, dwArg88, dwArg94, dwArg98, dwArgAC, dwArgBC, dwArg0108, dwArg0148, dwArg0188);
}

// 2303DA84: void ttl_status(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void ttl_status(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	state_status_u8.isra.2(ra, s1, 0x0800000E, a3, a4, mstatus, dwArg08, dwArg14, dwArg18, dwArg28, dwArg60, dwArg64, dwArg88, dwArg94, dwArg98, dwArgAC, dwArgBC, dwArg0108, dwArg0148, dwArg0188);
}

// 2303DA8E: void beacon_status(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void beacon_status(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	state_status_u8.isra.2(ra, s1, 0x0800000B, a3, a4, mstatus, dwArg08, dwArg14, dwArg18, dwArg28, dwArg60, dwArg64, dwArg88, dwArg94, dwArg98, dwArgAC, dwArgBC, dwArg0108, dwArg0148, dwArg0188);
}

// 2303DA98: Register Eq_2 app_key_is_valid(Register Eq_2 a0, Register out ptr32 a1Out)
// Called from:
//      mod_app_unbind
//      mod_app_bind
//      _mod_unbind
Eq_2 app_key_is_valid(Eq_2 a0, ptr32 & a1Out)
{
	Eq_2 a0_13;
	ptr32 a1_6 = (word32) g_w4200D870;
	if (a1_6 != 0x0FFFFFFF)
	{
		a0_13.u0 = 0x01;
		if ((word32) g_w4200D872 == a0)
		{
l2303DAD6:
			a1Out = a1_6;
			return a0_13;
		}
	}
	a0_13.u0 = 0x00;
	if ((word32) g_w4200D898 != 0x0FFFFFFF)
		a0_13 = (word32) ((word32) g_w4200D89A - a0 < 1);
	goto l2303DAD6;
}

// 2303DAD8: Register Eq_2 key_idx_pack(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2)
// Called from:
//      net_key_get
//      app_key_get
//      app_key_update
//      app_key_add
//      app_key_del
Eq_2 key_idx_pack(Eq_2 a0, Eq_2 a1, Eq_2 a2)
{
	Eq_2 a5_20;
	word32 a4_36;
	net_buf_simple_add_le16(a0, (word32) (word16) (a1 | a2 << 0x0C), a2 << 0x0C, out a4_36, out a5_20);
	Eq_2 a1_26 = a2 >> 4 & 0x00FF;
	word32 a5_37;
	net_buf_simple_add_u8(a0, a1_26, a5_20, out a5_37);
	return a0;
}

// 2303DB04: void send_krp_status(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
// Called from:
//      krp_get
//      krp_set
void send_krp_status(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	Eq_2 a4_32;
	Eq_2 a5_33;
	word32 a2_197;
	word32 a1_196;
	Eq_2 s1_34 = bt_mesh_model_msg_init(0x08000017, fp + -40, out a1_196, out a2_197, out a4_32, out a5_33);
	Eq_2 a5_41;
	net_buf_simple_add_u8(fp + -28, a4_32, a5_33, out a5_41);
	Eq_2 a5_48;
	word32 a4_198;
	net_buf_simple_add_le16(fp + -28, a2, a5_41, out a4_198, out a5_48);
	word32 a5_199;
	net_buf_simple_add_u8(fp + -28, a3, a5_48, out a5_199);
	word32 a0_67;
	Eq_2 a3_70;
	word32 a2_202;
	word32 s1_201;
	word32 s0_200;
	word32 a4_203;
	word32 a5_204;
	word32 mstatus_205;
	Eq_2 ra_76 = bt_mesh_model_send(ra, dwArg64, s1_34, dwArg64, s1_34, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc28, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s0_200, out s1_201, out a0_67, out a2_202, out a3_70, out a4_203, out a5_204, out mstatus_205);
	if (a0_67 != 0x00)
	{
		word32 s1_206;
		word32 a0_207;
		word32 a1_208;
		word32 a2_209;
		word32 a3_210;
		word32 a4_211;
		word32 a5_212;
		word32 a7_213;
		word32 s2_214;
		word32 s3_215;
		word32 s4_216;
		word32 s5_217;
		word32 s6_218;
		word32 s7_219;
		word32 s8_220;
		word32 s9_221;
		word32 s10_222;
		word32 s11_223;
		word32 t4_224;
		printf(ra_76, &g_t230B8798, a3_70, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_206, out a0_207, out a1_208, out a2_209, out a3_210, out a4_211, out a5_212, out a7_213, out s2_214, out s3_215, out s4_216, out s5_217, out s6_218, out s7_219, out s8_220, out s9_221, out s10_222, out s11_223, out t4_224);
	}
}

// 2303DB72: void send_friend_status(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128)
// Called from:
//      friend_get
//      friend_set
void send_friend_status(Eq_2 ra, Eq_2 a0, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, Eq_2 dwArg0128)
{
	Eq_2 s2_14 = *((word32) a0 + 24);
	Eq_2 a5_30;
	word32 a4_179;
	word32 a2_178;
	word32 a1_177;
	Eq_2 s1_31 = bt_mesh_model_msg_init(0x08000011, fp + -36, out a1_177, out a2_178, out a4_179, out a5_30);
	word32 a5_180;
	net_buf_simple_add_u8(fp + -28, (word32) *((word32) s2_14 + 9), a5_30, out a5_180);
	word32 a0_49;
	Eq_2 a3_52;
	word32 s0_181;
	word32 s1_182;
	word32 a2_183;
	word32 a4_184;
	word32 a5_185;
	word32 mstatus_186;
	Eq_2 ra_58 = bt_mesh_model_send(ra, a0, s1_31, a0, s1_31, fp + -28, 0x00, s2_14, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_181, out s1_182, out a0_49, out a2_183, out a3_52, out a4_184, out a5_185, out mstatus_186);
	if (a0_49 != 0x00)
	{
		word32 s1_187;
		word32 a0_188;
		word32 a1_189;
		word32 a2_190;
		word32 a3_191;
		word32 a4_192;
		word32 a5_193;
		word32 a7_194;
		word32 s2_195;
		word32 s3_196;
		word32 s4_197;
		word32 s5_198;
		word32 s6_199;
		word32 s7_200;
		word32 s8_201;
		word32 s9_202;
		word32 s10_203;
		word32 s11_204;
		word32 t4_205;
		printf(ra_58, &g_t230B8754, a3_52, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_187, out a0_188, out a1_189, out a2_190, out a3_191, out a4_192, out a5_193, out a7_194, out s2_195, out s3_196, out s4_197, out s5_198, out s6_199, out s7_200, out s8_201, out s9_202, out s10_203, out s11_204, out t4_205);
	}
	0x00 = (int8) dwArg0128;
}

// 2303DBCE: void friend_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128)
void friend_get(Eq_2 ra, Eq_2 a0, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, Eq_2 dwArg0128)
{
	send_friend_status(ra, a0, s4, s6, s7, s9, s11, mstatus, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, dwArg0128);
}

