pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303DBD2: void net_key_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void net_key_get(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	word32 a1_279;
	word32 a2_280;
	word32 a4_281;
	word32 a5_282;
	Eq_2 s1_28 = bt_mesh_model_msg_init(0x08000043, fp + -40, out a1_279, out a2_280, out a4_281, out a5_282);
	Eq_2 s0_18 = a0;
	Eq_2 a2_32 = (word32) g_w4200D9C0;
	Eq_2 a1_33 = (word32) g_w4200D8DC;
	if (a2_32 != 0x0FFFFFFF)
	{
		if (a1_33 != 0x0FFFFFFF)
		{
			s0_18 = key_idx_pack(fp + -28, a1_33, a2_32);
l2303DC1A:
			word32 a0_90;
			Eq_2 a3_93;
			word32 mstatus_309;
			word32 a4_307;
			word32 a5_308;
			word32 s1_305;
			word32 a2_306;
			word32 s0_304;
			Eq_2 ra_99 = bt_mesh_model_send(ra, s0_18, s1_28, s0_18, s1_28, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -40, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_304, out s1_305, out a0_90, out a2_306, out a3_93, out a4_307, out a5_308, out mstatus_309);
			if (a0_90 != 0x00)
			{
				word32 t4_303;
				word32 s10_301;
				word32 s11_302;
				word32 s8_299;
				word32 s9_300;
				word32 s6_297;
				word32 s7_298;
				word32 s4_295;
				word32 s5_296;
				word32 s2_293;
				word32 s3_294;
				word32 a5_291;
				word32 a7_292;
				word32 a3_289;
				word32 a4_290;
				word32 a1_287;
				word32 a2_288;
				word32 s1_285;
				word32 a0_286;
				printf(ra_99, &g_t230B85F4, a3_93, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_285, out a0_286, out a1_287, out a2_288, out a3_289, out a4_290, out a5_291, out a7_292, out s2_293, out s3_294, out s4_295, out s5_296, out s6_297, out s7_298, out s8_299, out s9_300, out s10_301, out s11_302, out t4_303);
			}
			return;
		}
	}
	else
	{
		if (a1_33 == a2_32)
			goto l2303DC1A;
		a2_32 = a1_33;
	}
	word32 a5_284;
	word32 a4_283;
	net_buf_simple_add_le16(fp + -28, a2_32, 0x0FFFFFFF, out a4_283, out a5_284);
	goto l2303DC1A;
}

// 2303DC50: void send_net_key_status(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
// Called from:
//      net_key_update
//      net_key_add
//      net_key_del
void send_net_key_status(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	Eq_2 a5_31;
	word32 a4_188;
	word32 a2_187;
	word32 a1_186;
	Eq_2 s1_32 = bt_mesh_model_msg_init(0x08000044, fp + -40, out a1_186, out a2_187, out a4_188, out a5_31);
	Eq_2 a5_39;
	net_buf_simple_add_u8(fp + -28, a3, a5_31, out a5_39);
	word32 a5_190;
	word32 a4_189;
	net_buf_simple_add_le16(fp + -28, a2, a5_39, out a4_189, out a5_190);
	word32 a0_59;
	Eq_2 a3_62;
	word32 s1_192;
	word32 s0_191;
	word32 a2_193;
	word32 a4_194;
	word32 a5_195;
	word32 mstatus_196;
	Eq_2 ra_68 = bt_mesh_model_send(ra, dwArg64, s1_32, dwArg64, s1_32, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc28, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s0_191, out s1_192, out a0_59, out a2_193, out a3_62, out a4_194, out a5_195, out mstatus_196);
	if (a0_59 != 0x00)
	{
		word32 s1_197;
		word32 a0_198;
		word32 a1_199;
		word32 a2_200;
		word32 a3_201;
		word32 a4_202;
		word32 a5_203;
		word32 a7_204;
		word32 s2_205;
		word32 s3_206;
		word32 s4_207;
		word32 s5_208;
		word32 s6_209;
		word32 s7_210;
		word32 s8_211;
		word32 s9_212;
		word32 s10_213;
		word32 s11_214;
		word32 t4_215;
		printf(ra_68, &g_t230B881C, a3_62, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_197, out a0_198, out a1_199, out a2_200, out a3_201, out a4_202, out a5_203, out a7_204, out s2_205, out s3_206, out s4_207, out s5_208, out s6_209, out s7_210, out s8_211, out s9_212, out s10_213, out s11_214, out t4_215);
	}
}

// 2303DCB4: void krp_get(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
void krp_get(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a5, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	word32 a1_208;
	word32 a2_209;
	word32 a4_210;
	word32 a5_211;
	Eq_2 a0_15 = net_buf_simple_pull_le16(a5, out a1_208, out a2_209, out a4_210, out a5_211);
	if (a0_15 < 0x01000000)
	{
		Eq_2 a3_31;
		word32 a3_212;
		word32 a4_213;
		word32 a5_214;
		Eq_2 a0_24 = bt_mesh_subnet_get(a0_15, out a3_212, out a4_213, out a5_214);
		if (a0_24 == 0x00)
			a3_31.u0 = 0x00;
		else
			a3_31 = (word32) *((word32) a0_24 + 31);
		send_krp_status(ra, dwArg44, s1, a0_15, a3_31, s2, s4, s6, s7, s9, s11, mstatus, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, a0_15, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114);
	}
	else
	{
		word32 s1_215;
		word32 a0_216;
		word32 a1_217;
		word32 a2_218;
		word32 a3_219;
		word32 a4_220;
		word32 a5_221;
		word32 a7_222;
		word32 s2_223;
		word32 s3_224;
		word32 s4_225;
		word32 s5_226;
		word32 s6_227;
		word32 s7_228;
		word32 s8_229;
		word32 s9_230;
		word32 s10_231;
		word32 s11_232;
		word32 t4_233;
		printf(ra, &g_t230B83E8, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_215, out a0_216, out a1_217, out a2_218, out a3_219, out a4_220, out a5_221, out a7_222, out s2_223, out s3_224, out s4_225, out s5_226, out s6_227, out s7_228, out s8_229, out s9_230, out s10_231, out s11_232, out t4_233);
	}
}

// 2303DD06: void node_identity_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
void node_identity_get(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	word32 a5_291;
	word32 a4_290;
	word32 a2_289;
	word32 a1_288;
	Eq_2 a0_26 = net_buf_simple_pull_le16(fp + -56, out a1_288, out a2_289, out a4_290, out a5_291);
	if (a0_26 >= 0x01000000)
	{
		word32 s1_298;
		word32 a0_299;
		word32 a1_300;
		word32 a2_301;
		word32 a3_302;
		word32 a4_303;
		word32 a5_304;
		word32 a7_305;
		word32 s2_306;
		word32 s3_307;
		word32 s4_308;
		word32 s5_309;
		word32 s6_310;
		word32 s7_311;
		word32 s8_312;
		word32 s9_313;
		word32 s10_314;
		word32 s11_315;
		word32 t4_316;
		printf(ra, &g_t230B83E8, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_298, out a0_299, out a1_300, out a2_301, out a3_302, out a4_303, out a5_304, out a7_305, out s2_306, out s3_307, out s4_308, out s5_309, out s6_310, out s7_311, out s8_312, out s9_313, out s10_314, out s11_315, out t4_316);
	}
	else
	{
		Eq_2 a5_53;
		word32 a5_295;
		word32 a4_294;
		word32 a2_293;
		word32 a1_292;
		bt_mesh_model_msg_init(0x08000048, 0x01000000, out a1_292, out a2_293, out a4_294, out a5_295);
		Eq_2 a5_46;
		word32 a3_296;
		word32 a4_297;
		Eq_2 a0_44 = bt_mesh_subnet_get(a0_26, out a3_296, out a4_297, out a5_46);
		Eq_2 s1_48 = a0_44;
		if (a0_44 == 0x00)
			net_buf_simple_add_u8(fp + -44, 0x04, a5_46, out a5_53);
		else
		{
			net_buf_simple_add_u8(fp + -44, 0x00, a5_46, out a5_53);
			s1_48 = (word32) *((word32) a0_44 + 32);
		}
		Eq_2 a5_68;
		word32 a4_336;
		net_buf_simple_add_le16(fp + -44, a0_26, a5_53, out a4_336, out a5_68);
		word32 a5_337;
		net_buf_simple_add_u8(fp + -44, s1_48, a5_68, out a5_337);
		word32 a0_96;
		Eq_2 a3_99;
		word32 s0_338;
		word32 s1_339;
		word32 a2_340;
		word32 a4_341;
		word32 a5_342;
		word32 mstatus_343;
		Eq_2 ra_105 = bt_mesh_model_send(ra, a0_26, s1_48, a0, a1, fp + -44, 0x00, a0, s4, s6, s7, s9, s11, mstatus, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg34, dwArg38, fp + -56, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s0_338, out s1_339, out a0_96, out a2_340, out a3_99, out a4_341, out a5_342, out mstatus_343);
		if (a0_96 != 0x00)
		{
			word32 s1_317;
			word32 a0_318;
			word32 a1_319;
			word32 a2_320;
			word32 a3_321;
			word32 a4_322;
			word32 a5_323;
			word32 a7_324;
			word32 s2_325;
			word32 s3_326;
			word32 s4_327;
			word32 s5_328;
			word32 s6_329;
			word32 s7_330;
			word32 s8_331;
			word32 s9_332;
			word32 s10_333;
			word32 s11_334;
			word32 t4_335;
			printf(ra_105, &g_t230B8670, a3_99, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_317, out a0_318, out a1_319, out a2_320, out a3_321, out a4_322, out a5_323, out a7_324, out s2_325, out s3_326, out s4_327, out s5_328, out s6_329, out s7_330, out s8_331, out s9_332, out s10_333, out s11_334, out t4_335);
		}
	}
}

// 2303DDA8: void app_key_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
void app_key_get(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	word32 a2_403;
	word32 a5_405;
	word32 a4_404;
	word32 a1_402;
	Eq_2 a0_26 = net_buf_simple_pull_le16(fp + -56, out a1_402, out a2_403, out a4_404, out a5_405);
	Eq_2 s0_111 = a0_26;
	if (a0_26 >= 0x01000000)
	{
		word32 s10_430;
		word32 t4_432;
		word32 s11_431;
		word32 s7_427;
		word32 s9_429;
		word32 s8_428;
		word32 s4_424;
		word32 s6_426;
		word32 s5_425;
		word32 a7_421;
		word32 s3_423;
		word32 s2_422;
		word32 a3_418;
		word32 a5_420;
		word32 a4_419;
		word32 a0_415;
		word32 a2_417;
		word32 a1_416;
		word32 s1_414;
		printf(ra, &g_t230B83E8, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_414, out a0_415, out a1_416, out a2_417, out a3_418, out a4_419, out a5_420, out a7_421, out s2_422, out s3_423, out s4_424, out s5_425, out s6_426, out s7_427, out s8_428, out s9_429, out s10_430, out s11_431, out t4_432);
		return;
	}
	word32 a5_409;
	word32 a1_406;
	word32 a4_408;
	word32 a2_407;
	bt_mesh_model_msg_init(0x08000002, 0x01000000, out a1_406, out a2_407, out a4_408, out a5_409);
	Eq_2 a5_46;
	word32 a4_411;
	word32 a3_410;
	ui32 s1_48 = (word32) (bt_mesh_subnet_get(a0_26, out a3_410, out a4_411, out a5_46) < 1);
	Eq_2 a5_54;
	net_buf_simple_add_u8(fp + -44, s1_48 << 2, a5_46, out a5_54);
	word32 a4_412;
	word32 a5_413;
	net_buf_simple_add_le16(fp + -44, a0_26, a5_54, out a4_412, out a5_413);
	if (s1_48 << 2 != 0x00)
	{
l2303DE4A:
		word32 a0_142;
		Eq_2 a3_145;
		word32 a4_436;
		word32 mstatus_438;
		word32 a5_437;
		word32 s0_433;
		word32 a2_435;
		word32 s1_434;
		Eq_2 ra_151 = bt_mesh_model_send(ra, s0_111, s1_48 << 2, a0, a1, fp + -44, 0x00, a0, s4, s6, s7, s9, s11, mstatus, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg34, dwArg38, fp + -56, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s0_433, out s1_434, out a0_142, out a2_435, out a3_145, out a4_436, out a5_437, out mstatus_438);
		if (a0_142 != 0x00)
		{
			word32 s11_456;
			word32 s9_454;
			word32 t4_457;
			word32 s10_455;
			word32 s6_451;
			word32 s8_453;
			word32 s7_452;
			word32 s3_448;
			word32 s5_450;
			word32 s4_449;
			word32 a5_445;
			word32 s2_447;
			word32 a7_446;
			word32 a2_442;
			word32 a4_444;
			word32 a3_443;
			word32 s1_439;
			word32 a1_441;
			word32 a0_440;
			printf(ra_151, &g_t230B7DBC, a3_145, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_439, out a0_440, out a1_441, out a2_442, out a3_443, out a4_444, out a5_445, out a7_446, out s2_447, out s3_448, out s4_449, out s5_450, out s6_451, out s7_452, out s8_453, out s9_454, out s10_455, out s11_456, out t4_457);
		}
	}
	else
	{
		Eq_2 a1_66;
		if ((word32) g_w4200D870 == a0_26)
			a1_66 = (word32) g_w4200D872;
		else
			a1_66.u0 = 0x0FFFFFFF;
		if ((word32) g_w4200D898 == a0_26)
		{
			Eq_2 a2_72 = (word32) g_w4200D89A;
			if (a1_66 != 0x0FFFFFFF)
			{
				s0_111 = key_idx_pack(fp + -44, a1_66, a2_72);
				goto l2303DE4A;
			}
			a1_66 = a2_72;
		}
		if (a1_66 != 0x0FFFFFFF)
		{
			word32 a5_459;
			word32 a4_458;
			net_buf_simple_add_le16(fp + -44, a1_66, 0x0FFFFFFF, out a4_458, out a5_459);
		}
		goto l2303DE4A;
	}
}

// 2303DE80: void hb_pub_send_status(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0104)
// Called from:
//      heartbeat_pub_get
//      heartbeat_pub_set
void hb_pub_send_status(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArg0104)
{
	Eq_2 a5_34;
	word32 a1_340;
	word32 a4_342;
	word32 a2_341;
	Eq_2 s1_35 = bt_mesh_model_msg_init(0x06, fp + -48, out a1_340, out a2_341, out a4_342, out a5_34);
	Eq_2 a5_42;
	Eq_2 a4_41 = net_buf_simple_add_u8(fp + -60, a2, a5_34, out a5_42);
	if (a3 != 0x00)
	{
		word32 a6_350;
		word32 a7_351;
		word32 a4_348;
		word32 a5_349;
		word32 a3_347;
		word32 a1_343;
		word32 a5_344;
		word32 a2_346;
		word32 a1_345;
		memcpy(net_buf_simple_add(fp + -60, 0x09, a4_41, out a1_343, out a5_344), a3, 0x09, out a1_345, out a2_346, out a3_347, out a4_348, out a5_349, out a6_350, out a7_351);
	}
	else
	{
		word32 a4_377;
		Eq_2 a5_48;
		net_buf_simple_add_le16(fp + -60, (word32) *((word32) s0 + 48), a5_42, out a4_377, out a5_48);
		word32 a0_49 = (word32) *((word32) s0 + 50);
		Eq_2 a1_50 = 0x00;
		if (a0_49 != 0x00)
		{
			a5_48.u0 = 0x01;
			a1_50.u0 = 0x01;
			if (a0_49 != 0x01)
			{
				a5_48.u0 = 0x0FFFFFFF;
				a1_50.u0 = 0x00FF;
				if (a0_49 != 0x0FFFFFFF)
				{
					word32 a4_378;
					a1_50 = 33 - __clzsi2(a0_49 + ~0x00, out a4_378, out a5_48) & 0x00FF;
				}
			}
		}
		Eq_2 a5_69;
		net_buf_simple_add_u8(fp + -60, a1_50, a5_48, out a5_69);
		Eq_2 a5_76;
		net_buf_simple_add_u8(fp + -60, (word32) *((word32) s0 + 52), a5_69, out a5_76);
		Eq_2 a5_81;
		net_buf_simple_add_u8(fp + -60, (word32) *((word32) s0 + 53), a5_76, out a5_81);
		Eq_2 a5_87;
		word32 a4_379;
		net_buf_simple_add_le16(fp + -60, (word32) *((word32) s0 + 54), a5_81, out a4_379, out a5_87);
		word32 a5_381;
		word32 a4_380;
		net_buf_simple_add_le16(fp + -60, (word32) *((word32) s0 + 56), a5_87, out a4_380, out a5_381);
	}
	word32 a0_148;
	Eq_2 a3_151;
	word32 a5_356;
	word32 mstatus_357;
	word32 a2_354;
	word32 a4_355;
	word32 s0_352;
	word32 s1_353;
	Eq_2 ra_157 = bt_mesh_model_send(ra, s0, s1_35, s1_35, a1, fp + -60, 0x00, a3, s4, s6, s7, s9, s11, mstatus, dwLoc38, dwLoc34, s2, s0, dwLoc28, dwLoc24, dwLoc1C, dwLoc08, dwLoc04, dwArg18, dwArg1C, dwArg24, dwArg28, fp + -48, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArg0104, out s0_352, out s1_353, out a0_148, out a2_354, out a3_151, out a4_355, out a5_356, out mstatus_357);
	if (a0_148 != 0x00)
	{
		word32 t4_376;
		word32 s10_374;
		word32 s11_375;
		word32 s8_372;
		word32 s9_373;
		word32 s6_370;
		word32 s7_371;
		word32 s4_368;
		word32 s5_369;
		word32 s2_366;
		word32 s3_367;
		word32 a5_364;
		word32 a7_365;
		word32 a3_362;
		word32 a4_363;
		word32 a1_360;
		word32 a2_361;
		word32 s1_358;
		word32 a0_359;
		printf(ra_157, &g_t230B82FC, a3_151, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_358, out a0_359, out a1_360, out a2_361, out a3_362, out a4_363, out a5_364, out a7_365, out s2_366, out s3_367, out s4_368, out s5_369, out s6_370, out s7_371, out s8_372, out s9_373, out s10_374, out s11_375, out t4_376);
	}
}

// 2303DF5A: void heartbeat_pub_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0104)
void heartbeat_pub_get(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArg0104)
{
	hb_pub_send_status(ra, s0, a1, 0x00, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArg0104);
}

