pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303DF62: void send_mod_sub_status(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register word32 a6, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
// Called from:
//      mod_sub_del
//      mod_sub_add
//      mod_sub_va_del
//      mod_sub_va_add
//      mod_sub_del_all
//      mod_sub_va_overwrite
//      mod_sub_overwrite
void send_mod_sub_status(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, word32 a6, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	Eq_2 a2_67;
	Eq_2 a0_64;
	Eq_2 a5_39;
	word32 a1_277;
	word32 a2_278;
	word32 a4_279;
	Eq_2 s1_40 = bt_mesh_model_msg_init(0x0800001F, fp + -32, out a1_277, out a2_278, out a4_279, out a5_39);
	Eq_2 a5_47;
	net_buf_simple_add_u8(fp + -44, a2, a5_39, out a5_47);
	Eq_2 a4_53;
	Eq_2 a5_54;
	net_buf_simple_add_le16(fp + -44, a3, a5_47, out a4_53, out a5_54);
	Eq_2 a4_60;
	word32 a5_280;
	net_buf_simple_add_le16(fp + -44, a4_53, a5_54, out a4_60, out a5_280);
	0x00 = (int8) dwLoc38;
	if (a6 != 0x00)
	{
		word32 a5_284;
		word32 a1_283;
		a0_64 = net_buf_simple_add(fp + -44, 0x04, a4_60, out a1_283, out a5_284);
		a2_67.u0 = 0x04;
	}
	else
	{
		word32 a1_281;
		word32 a5_282;
		a0_64 = net_buf_simple_add(fp + -44, 0x02, a4_60, out a1_281, out a5_282);
		a2_67.u0 = 0x02;
	}
	word32 a1_304;
	word32 a2_305;
	word32 a3_306;
	word32 a4_307;
	word32 a5_308;
	word32 a6_309;
	word32 a7_310;
	memcpy(a0_64, dwArg64, a2_67, out a1_304, out a2_305, out a3_306, out a4_307, out a5_308, out a6_309, out a7_310);
	word32 a0_113;
	Eq_2 a3_116;
	word32 s0_311;
	word32 s1_312;
	word32 a2_313;
	word32 a4_314;
	word32 a5_315;
	word32 mstatus_316;
	Eq_2 ra_122 = bt_mesh_model_send(ra, dwArg64, s1_40, s1_40, a1, fp + -44, 0x00, a1, s4, s6, s7, s9, s11, mstatus, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg34, dwArg38, fp + -32, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s0_311, out s1_312, out a0_113, out a2_313, out a3_116, out a4_314, out a5_315, out mstatus_316);
	if (a0_113 != 0x00)
	{
		word32 s3_294;
		word32 s2_293;
		word32 a7_292;
		word32 a5_291;
		word32 a4_290;
		word32 a3_289;
		word32 a2_288;
		word32 a1_287;
		word32 a0_286;
		word32 s1_285;
		word32 s4_295;
		word32 s5_296;
		word32 s6_297;
		word32 s7_298;
		word32 s8_299;
		word32 s9_300;
		word32 s10_301;
		word32 s11_302;
		word32 t4_303;
		printf(ra_122, &g_t230B87F0, a3_116, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_285, out a0_286, out a1_287, out a2_288, out a3_289, out a4_290, out a5_291, out a7_292, out s2_293, out s3_294, out s4_295, out s5_296, out s6_297, out s7_298, out s8_299, out s9_300, out s10_301, out s11_302, out t4_303);
	}
}

// 2303DFFA: void krp_set(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114, Stack word32 dwArg0128)
void krp_set(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a5, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114, word32 dwArg0128)
{
	Eq_2 a5_26;
	word32 a1_460;
	word32 a2_461;
	word32 a4_462;
	Eq_2 a0_22 = net_buf_simple_pull_le16(a5, out a1_460, out a2_461, out a4_462, out a5_26);
	Eq_2 s1_163 = a0_22;
	word32 a5_465;
	word32 a2_464;
	word32 a1_463;
	Eq_2 a0_30 = net_buf_simple_pull_u8(a5_26, out a1_463, out a2_464, out a5_465);
	if (a0_22 >= 0x01000000)
	{
		0x00 = dwArg0128;
		word32 s11_486;
		word32 t4_487;
		word32 s7_482;
		word32 s8_483;
		word32 s10_485;
		word32 s9_484;
		word32 s3_478;
		word32 s4_479;
		word32 s6_481;
		word32 s5_480;
		word32 a4_474;
		word32 a5_475;
		word32 s2_477;
		word32 a7_476;
		word32 a0_470;
		word32 a1_471;
		word32 a3_473;
		word32 a2_472;
		word32 s1_469;
		printf(ra, &g_t230B83E8, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_469, out a0_470, out a1_471, out a2_472, out a3_473, out a4_474, out a5_475, out a7_476, out s2_477, out s3_478, out s4_479, out s5_480, out s6_481, out s7_482, out s8_483, out s9_484, out s10_485, out s11_486, out t4_487);
		return;
	}
	Eq_2 a3_120;
	word32 a3_466;
	word32 a4_467;
	word32 a5_468;
	Eq_2 a0_37 = bt_mesh_subnet_get(a0_22, out a3_466, out a4_467, out a5_468);
	Eq_2 s0_103 = a0_37;
	if (a0_37 == 0x00)
	{
		a3_120.u0 = 0x00;
		goto l2303E04E;
	}
	word32 a1_46 = (word32) *((word32) a0_37 + 31);
	if (((word32) a0_30 - 2 & 0x00FF) > 0x01)
	{
l2303E07E:
		0x00 = dwArg0128;
		word32 t4_506;
		word32 s8_502;
		word32 s9_503;
		word32 s11_505;
		word32 s10_504;
		word32 s4_498;
		word32 s5_499;
		word32 s7_501;
		word32 s6_500;
		word32 a5_494;
		word32 a7_495;
		word32 s3_497;
		word32 s2_496;
		word32 a1_490;
		word32 a2_491;
		word32 a4_493;
		word32 a3_492;
		word32 a0_489;
		word32 s1_488;
		printf(ra, &g_t230B8408, 0x01, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_488, out a0_489, out a1_490, out a2_491, out a3_492, out a4_493, out a5_494, out a7_495, out s2_496, out s3_497, out s4_498, out s5_499, out s6_500, out s7_501, out s8_502, out s9_503, out s10_504, out s11_505, out t4_506);
		return;
	}
	if (a1_46 == 0x00)
	{
		if (a0_30 == 0x02)
			goto l2303E07E;
		goto l2303E0AC;
	}
	if (a1_46 == 0x01)
	{
		if (a0_30 == 0x02)
		{
			((word32) a0_37 + 30)->u2 = 0x0201;
			goto l2303E0A8;
		}
	}
	else if (a1_46 != 0x02)
		goto l2303E0AC;
	if (a0_30 != 0x03)
		goto l2303E0AC;
	bt_mesh_net_revoke_keys(a0_37);
	word32 a3_507;
	word32 a4_508;
	s1_163 = friend_cred_refresh((word32) *a1, out a3_507, out a4_508);
	((word32) a0_37 + 30)->u2 = 0x00;
l2303E0A8:
	word32 s5_514;
	word32 s8_515;
	word32 a3_510;
	word32 a4_511;
	word32 s3_513;
	word32 a5_512;
	word32 a1_509;
	s0_103 = bt_mesh_net_beacon_update(ra, a0_37, out a1_509, out a3_510, out a4_511, out a5_512, out s3_513, out s4, out s5_514, out s8_515);
l2303E0AC:
	a3_120 = (word32) *((word32) s0_103 + 31);
l2303E04E:
	0x00 = dwArg0128;
	send_krp_status(ra, dwArgE4, s1_163, s1_163, a3_120, a1, s4, s6, s7, s9, s11, mstatus, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, ra, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114);
}

