pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303E0D6: void lpn_timeout_get(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack word32 dwArg0128)
void lpn_timeout_get(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, word32 dwArg0128)
{
	struct Eq_274 * a0_142;
	word32 a5_303;
	word32 a4_302;
	word32 a2_301;
	word32 a1_300;
	Eq_2 a0_24 = net_buf_simple_pull_le16(fp + -40, out a1_300, out a2_301, out a4_302, out a5_303);
	Eq_2 a5_30 = (int32) (word16) a0_24;
	if (a5_30 <= 0x00)
		a0_142 = (struct Eq_274 *) &g_t230B842C;
	else
	{
		Eq_2 a5_39;
		word32 a4_306;
		word32 a2_305;
		word32 a1_304;
		Eq_2 s1_40 = bt_mesh_model_msg_init(0x0800002E, a5_30, out a1_304, out a2_305, out a4_306, out a5_39);
		word32 a5_308;
		word32 a4_307;
		net_buf_simple_add_le16(fp + -28, a0_24, a5_39, out a4_307, out a5_308);
		Eq_2 a5_55;
		Eq_2 a0_53 = bt_mesh_friend_find(0x0FFFFFFF, a0_24, 0x01, 0x01, out a5_55);
		Eq_2 s0_62 = 0x00;
		if (a0_53 != 0x00)
			s0_62 = k_delayed_work_remaining_get(0x00, s1_40, (word32) a0_53 + 24, out a5_55) ^ 100;
		Eq_2 a5_78;
		net_buf_simple_add_u8(fp + -28, s0_62 & 0x00FF, a5_55, out a5_78);
		Eq_2 a5_84;
		net_buf_simple_add_u8(fp + -28, s0_62 >> 0x08 & 0x00FF, a5_78, out a5_84);
		word32 a5_309;
		net_buf_simple_add_u8(fp + -28, s0_62 >> 0x10 & 0x00FF, a5_84, out a5_309);
		word32 s0_310;
		word32 s1_311;
		word32 a0_112;
		word32 a2_312;
		word32 a4_313;
		word32 a5_314;
		word32 mstatus_315;
		ra = bt_mesh_model_send(ra, s0_62, s1_40, s1_40, a1, fp + -28, 0x00, a1, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -40, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_310, out s1_311, out a0_112, out a2_312, out a3, out a4_313, out a5_314, out mstatus_315);
		if (a0_112 == 0x00)
		{
l2303E10E:
			0x00 = dwArg0128;
			return;
		}
		a0_142 = (struct Eq_274 *) &g_t230B8450;
	}
	word32 s1_316;
	word32 a0_317;
	word32 a1_318;
	word32 a2_319;
	word32 a3_320;
	word32 a4_321;
	word32 a5_322;
	word32 a7_323;
	word32 s2_324;
	word32 s3_325;
	word32 s4_326;
	word32 s5_327;
	word32 s6_328;
	word32 s7_329;
	word32 s8_330;
	word32 s9_331;
	word32 s10_332;
	word32 s11_333;
	word32 t4_334;
	printf(ra, a0_142, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_316, out a0_317, out a1_318, out a2_319, out a3_320, out a4_321, out a5_322, out a7_323, out s2_324, out s3_325, out s4_326, out s5_327, out s6_328, out s7_329, out s8_330, out s9_331, out s10_332, out s11_333, out t4_334);
	goto l2303E10E;
}

// 2303E190: void friend_set(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_202757) s1, Register Eq_2 a1, Register Eq_2 a3, Register (ptr32 byte) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void friend_set(Eq_2 ra, Eq_2 s0, struct Eq_202757 * s1, Eq_2 a1, Eq_2 a3, byte * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	up32 a5_7 = (word32) *a5;
	if (a5_7 <= 0x01)
	{
		Eq_2 a0_17 = s1->t0018;
		Eq_2 s2_19 = a1;
		Eq_2 s0_124 = a0_17;
		if (s1 == null)
		{
			word32 a3_364;
			word32 a2_363;
			word32 a1_362;
			word32 a0_361;
			word32 s1_360;
			word32 a4_365;
			word32 a5_366;
			word32 a7_367;
			word32 s2_368;
			word32 s3_369;
			word32 s5_370;
			word32 s8_371;
			word32 s10_372;
			word32 t4_373;
			ra = printf(ra, &g_t230B82AC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_360, out a0_361, out a1_362, out a2_363, out a3_364, out a4_365, out a5_366, out a7_367, out s2_368, out s3_369, out s4, out s5_370, out s6, out s7, out s8_371, out s9, out s10_372, out s11, out t4_373);
		}
		else if ((word32) s1->b0009 != a5_7)
		{
			s1->b0009 = (byte) a5_7;
			if (a5_7 == 0x00)
			{
				word32 a3_374;
				ra = bt_mesh_friend_clear_net_idx(ra, a0_17, 0x0FFFFFFF, mstatus, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg38, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s1, out a3_374, out s2_19, out s3, out s4, out s5, out s6, out s8, out mstatus);
			}
			if (((word32) s1->w0036 & 0x04) != 0x00)
			{
				word32 s1_375;
				word32 a3_376;
				word32 a4_377;
				word32 a5_378;
				word32 s2_379;
				word32 s3_380;
				word32 s5_381;
				word32 s8_382;
				ra = bt_mesh_heartbeat_send(ra, s2_19, s3, s4, s5, s6, s7, s8, mstatus, s2, s0, dwLoc08, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_124, out s1_375, out a3_376, out a4_377, out a5_378, out s2_379, out s3_380, out s4, out s5_381, out s6, out s7, out s8_382, out s9, out s11, out mstatus);
			}
		}
		0x00 = (int8) dwArg38;
		send_friend_status(ra, s0_124, s4, s6, s7, s9, s11, mstatus, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, dwArg0128);
	}
	else
	{
		word32 t4_359;
		word32 s11_358;
		word32 s10_357;
		word32 s9_356;
		word32 s8_355;
		word32 s7_354;
		word32 s6_353;
		word32 s5_352;
		word32 s4_351;
		word32 s3_350;
		word32 s2_349;
		word32 a7_348;
		word32 a5_347;
		word32 a4_346;
		word32 a3_345;
		word32 a2_344;
		word32 a1_343;
		word32 s1_341;
		word32 a0_342;
		printf(ra, &g_t230B828C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_341, out a0_342, out a1_343, out a2_344, out a3_345, out a4_346, out a5_347, out a7_348, out s2_349, out s3_350, out s4_351, out s5_352, out s6_353, out s7_354, out s8_355, out s9_356, out s10_357, out s11_358, out t4_359);
	}
}

// 2303E1FE: void node_reset(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void node_reset(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	word32 a5_259;
	word32 a4_258;
	word32 a2_257;
	word32 a1_256;
	Eq_2 s1_28 = bt_mesh_model_msg_init(0x0800004A, fp + -36, out a1_256, out a2_257, out a4_258, out a5_259);
	word32 a0_42;
	ptr32 mstatus_50;
	word32 s1_261;
	word32 s0_260;
	Eq_2 a5_47;
	Eq_2 a4_46;
	Eq_2 a3_45;
	Eq_2 a2_100;
	Eq_2 ra_118 = bt_mesh_model_send(ra, a0, s1_28, a0, s1_28, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_260, out s1_261, out a0_42, out a2_100, out a3_45, out a4_46, out a5_47, out mstatus_50);
	if (a0_42 != 0x00)
	{
		word32 t4_287;
		word32 s11_286;
		word32 s10_285;
		word32 s9_284;
		word32 s8_283;
		word32 s7_282;
		word32 s6_281;
		word32 s5_280;
		word32 s4_279;
		word32 s3_278;
		word32 s2_277;
		word32 a7_276;
		word32 a1_275;
		word32 a0_274;
		word32 s1_273;
		ra_118 = printf(ra_118, &g_t230B86B8, a3_45, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_273, out a0_274, out a1_275, out a2_100, out a3_45, out a4_46, out a5_47, out a7_276, out s2_277, out s3_278, out s4_279, out s5_280, out s6_281, out s7_282, out s8_283, out s9_284, out s10_285, out s11_286, out t4_287);
	}
	word32 a3_272;
	word32 s4_271;
	word32 s3_270;
	word32 s2_269;
	word32 a5_268;
	word32 a4_267;
	word32 a3_266;
	word32 a2_265;
	word32 a1_264;
	word32 a0_263;
	word32 s1_262;
	bt_mesh_reset(ra_118, vTaskDelay(500, a2_100, a3_45, a4_46, a5_47, mstatus_50, dwLoc0C, dwLoc08, dwArg0108, dwArg0148, out s1_262, out a0_263, out a1_264, out a2_265, out a3_266, out a4_267, out a5_268, out s2_269, out s3_270, out s4_271), mstatus_50, dwLoc30, dwLoc2C, dwLoc28, 0x00060000, dwLoc20, s0, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg54, fp + -36, fp + -36, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a3_272);
}

// 2303E256: void mod_sub_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0104)
void mod_sub_get(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArg0104)
{
	struct Eq_274 * a0_215;
	word32 a4_481;
	word32 a5_482;
	word32 a2_480;
	word32 a1_479;
	Eq_2 a0_29 = net_buf_simple_pull_le16(fp + -48, out a1_479, out a2_480, out a4_481, out a5_482);
	Eq_2 a5_35 = (int32) (word16) a0_29;
	if (a5_35 <= 0x00)
	{
		a0_215 = (struct Eq_274 *) &g_t230B8560;
		goto l2303E292;
	}
	Eq_2 s2_154;
	Eq_2 a1_102;
	Eq_2 a5_117;
	Eq_2 a5_43;
	word32 a1_483;
	word32 a4_485;
	word32 a2_484;
	net_buf_simple_pull_le16(a5_35, out a1_483, out a2_484, out a4_485, out a5_43);
	Eq_2 a1_49;
	word32 a2_486;
	word32 a4_487;
	word32 a5_488;
	Eq_2 s1_53 = bt_mesh_model_msg_init(0x0800002A, a5_43, out a1_49, out a2_486, out a4_487, out a5_488);
	word32 a3_490;
	word32 a4_491;
	word32 a1_489;
	Eq_2 a5_106;
	Eq_2 a0_56 = bt_mesh_elem_find(a0_29, a1_49, out a1_489, out a3_490, out a4_491, out a5_106);
	Eq_2 a1_103 = 0x01;
	s2_154 = s2;
	if (a0_56 != 0x00)
	{
		word32 a4_494;
		word32 a3_493;
		Eq_2 a0_70 = bt_mesh_model_find(a0_56, s1_53, out a3_493, out a4_494, out a5_106);
		s2_154 = a0_70;
		if (a0_70 != 0x00)
		{
			Eq_2 a5_81;
			net_buf_simple_add_u8(fp + -60, 0x00, a5_106, out a5_81);
			Eq_2 a5_87;
			word32 a4_495;
			net_buf_simple_add_le16(fp + -60, a0_29, a5_81, out a4_495, out a5_87);
			word32 a4_496;
			net_buf_simple_add_le16(fp + -60, s1_53, a5_87, out a4_496, out a5_117);
			Eq_2 a1_94 = (word32) *((word32) a0_70 + 16);
			if (a1_94 != 0x00)
			{
				word32 a4_503;
				net_buf_simple_add_le16(fp + -60, a1_94, a5_117, out a4_503, out a5_117);
			}
			a1_102 = (word32) *((word32) a0_70 + 18);
			if (a1_102 == 0x00)
			{
l2303E314:
				word32 a0_185;
				word32 mstatus_502;
				word32 s1_498;
				word32 a2_499;
				word32 a5_501;
				word32 a4_500;
				word32 s0_497;
				ra = bt_mesh_model_send(ra, a0_29, s1_53, a0, a1, fp + -60, 0x00, s2_154, a1, s6, s7, s9, s11, mstatus, dwLoc38, s4, s2, s0, dwLoc28, dwLoc24, dwLoc1C, dwLoc08, dwLoc04, dwArg18, dwArg1C, dwArg24, dwArg28, fp + -48, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArg0104, out s0_497, out s1_498, out a0_185, out a2_499, out a3, out a4_500, out a5_501, out mstatus_502);
				if (a0_185 == 0x00)
					return;
				a0_215 = (struct Eq_274 *) &g_t230B8580;
l2303E292:
				word32 t4_522;
				word32 s8_518;
				word32 s9_519;
				word32 s11_521;
				word32 s10_520;
				word32 s4_514;
				word32 s5_515;
				word32 s7_517;
				word32 s6_516;
				word32 a5_510;
				word32 a7_511;
				word32 s3_513;
				word32 s2_512;
				word32 a1_506;
				word32 a2_507;
				word32 a4_509;
				word32 a3_508;
				word32 a0_505;
				word32 s1_504;
				printf(ra, a0_215, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_504, out a0_505, out a1_506, out a2_507, out a3_508, out a4_509, out a5_510, out a7_511, out s2_512, out s3_513, out s4_514, out s5_515, out s6_516, out s7_517, out s8_518, out s9_519, out s10_520, out s11_521, out t4_522);
				return;
			}
l2303E2E2:
			word32 a4_523;
			word32 a5_524;
			net_buf_simple_add_le16(fp + -60, a1_102, a5_117, out a4_523, out a5_524);
			goto l2303E314;
		}
		a1_103.u0 = 0x02;
	}
	Eq_2 a5_110;
	net_buf_simple_add_u8(fp + -60, a1_103, a5_106, out a5_110);
	word32 a4_492;
	net_buf_simple_add_le16(fp + -60, a0_29, a5_110, out a4_492, out a5_117);
	a1_102 = s1_53;
	goto l2303E2E2;
}

