pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303E32E: void mod_sub_get_vnd(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
void mod_sub_get_vnd(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	struct Eq_274 * a0_237;
	word32 a5_517;
	word32 a1_514;
	word32 a4_516;
	word32 a2_515;
	Eq_2 a0_31 = net_buf_simple_pull_le16(fp + -52, out a1_514, out a2_515, out a4_516, out a5_517);
	Eq_2 a5_37 = (int32) (word16) a0_31;
	if (a5_37 <= 0x00)
	{
		a0_237 = (struct Eq_274 *) &g_t230B8560;
		goto l2303E36A;
	}
	Eq_2 a1_117;
	Eq_2 a5_108;
	Eq_2 a5_44;
	word32 a2_519;
	word32 a4_520;
	word32 a1_518;
	Eq_2 a0_40 = net_buf_simple_pull_le16(a5_37, out a1_518, out a2_519, out a4_520, out a5_44);
	Eq_2 a5_51;
	word32 a4_523;
	word32 a2_522;
	word32 a1_521;
	net_buf_simple_pull_le16(a5_44, out a1_521, out a2_522, out a4_523, out a5_51);
	Eq_2 a1_57;
	word32 a2_524;
	word32 a4_525;
	word32 a5_526;
	Eq_2 s1_61 = bt_mesh_model_msg_init(0x0800002C, a5_51, out a1_57, out a2_524, out a4_525, out a5_526);
	Eq_2 a4_66;
	word32 a3_528;
	word32 a1_527;
	Eq_2 a5_121;
	Eq_2 a0_64 = bt_mesh_elem_find(a0_31, a1_57, out a1_527, out a3_528, out a4_66, out a5_121);
	Eq_2 a1_118 = 0x01;
	if (a0_64 != 0x00)
	{
		word32 a3_531;
		word32 a4_532;
		Eq_2 a0_79 = bt_mesh_model_find_vnd(a0_64, a0_40, s1_61, a4_66, out a3_531, out a4_532, out a5_121);
		if (a0_79 != 0x00)
		{
			Eq_2 a5_90;
			net_buf_simple_add_u8(fp + -64, 0x00, a5_121, out a5_90);
			Eq_2 a5_96;
			word32 a4_533;
			net_buf_simple_add_le16(fp + -64, a0_31, a5_90, out a4_533, out a5_96);
			Eq_2 a5_102;
			word32 a4_534;
			net_buf_simple_add_le16(fp + -64, a0_40, a5_96, out a4_534, out a5_102);
			word32 a4_535;
			net_buf_simple_add_le16(fp + -64, s1_61, a5_102, out a4_535, out a5_108);
			Eq_2 a1_109 = (word32) *((word32) a0_79 + 16);
			if (a1_109 != 0x00)
			{
				word32 a4_542;
				net_buf_simple_add_le16(fp + -64, a1_109, a5_108, out a4_542, out a5_108);
			}
			a1_117 = (word32) *((word32) a0_79 + 18);
			if (a1_117 == 0x00)
			{
l2303E408:
				word32 a0_207;
				word32 mstatus_541;
				word32 s0_536;
				word32 s1_537;
				word32 a2_538;
				word32 a5_540;
				word32 a4_539;
				ra = bt_mesh_model_send(ra, a0_31, s1_61, a0, a1, fp + -64, 0x00, a0_40, a0, s6, s7, s9, s11, mstatus, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s0_536, out s1_537, out a0_207, out a2_538, out a3, out a4_539, out a5_540, out mstatus_541);
				if (a0_207 == 0x00)
					return;
				a0_237 = (struct Eq_274 *) &g_t230B85AC;
l2303E36A:
				word32 t4_561;
				word32 s8_557;
				word32 s9_558;
				word32 s11_560;
				word32 s10_559;
				word32 s4_553;
				word32 s5_554;
				word32 s7_556;
				word32 s6_555;
				word32 a5_549;
				word32 a7_550;
				word32 s3_552;
				word32 s2_551;
				word32 a1_545;
				word32 a2_546;
				word32 a4_548;
				word32 a3_547;
				word32 a0_544;
				word32 s1_543;
				printf(ra, a0_237, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_543, out a0_544, out a1_545, out a2_546, out a3_547, out a4_548, out a5_549, out a7_550, out s2_551, out s3_552, out s4_553, out s5_554, out s6_555, out s7_556, out s8_557, out s9_558, out s10_559, out s11_560, out t4_561);
				return;
			}
l2303E3CE:
			word32 a4_562;
			word32 a5_563;
			net_buf_simple_add_le16(fp + -64, a1_117, a5_108, out a4_562, out a5_563);
			goto l2303E408;
		}
		a1_118.u0 = 0x02;
	}
	Eq_2 a5_125;
	net_buf_simple_add_u8(fp + -64, a1_118, a5_121, out a5_125);
	Eq_2 a5_132;
	word32 a4_529;
	net_buf_simple_add_le16(fp + -64, a0_31, a5_125, out a4_529, out a5_132);
	word32 a4_530;
	net_buf_simple_add_le16(fp + -64, a0_40, a5_132, out a4_530, out a5_108);
	a1_117 = s1_61;
	goto l2303E3CE;
}

// 2303E422: void net_key_update(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_2) a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0114)
void net_key_update(Eq_2 ra, Eq_2 s1, Eq_2 a0, union Eq_2 * a2, Eq_2 a3, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0114)
{
	word32 a5_486;
	word32 a2_484;
	word32 a4_485;
	word32 a1_483;
	Eq_2 a0_24 = net_buf_simple_pull_le16(a5, out a1_483, out a2_484, out a4_485, out a5_486);
	Eq_2 s2_114 = a0;
	Eq_2 s1_111 = a0_24;
	if (a0_24 >= 0x01000000)
	{
		word32 s11_507;
		word32 t4_508;
		word32 s6_502;
		word32 s10_506;
		word32 s8_504;
		word32 s9_505;
		word32 s7_503;
		word32 a7_497;
		word32 s5_501;
		word32 s3_499;
		word32 s4_500;
		word32 s2_498;
		word32 a1_492;
		word32 a5_496;
		word32 a3_494;
		word32 a4_495;
		word32 a2_493;
		word32 a0_491;
		word32 s1_490;
		printf(ra, &g_t230B83E8, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_490, out a0_491, out a1_492, out a2_493, out a3_494, out a4_495, out a5_496, out a7_497, out s2_498, out s3_499, out s4_500, out s5_501, out s6_502, out s7_503, out s8_504, out s9_505, out s10_506, out s11_507, out t4_508);
		return;
	}
	word32 a3_487;
	word32 a5_489;
	word32 a4_488;
	Eq_2 a0_31 = bt_mesh_subnet_get(a0_24, out a3_487, out a4_488, out a5_489);
	Eq_2 a3_152 = 0x04;
	if (a0_31 == 0x00)
	{
l2303E47E:
		send_net_key_status(ra, s1, s1_111, dwArg48, a3_152, s2_114, dwArg04, s6, s7, s9, s11, mstatus, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, s3, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114);
		return;
	}
	up32 a5_37 = (word32) *((word32) a0_31 + 31);
	if (a5_37 != 0x01)
	{
		if (a5_37 != 0x00)
		{
			if (a5_37 <= 0x03)
			{
l2303E47C:
				a3_152.u0 = 11;
				goto l2303E47E;
			}
		}
		else
		{
			word32 a3_516;
			word32 a5_518;
			word32 a4_517;
			word32 a2_515;
			word32 a1_514;
			if (memcmp(*a2, (word32) a0_31 + 48, 0x10, out a1_514, out a2_515, out a3_516, out a4_517, out a5_518) == 0x00)
				return;
		}
		Eq_2 s0_81;
		word32 a0_96;
		word32 s3_521;
		word32 s5_523;
		word32 s4_522;
		word32 a4_520;
		word32 a3_519;
		ra = bt_mesh_net_keys_create(ra, a0_31, (word32) a0_31 + 0x0089, a0, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_81, out s1_111, out a0_96, out a3_519, out a4_520, out s2_114, out s3_521, out s4_522, out s5_523, out s6, out s7, out s9, out s11);
		if (a0_96 != 0x00)
		{
l2303E4D8:
			a3_152.u0 = 0x10;
			goto l2303E47E;
		}
		word32 a0_102;
		ra = friend_cred_update(ra, s0_81, dwArg10, dwArg14, dwArg38, dwArg5C, dwArgF8, out s1_111, out a0_102, out s2_114, out s6, out s7, out s9, out s11);
		if (a0_102 != 0x00)
			goto l2303E4D8;
		*((word32) s0_81 + 31) = 0x01;
		word32 s5_530;
		word32 s8_531;
		word32 a4_526;
		word32 s4_529;
		word32 s3_528;
		word32 a5_527;
		word32 a3_525;
		word32 a1_524;
		bt_mesh_net_beacon_update(ra, s0_81, out a1_524, out a3_525, out a4_526, out a5_527, out s3_528, out s4_529, out s5_530, out s8_531);
	}
	else
	{
		word32 a4_512;
		word32 a5_513;
		word32 a3_511;
		word32 a1_509;
		word32 a2_510;
		if (memcmp(*a2, (word32) a0_31 + 0x0089, 0x10, out a1_509, out a2_510, out a3_511, out a4_512, out a5_513) != 0x00)
			goto l2303E47C;
	}
	a3_152.u0 = 0x00;
	goto l2303E47E;
}

