pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303E4F2: void net_key_add(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_2) a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0114, Stack Eq_2 dwArg0148)
void net_key_add(Eq_2 ra, Eq_2 s1, Eq_2 a0, union Eq_2 * a2, Eq_2 a3, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0114, Eq_2 dwArg0148)
{
	word32 a4_507;
	word32 a5_508;
	word32 a1_505;
	word32 a2_506;
	Eq_2 a0_24 = net_buf_simple_pull_le16(a5, out a1_505, out a2_506, out a4_507, out a5_508);
	Eq_2 s2_169 = a0;
	Eq_2 s1_166 = a0_24;
	if (a0_24 >= 0x01000000)
	{
		word32 s11_529;
		word32 t4_530;
		word32 s7_525;
		word32 s9_527;
		word32 s10_528;
		word32 s8_526;
		word32 s5_523;
		word32 s6_524;
		word32 a7_519;
		word32 s3_521;
		word32 s4_522;
		word32 s2_520;
		word32 a2_515;
		word32 a4_517;
		word32 a5_518;
		word32 a3_516;
		word32 a0_513;
		word32 a1_514;
		word32 s1_512;
		printf(ra, &g_t230B83E8, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_512, out a0_513, out a1_514, out a2_515, out a3_516, out a4_517, out a5_518, out a7_519, out s2_520, out s3_521, out s4_522, out s5_523, out s6_524, out s7_525, out s8_526, out s9_527, out s10_528, out s11_529, out t4_530);
		return;
	}
	Eq_2 a3_192;
	word32 a3_509;
	word32 a5_511;
	word32 a4_510;
	Eq_2 a0_31 = bt_mesh_subnet_get(a0_24, out a3_509, out a4_510, out a5_511);
	Eq_2 s0_35 = a0_31;
	if (a0_31 == 0x00)
	{
		word32 a5_42;
		if ((word32) g_w4200D8DC != 0x0FFFFFFF)
		{
			a3_192.u0 = 0x05;
			if ((word32) g_w4200D9C0 != 0x0FFFFFFF)
				goto l2303E588;
			a5_42 = 0x01;
		}
		else
			a5_42 = 0x00;
		s0_35 = a5_42 + 0x4200D9A4;
	}
	Eq_2 a5_56 = (word32) s0_35 + 48;
	Eq_2 a0_59 = *a2;
	if ((word32) *((word32) s0_35 + 28) == a0_24)
	{
		a3_192.u0 = 0x06;
		word32 a4_539;
		word32 a5_540;
		word32 a2_537;
		word32 a3_538;
		word32 a1_536;
		if (memcmp(a0_59, a5_56, 0x10, out a1_536, out a2_537, out a3_538, out a4_539, out a5_540) != 0x00)
			goto l2303E588;
	}
	else
	{
		Eq_2 s0_78;
		word32 a0_93;
		word32 s5_535;
		word32 a3_531;
		word32 s3_533;
		word32 s4_534;
		word32 a4_532;
		ra = bt_mesh_net_keys_create(ra, s0_35, a5_56, a0, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_78, out s1_166, out a0_93, out a3_531, out a4_532, out s2_169, out s3_533, out s4_534, out s5_535, out s6, out s7, out s9, out s11);
		a3_192.u0 = 0x10;
		if (a0_93 != 0x00)
			goto l2303E588;
		*((word32) s0_78 + 28) = (word16) s1_166;
		word32 s3_545;
		word32 s5_547;
		word32 s8_548;
		word32 s4_546;
		word32 a1_541;
		word32 a4_543;
		word32 a5_544;
		word32 a3_542;
		Eq_2 s0_109 = bt_mesh_net_beacon_update(ra, s0_78, out a1_541, out a3_542, out a4_543, out a5_544, out s3_545, out s4_546, out s5_547, out s8_548);
		((word32) s0_109 + 32)->u0 = 0x00;
		Eq_2 a5_127;
		ptr32 mstatus_141;
		Eq_2 s5_145;
		word32 s5_571;
		word32 s8_572;
		word32 s3_569;
		word32 s4_570;
		word32 a4_567;
		word32 a5_568;
		word32 a0_565;
		word32 a3_566;
		word32 s11_563;
		word32 s0_564;
		word32 s9_561;
		word32 s10_562;
		word32 s7_559;
		word32 s8_560;
		word32 s4_557;
		word32 s6_558;
		word32 s2_555;
		word32 s3_556;
		word32 a3_553;
		word32 a4_554;
		word32 a0_551;
		word32 a1_552;
		word32 s0_549;
		word32 s1_550;
		ra = bt_mesh_adv_update(bt_mesh_proxy_beacon_send(ra, s1_166, s0_109, s2_169, mstatus, s2, dwLoc10, dwLoc08, dwLoc04, dwArg10, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, out s0_549, out s1_550, out a0_551, out a1_552, out a3_553, out a4_554, out a5_127, out s2_555, out s3_556, out s4_557, out s5_145, out s6_558, out s7_559, out s8_560, out s9_561, out s10_562, out s11_563, out mstatus_141), a5_127, s5_145, mstatus_141, dwArg10, dwArg14, dwArg38, dwArg5C, s1, dwArgA8, dwArgC8, dwArgF8, dwArg0108, dwArg0148, out s0_564, out s1_166, out a0_565, out a3_566, out a4_567, out a5_568, out s2_169, out s3_569, out s4_570, out s5_571, out s6, out s7, out s8_572, out s9, out s11, out mstatus);
	}
	a3_192.u0 = 0x00;
l2303E588:
	send_net_key_status(ra, s1, s1_166, dwArg48, a3_192, s2_169, dwArg04, s6, s7, s9, s11, mstatus, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, s3, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114);
}

// 2303E5CA: Register word32 key_idx_unpack(Register (ptr32 word16) a1, Register (ptr32 word16) a2, Register (ptr32 Eq_204258) a3, Register (ptr32 Eq_204259) a4)
// Called from:
//      app_key_update
//      app_key_add
//      app_key_del
word32 key_idx_unpack(word16 * a1, word16 * a2, struct Eq_204258 * a3, struct Eq_204259 * a4)
{
	*a1 = (word16) (word32) (word12) ((word32) a3->b0001 << 8 | (word32) a3->b0000);
	Eq_2 a0_15 = a4->t0000;
	*a2 = (word16) (((word32) a4->b0002 << 8 | (word32) a4->b0001) >> 4);
	word32 a5_26;
	word32 a1_27;
	net_buf_simple_pull(a0_15, 0x03, out a1_27, out a5_26);
	return a5_26;
}

// 2303E5FA: Register Eq_2 _mod_pub_set.isra.1(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 a0Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s8Out)
// Called from:
//      mod_pub_set
//      mod_pub_va_set
//      _mod_unbind
Eq_2 _mod_pub_set.isra.1(Eq_2 s1, Eq_2 a0, Eq_2 a1, ptr32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & a0Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s8Out)
{
	struct Eq_204339 * t1_5 = *((word32) a0 + 8);
	if (t1_5 == null || t1_5->dw0018 == 0x00 && a5 != 0x00)
	{
		a0Out = 0x07;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		return s0;
	}
	ptr32 a7_166;
	Eq_2 a0_137;
	Eq_2 s5_109 = a6;
	Eq_2 s2_100 = a5;
	Eq_2 s6_110 = a4;
	ptr32 s3_101 = a2;
	if (a1 == 0x00)
	{
		struct Eq_204376 * a5_117 = (word32) t1_5->w0004;
		if (a5_117 == null)
			goto l2303E636;
		t1_5->w0004 = 0x00;
		a5_117->w0006 = 0x00;
		ui32 a5_122 = (word32) *((word32) a4 + 11);
		*((word32) a4 + 11) = (byte) (a5_122 & ~0x10);
		(a5_122 & ~0x10)->b0008 = 0x00;
		(a5_122 & ~0x10)->b000A = 0x00;
		(a5_122 & ~0x10)->b0009 = 0x00;
		ui32 a5_132 = (word32) *((word32) a4 + 0x0C);
		*((word32) a4 + 0x0C) = (byte) (a5_132 & ~0x07);
		a0_137 = (a5_132 & ~0x07)->dw0018 + 0x1C;
		if ((a5_132 & ~0x07) != 0x00)
		{
l2303E68A:
			word32 a5_353;
			word32 a4_352;
			word32 s4_354;
			word32 s8_355;
			word32 a3_351;
			word32 a2_350;
			word32 a1_349;
			word32 a0_348;
			k_delayed_work_cancel(a0_137, a3, a4, mstatus, dwArg14, dwArg18, dwArg88, dwArg98, dwArgC8, dwArg0108, out a0_348, out a1_349, out a2_350, out a3_351, out a4_352, out a5_353, out s2_100, out s3_101, out s4_354, out s5_109, out s6_110, out s8_355);
			goto l2303E636;
		}
	}
	else
	{
		a7_166 = 0x03;
		struct Eq_204366 * a5_62;
		word32 a4_347;
		word32 a3_346;
		if (bt_mesh_app_key_find(a2, out a3_346, out a4_347, out a5_62) == 0x00)
			goto l2303E638;
		a5_62->w0004 = (word16) a1;
		a5_62->w0006 = (word16) a2;
		a5_62->b000B = (byte) ((a3 & 1) << 4 | (word32) a5_62->b000B & ~0x10);
		a5_62->b0008 = (byte) a4;
		a5_62->b000A = (byte) a5;
		a5_62->b0009 = (byte) a6;
		struct Eq_193140 * a5_82 = a5_62->ptr0018;
		if (a5_82 != null)
		{
			Eq_2 a0_84 = bt_mesh_model_pub_period_get(a5_82, out a3, out a4);
			a0_137 = (word32) a0_84 + 28;
			if (a0_84 == 0x00)
				goto l2303E68A;
			word32 s1_356;
			word32 a0_357;
			word32 a1_358;
			word32 a2_359;
			word32 a3_360;
			word32 a4_361;
			word32 a5_362;
			word32 s4_363;
			word32 s8_364;
			k_delayed_work_submit(a0_84, a3, a4, mstatus, s4, s2, dwArg04, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_356, out a0_357, out a1_358, out a2_359, out a3_360, out a4_361, out a5_362, out s2_100, out s3_101, out s4_363, out s5_109, out s6_110, out s8_364);
		}
	}
l2303E636:
	a7_166 = 0x00;
l2303E638:
	0x00 = (int8) dwArgA8;
	a0Out = a7_166;
	s2Out = s2_100;
	s3Out = s3_101;
	s4Out = dwArg04;
	s5Out = s5_109;
	s6Out = s6_110;
	s8Out = s4;
	return s1;
}

// 2303E6EC: Register Eq_2 mod_unbind.isra.2.part.3(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      mod_app_unbind
//      _mod_unbind
Eq_2 mod_unbind.isra.2.part.3(Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	Eq_2 s1_154 = a0;
	Eq_2 s2_19 = a1;
	Eq_2 s0_20 = (word32) a0 + 0x0C;
	Eq_2 s3_21 = (word32) a0 + 16;
	Eq_2 s4_22 = ~0x00;
	do
	{
		Eq_2 a5_25 = (word32) *s0_20;
		if (a5_25 == s2_19)
		{
			s0_20->u2 = (word16) s4_22;
			s1_154 = *((word32) a5_25 + 8);
			if (a5_25 != 0x00 && (word32) (*((word32) a5_25 + 6)) == s2_19)
			{
				word32 a0_182;
				word32 s5_183;
				word32 s6_184;
				word32 s8_185;
				s0_20 = _mod_pub_set.isra.1(s1_154, s1_154, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, s2_19, s4_22, mstatus, s4, dwLoc0C, dwLoc08, dwArg38, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out a0_182, out s2_19, out s3_21, out s4_22, out s5_183, out s6_184, out s8_185);
				s1_154 = s1_49;
			}
		}
		s0_20 = (word32) s0_20 + 2;
	} while (s0_20 != s3_21);
	s2Out = s2_19;
	s3Out = s3_21;
	return s1_154;
}

// 2303E74A: Register Eq_2 create_mod_app_status.isra.5(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Stack Eq_2 dwArg84, Register out Eq_2 s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      mod_app_unbind
//      mod_app_bind
Eq_2 create_mod_app_status.isra.5(Eq_2 a0, ptr32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 dwArg84, union Eq_2 & s1Out, ptr32 & s2Out, ptr32 & s4Out)
{
	Eq_2 a2_58;
	Eq_2 a0_55;
	Eq_2 a4_29;
	Eq_2 a5_30;
	word32 a1_111;
	word32 a2_112;
	Eq_2 s1_31 = bt_mesh_model_msg_init(0x0800003E, a5, out a1_111, out a2_112, out a4_29, out a5_30);
	Eq_2 a5_38;
	net_buf_simple_add_u8(a0, a4_29, a5_30, out a5_38);
	Eq_2 a5_45;
	word32 a4_113;
	net_buf_simple_add_le16(a0, a2, a5_38, out a4_113, out a5_45);
	Eq_2 a4_51;
	word32 a5_114;
	net_buf_simple_add_le16(dwArg84, a3, a5_45, out a4_51, out a5_114);
	if (a1 != 0x00)
	{
		word32 a1_117;
		word32 a5_118;
		a0_55 = net_buf_simple_add(dwArg84, 0x04, a4_51, out a1_117, out a5_118);
		a2_58.u0 = 0x04;
	}
	else
	{
		word32 a1_115;
		word32 a5_116;
		a0_55 = net_buf_simple_add(dwArg84, 0x02, a4_51, out a1_115, out a5_116);
		a2_58.u0 = 0x02;
	}
	word32 a1_119;
	word32 a2_120;
	word32 a3_121;
	word32 a4_122;
	word32 a5_123;
	word32 a6_124;
	word32 a7_125;
	memcpy(a0_55, s1_31, a2_58, out a1_119, out a2_120, out a3_121, out a4_122, out a5_123, out a6_124, out a7_125);
	s1Out = s1_31;
	s2Out = a1;
	s4Out = dwArg04;
	return dwArg84;
}

// 2303E7B2: void send_mod_pub_status.isra.7(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register word32 a4, Register Eq_2 a6, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0104)
// Called from:
//      mod_pub_set
//      mod_pub_get
//      mod_pub_va_set
void send_mod_pub_status.isra.7(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, word32 a4, Eq_2 a6, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArg0104)
{
	Eq_2 a4_110;
	Eq_2 a5_47;
	word32 a1_380;
	word32 a4_382;
	word32 a2_381;
	Eq_2 s1_48 = bt_mesh_model_msg_init(0x08000019, fp + -52, out a1_380, out a2_381, out a4_382, out a5_47);
	Eq_2 a5_54;
	net_buf_simple_add_u8(fp + -64, a6, a5_47, out a5_54);
	Eq_2 a4_60;
	Eq_2 a5_61;
	net_buf_simple_add_le16(fp + -64, a2, a5_54, out a4_60, out a5_61);
	Eq_2 s0_161 = ra;
	if (a6 != 0x00)
	{
		word32 a3_392;
		word32 a5_393;
		word32 a1_390;
		word32 a2_391;
		word32 t1_388;
		word32 a0_389;
		word32 a5_387;
		word32 a1_386;
		ra = memset(ra, net_buf_simple_add(fp + -64, 0x07, a4_60, out a1_386, out a5_387), 0x00, 0x07, out t1_388, out a0_389, out a1_390, out a2_391, out a3_392, out a4_110, out a5_393);
	}
	else
	{
		struct Eq_204751 * a4_67;
		word32 a5_383;
		net_buf_simple_add_le16(fp + -64, a3, a5_61, out a4_67, out a5_383);
		Eq_2 a5_71 = a4_67->t0008;
		Eq_2 a5_80;
		word32 a4_384;
		net_buf_simple_add_le16(fp + -64, (word32) *((word32) a5_71 + 6) | (a4_67 >> 28 & 0x01) << 0x0C, a5_71, out a4_384, out a5_80);
		Eq_2 a5_86;
		net_buf_simple_add_u8(fp + -64, (word32) *((word32) a5_80 + 8), a5_80, out a5_86);
		Eq_2 a5_92;
		net_buf_simple_add_u8(fp + -64, (word32) *((word32) a5_86 + 0x0A), a5_86, out a5_92);
		s0_161 = *a5_92;
		word32 a5_385;
		a4_110 = net_buf_simple_add_u8(fp + -64, (word32) *((word32) a5_92 + 9), a5_92, out a5_385);
	}
	Eq_2 a2_123;
	Eq_2 a0_120;
	if (a4 != 0x00)
	{
		word32 a1_396;
		word32 a5_397;
		a0_120 = net_buf_simple_add(fp + -64, 0x04, a4_110, out a1_396, out a5_397);
		a2_123.u0 = 0x04;
	}
	else
	{
		word32 a1_394;
		word32 a5_395;
		a0_120 = net_buf_simple_add(fp + -64, 0x02, a4_110, out a1_394, out a5_395);
		a2_123.u0 = 0x02;
	}
	word32 a6_422;
	word32 a7_423;
	word32 a4_420;
	word32 a5_421;
	word32 a2_418;
	word32 a3_419;
	word32 a1_417;
	memcpy(a0_120, s1_48, a2_123, out a1_417, out a2_418, out a3_419, out a4_420, out a5_421, out a6_422, out a7_423);
	word32 a0_181;
	Eq_2 a3_184;
	word32 a5_428;
	word32 mstatus_429;
	word32 a2_426;
	word32 a4_427;
	word32 s0_424;
	word32 s1_425;
	Eq_2 ra_190 = bt_mesh_model_send(ra, s0_161, s1_48, a0, a1, fp + -64, 0x00, a6, a1, s6, s7, s9, s11, mstatus, dwLoc38, s4, s2, s0, dwLoc28, dwLoc24, dwLoc1C, dwLoc08, dwLoc04, dwArg18, dwArg1C, dwArg24, dwArg28, 0x00140000, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArg0104, out s0_424, out s1_425, out a0_181, out a2_426, out a3_184, out a4_427, out a5_428, out mstatus_429);
	if (a0_181 != 0x00)
	{
		word32 t4_416;
		word32 s10_414;
		word32 s11_415;
		word32 s8_412;
		word32 s9_413;
		word32 s6_410;
		word32 s7_411;
		word32 s4_408;
		word32 s5_409;
		word32 s2_406;
		word32 s3_407;
		word32 a5_404;
		word32 a7_405;
		word32 a3_402;
		word32 a4_403;
		word32 a1_400;
		word32 a2_401;
		word32 s1_398;
		word32 a0_399;
		printf(ra_190, &g_t230B87C4, a3_184, fp + -52, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_398, out a0_399, out a1_400, out a2_401, out a3_402, out a4_403, out a5_404, out a7_405, out s2_406, out s3_407, out s4_408, out s5_409, out s6_410, out s7_411, out s8_412, out s9_413, out s10_414, out s11_415, out t4_416);
	}
}

