pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303E8A4: Register Eq_2 get_model(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 byte) a2, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s4Out, Register out Eq_2 s8Out)
// Called from:
//      mod_app_get
//      mod_app_unbind
//      mod_app_bind
//      mod_pub_set
//      mod_pub_get
//      mod_sub_del
//      mod_sub_add
//      mod_sub_va_del
//      mod_pub_va_set
//      mod_sub_va_add
//      mod_sub_del_all
//      mod_sub_va_overwrite
//      mod_sub_overwrite
Eq_2 get_model(Eq_2 a0, Eq_2 a1, byte * a2, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s4Out, union Eq_2 & s8Out)
{
	if ((word32) *((word32) a1 + 4) > 0x03)
	{
		Eq_2 a5_25;
		word32 a1_101;
		word32 a2_102;
		word32 a4_103;
		net_buf_simple_pull_le16(0x03, out a1_101, out a2_102, out a4_103, out a5_25);
		Eq_2 a1_29;
		Eq_2 a4_31;
		word32 a2_104;
		word32 a5_105;
		Eq_2 a0_28 = net_buf_simple_pull_le16(a5_25, out a1_29, out a2_104, out a4_31, out a5_105);
		*a2 = 0x01;
		ptr32 a3_44;
		ptr32 a4_45;
		word32 a5_110;
		Eq_2 a0_43 = bt_mesh_model_find_vnd(a0, a1_29, a0_28, a4_31, out a3_44, out a4_45, out a5_110);
		s1Out.u0 = <invalid>;
		a0Out = a0_43;
		a3Out = a3_44;
		a4Out = a4_45;
		s2Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		word32 a1_106;
		word32 a2_107;
		word32 a4_108;
		word32 a5_109;
		Eq_2 a0_49 = net_buf_simple_pull_le16(0x03, out a1_106, out a2_107, out a4_108, out a5_109);
		*a2 = 0x00;
		ptr32 a3_64;
		ptr32 a4_65;
		word32 a5_111;
		Eq_2 a0_62 = bt_mesh_model_find(a0, a0_49, out a3_64, out a4_65, out a5_111);
		s1Out.u0 = <invalid>;
		a0Out = a0_62;
		a3Out = a3_64;
		a4Out = a4_65;
		s2Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
}

// 2303E900: void mod_app_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0104)
void mod_app_get(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArg0104)
{
	struct Eq_274 * a0_244;
	Eq_2 a1_32;
	word32 a2_551;
	word32 a4_552;
	word32 a5_553;
	Eq_2 a0_31 = net_buf_simple_pull_le16(fp + -52, out a1_32, out a2_551, out a4_552, out a5_553);
	Eq_2 s2_11 = a0;
	byte bLoc41_295 = SLICE(fp + -52, byte, 24);
	if ((int32) (word16) a0_31 <= 0x00)
		a0_244 = (struct Eq_274 *) &g_t230B8560;
	else
	{
		Eq_2 s4_113 = *a2;
		word32 a5_557;
		word32 a1_554;
		word32 a3_555;
		word32 a4_556;
		Eq_2 a0_40 = bt_mesh_elem_find(a0_31, a1_32, out a1_554, out a3_555, out a4_556, out a5_557);
		Eq_2 s0_135 = a0_40;
		if (a0_40 == 0x00)
			bLoc41_295 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		else
		{
			Eq_2 a0_55;
			word32 s1_558;
			word32 a3_559;
			word32 s8_561;
			word32 a4_560;
			get_model(a0_40, a2, fp + -65, out s1_558, out a0_55, out a3_559, out a4_560, out s2_11, out s4_113, out s8_561);
			s0_135 = a0_55;
		}
		Eq_183596 a1_81;
		Eq_2 a5_79 = (word32) bLoc41_295;
		if (a5_79 != 0x00)
			a1_81.u0 = 0x0800004E;
		else
			a1_81.u0 = 0x0800004C;
		Eq_2 a5_91;
		word32 a1_567;
		word32 a4_569;
		word32 a2_568;
		Eq_2 s1_92 = bt_mesh_model_msg_init(a1_81, a5_79, out a1_567, out a2_568, out a4_569, out a5_91);
		Eq_2 a5_98;
		net_buf_simple_add_u8(fp + -64, s1_92, a5_91, out a5_98);
		Eq_2 a4_105;
		word32 a5_570;
		net_buf_simple_add_le16(fp + -64, a0_31, a5_98, out a4_105, out a5_570);
		Eq_2 a2_109 = 0x04;
		if ((word32) bLoc41_295 == 0x00)
			a2_109.u0 = 0x02;
		word32 a5_566;
		word32 a4_565;
		word32 a3_564;
		word32 a1_562;
		word32 a2_563;
		net_buf_simple_add_mem(fp + -64, s4_113, a2_109, a4_105, out a1_562, out a2_563, out a3_564, out a4_565, out a5_566);
		if (s0_135 != 0x00)
		{
			Eq_2 a1_137 = (word32) *((word32) s0_135 + 0x0C);
			if (a1_137 != 0x0FFFFFFF)
			{
				word32 a4_577;
				word32 a5_578;
				net_buf_simple_add_le16(fp + -64, a1_137, 0x0FFFFFFF, out a4_577, out a5_578);
			}
			Eq_2 a1_147 = (word32) *((word32) s0_135 + 0x0E);
			if (a1_147 != 0x0FFFFFFF)
			{
				word32 a4_579;
				word32 a5_580;
				net_buf_simple_add_le16(fp + -64, a1_147, 0x0FFFFFFF, out a4_579, out a5_580);
			}
		}
		word32 a0_214;
		word32 s1_572;
		word32 a4_574;
		word32 a5_575;
		word32 mstatus_576;
		word32 a2_573;
		word32 s0_571;
		ra = bt_mesh_model_send(ra, s0_135, s1_92, s2_11, a1, fp + -64, 0x00, s2_11, s4_113, s6, s7, s9, s11, mstatus, dwLoc38, s4, s2, s0, dwLoc28, dwLoc24, dwLoc1C, dwLoc08, dwLoc04, dwArg18, dwArg1C, dwArg24, dwArg28, 0x00130000, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArg0104, out s0_571, out s1_572, out a0_214, out a2_573, out a3, out a4_574, out a5_575, out mstatus_576);
		if (a0_214 == 0x00)
			return;
		a0_244 = (struct Eq_274 *) &g_t230B84E0;
	}
	word32 s10_597;
	word32 t4_599;
	word32 s11_598;
	word32 s5_592;
	word32 s7_594;
	word32 s8_595;
	word32 s9_596;
	word32 s6_593;
	word32 a5_587;
	word32 s2_589;
	word32 s3_590;
	word32 s4_591;
	word32 a7_588;
	word32 a0_582;
	word32 a2_584;
	word32 a3_585;
	word32 a4_586;
	word32 a1_583;
	word32 s1_581;
	printf(ra, a0_244, a3, fp + -52, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_581, out a0_582, out a1_583, out a2_584, out a3_585, out a4_586, out a5_587, out a7_588, out s2_589, out s3_590, out s4_591, out s5_592, out s6_593, out s7_594, out s8_595, out s9_596, out s10_597, out s11_598, out t4_599);
}

// 2303E9FE: void mod_app_unbind(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
void mod_app_unbind(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	struct Eq_274 * a0_182;
	word32 a5_360;
	word32 a4_359;
	word32 a2_358;
	word32 a1_357;
	Eq_2 a0_31 = net_buf_simple_pull_le16(fp + -48, out a1_357, out a2_358, out a4_359, out a5_360);
	Eq_2 s3_11 = a0;
	Eq_2 a5_37 = (int32) (word16) a0_31;
	if (a5_37 <= 0x00)
		a0_182 = (struct Eq_274 *) &g_t230B8560;
	else
	{
		Eq_2 a1_41;
		word32 a5_363;
		word32 a4_362;
		word32 a2_361;
		Eq_2 s2_109 = net_buf_simple_pull_le16(a5_37, out a1_41, out a2_361, out a4_362, out a5_363);
		Eq_2 s5_47 = *a2;
		Eq_2 s1_111 = a0_31;
		word32 a5_367;
		word32 a4_366;
		word32 a3_365;
		word32 a1_364;
		Eq_2 a0_48 = bt_mesh_elem_find(a0_31, a1_41, out a1_364, out a3_365, out a4_366, out a5_367);
		if (a0_48 == 0x00)
			bLoc3D = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		else
		{
			Eq_2 a0_62;
			Eq_2 s4_73;
			word32 s8_370;
			word32 a4_369;
			word32 a3_368;
			get_model(a0_48, a2, fp + -61, out s1_111, out a0_62, out a3_368, out a4_369, out s2_109, out s4_73, out s8_370);
			if (a0_62 != 0x00)
			{
				word32 a1_396;
				if (app_key_is_valid(s2_109, out a1_396) != 0x00)
					s1_111 = mod_unbind.isra.2.part.3(s1_111, a0_62, s2_109, s4_73, mstatus, dwLoc08, dwArg18, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, out s2_109, out s3_11);
			}
		}
		Eq_2 s1_125;
		Eq_2 s2_126;
		Eq_2 s4_127;
		word32 a0_152;
		word32 s0_390;
		word32 s1_391;
		word32 a2_392;
		word32 a4_393;
		word32 a5_394;
		word32 mstatus_395;
		ra = bt_mesh_model_send(ra, create_mod_app_status.isra.5(fp + -60, (word32) bLoc3D, s1_111, s2_109, s5_47, fp + -48, out s1_125, out s2_126, out s4_127), s1_125, s3_11, s4_127, fp + -60, 0x00, s2_126, s4_127, s6, s7, s9, s11, mstatus, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s0_390, out s1_391, out a0_152, out a2_392, out a3, out a4_393, out a5_394, out mstatus_395);
		if (a0_152 == 0x00)
			return;
		a0_182 = (struct Eq_274 *) &g_t230B8510;
	}
	word32 s7_384;
	word32 s6_383;
	word32 s5_382;
	word32 s4_381;
	word32 s3_380;
	word32 s2_379;
	word32 a7_378;
	word32 a5_377;
	word32 a4_376;
	word32 a3_375;
	word32 a2_374;
	word32 a1_373;
	word32 a0_372;
	word32 s1_371;
	word32 s8_385;
	word32 s9_386;
	word32 s10_387;
	word32 s11_388;
	word32 t4_389;
	printf(ra, a0_182, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_371, out a0_372, out a1_373, out a2_374, out a3_375, out a4_376, out a5_377, out a7_378, out s2_379, out s3_380, out s4_381, out s5_382, out s6_383, out s7_384, out s8_385, out s9_386, out s10_387, out s11_388, out t4_389);
}

