pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303EAC6: void mod_app_bind(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
void mod_app_bind(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	struct Eq_274 * a0_218;
	word32 a2_430;
	word32 a4_431;
	word32 a5_432;
	word32 a1_429;
	Eq_2 a0_31 = net_buf_simple_pull_le16(fp + -48, out a1_429, out a2_430, out a4_431, out a5_432);
	Eq_2 s3_11 = a0;
	Eq_2 a5_37 = (int32) (word16) a0_31;
	if (a5_37 <= 0x00)
	{
		a0_218 = (struct Eq_274 *) &g_t230B8560;
		goto l2303EB02;
	}
	Eq_2 a1_41;
	word32 a5_435;
	word32 a4_434;
	word32 a2_433;
	Eq_2 s1_112 = net_buf_simple_pull_le16(a5_37, out a1_41, out a2_433, out a4_434, out a5_435);
	Eq_2 s5_118 = *a2;
	Eq_2 s2_115 = a0_31;
	word32 a4_438;
	word32 a5_439;
	word32 a1_436;
	word32 a3_437;
	Eq_2 a0_48 = bt_mesh_elem_find(a0_31, a1_41, out a1_436, out a3_437, out a4_438, out a5_439);
	if (a0_48 == 0x00)
	{
		bLoc3D = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		goto l2303EB3E;
	}
	Eq_2 a0_62;
	Eq_2 a3_65;
	word32 s8_442;
	word32 a4_440;
	word32 s4_441;
	get_model(a0_48, a2, fp + -61, out s1_112, out a0_62, out a3_65, out a4_440, out s2_115, out s4_441, out s8_442);
	if (a0_62 == 0x00)
		goto l2303EB3E;
	if (a0_62 == a0)
	{
		word32 s10_478;
		word32 t4_479;
		word32 s4_476;
		word32 s8_477;
		word32 a5_474;
		word32 a7_475;
		word32 a3_472;
		word32 a4_473;
		word32 a1_470;
		word32 a2_471;
		word32 a0_469;
		ra = printf(ra, &g_t230B8478, a3_65, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_112, out a0_469, out a1_470, out a2_471, out a3_472, out a4_473, out a5_474, out a7_475, out s2_115, out s3_11, out s4_476, out s5_118, out s6, out s7, out s8_477, out s9, out s10_478, out s11, out t4_479);
		goto l2303EB3E;
	}
	word32 a1_468;
	if (app_key_is_valid(s1_112, out a1_468) == 0x00)
		goto l2303EB3E;
	Eq_2 a2_86 = (word32) *((word32) a0_62 + 0x0C);
	if (s1_112 != a2_86)
	{
		Eq_2 a3_88 = (word32) *((word32) a0_62 + 0x0E);
		if (s1_112 == a3_88)
			goto l2303EB3E;
		ui32 a5_91;
		if (a2_86 != 0x0FFFFFFF)
		{
			if (a3_88 != 0x0FFFFFFF)
				goto l2303EB3E;
			a5_91 = 0x01;
		}
		else
			a5_91 = 0x00;
		(word32) a0_62 + (a5_91 << 1) + 0x0C = (ptr32) (word16) s1_112;
	}
l2303EB3E:
	Eq_2 s1_153;
	Eq_2 s2_154;
	Eq_2 s4_155;
	word32 a0_188;
	word32 a5_466;
	word32 mstatus_467;
	word32 a2_464;
	word32 a4_465;
	word32 s0_462;
	word32 s1_463;
	ra = bt_mesh_model_send(ra, create_mod_app_status.isra.5(fp + -60, (word32) bLoc3D, s2_115, s1_112, s5_118, fp + -48, out s1_153, out s2_154, out s4_155), s1_153, s3_11, s4_155, fp + -60, 0x00, s2_154, s4_155, s6, s7, s9, s11, mstatus, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s0_462, out s1_463, out a0_188, out a2_464, out a3, out a4_465, out a5_466, out mstatus_467);
	if (a0_188 == 0x00)
		return;
	a0_218 = (struct Eq_274 *) &g_t230B84B0;
l2303EB02:
	word32 s11_460;
	word32 t4_461;
	word32 s9_458;
	word32 s10_459;
	word32 s7_456;
	word32 s8_457;
	word32 s5_454;
	word32 s6_455;
	word32 s3_452;
	word32 s4_453;
	word32 a7_450;
	word32 s2_451;
	word32 a4_448;
	word32 a5_449;
	word32 a2_446;
	word32 a3_447;
	word32 a0_444;
	word32 a1_445;
	word32 s1_443;
	printf(ra, a0_218, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_443, out a0_444, out a1_445, out a2_446, out a3_447, out a4_448, out a5_449, out a7_450, out s2_451, out s3_452, out s4_453, out s5_454, out s6_455, out s7_456, out s8_457, out s9_458, out s10_459, out s11_460, out t4_461);
}

// 2303EBC8: void mod_pub_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s4, Register word32 s8, Register Eq_2 s9, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack word32 dwArg0198)
void mod_pub_set(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s2, Eq_2 s4, word32 s8, Eq_2 s9, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgE8, word32 dwArg0198)
{
	word32 a5_386;
	word32 a4_385;
	word32 a2_384;
	word32 a1_383;
	Eq_2 a0_36 = net_buf_simple_pull_le16(a5, out a1_383, out a2_384, out a4_385, out a5_386);
	Eq_2 s5_134 = a0;
	byte bLoc31_289 = SLICE(s8, byte, 24);
	Eq_2 s6_135 = a1;
	Eq_2 s0_104 = a2;
	Eq_2 a5_42 = (int32) (word16) a0_36;
	if (a5_42 <= 0x00)
	{
		word32 a1_398;
		word32 a0_397;
		word32 s1_396;
		word32 a2_399;
		word32 a3_400;
		word32 a4_401;
		word32 a5_402;
		word32 a7_403;
		word32 s2_404;
		word32 s3_405;
		word32 s4_406;
		word32 s5_407;
		word32 s6_408;
		word32 s7_409;
		word32 s8_410;
		word32 s9_411;
		word32 s10_412;
		word32 s11_413;
		word32 t4_414;
		printf(ra, &g_t230B8560, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_396, out a0_397, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402, out a7_403, out s2_404, out s3_405, out s4_406, out s5_407, out s6_408, out s7_409, out s8_410, out s9_411, out s10_412, out s11_413, out t4_414);
	}
	else
	{
		Eq_2 a5_49;
		word32 a4_389;
		word32 a2_388;
		word32 a1_387;
		Eq_2 s4_107 = net_buf_simple_pull_le16(a5_42, out a1_387, out a2_388, out a4_389, out a5_49);
		Eq_2 a5_56;
		word32 a4_392;
		word32 a2_391;
		word32 a1_390;
		Eq_2 s2_106 = net_buf_simple_pull_le16(a5_49, out a1_390, out a2_391, out a4_392, out a5_56);
		Eq_2 s3_132 = a0_36;
		word32 a5_395;
		word32 a2_394;
		word32 a1_393;
		Eq_2 a5_64 = (word32) net_buf_simple_pull_u8(a5_56, out a1_393, out a2_394, out a5_395) - 0x0080 & 0x00FF;
		if (a5_64 <= 0x007E)
		{
			word32 s1_423;
			word32 a0_424;
			word32 a1_425;
			word32 a2_426;
			word32 a3_427;
			word32 a4_428;
			word32 a5_429;
			word32 a7_430;
			word32 s2_431;
			word32 s3_432;
			word32 s4_433;
			word32 s5_434;
			word32 s6_435;
			word32 s7_436;
			word32 s8_437;
			word32 s9_438;
			word32 s10_439;
			word32 s11_440;
			word32 t4_441;
			printf(ra, &g_t230B8544, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_423, out a0_424, out a1_425, out a2_426, out a3_427, out a4_428, out a5_429, out a7_430, out s2_431, out s3_432, out s4_433, out s5_434, out s6_435, out s7_436, out s8_437, out s9_438, out s10_439, out s11_440, out t4_441);
		}
		else
		{
			Eq_2 a6_111;
			Eq_2 a5_71;
			word32 a1_415;
			word32 a2_416;
			Eq_2 a0_68 = net_buf_simple_pull_u8(a5_64, out a1_415, out a2_416, out a5_71);
			Eq_2 a1_75;
			word32 a2_417;
			word32 a5_418;
			Eq_2 a0_74 = net_buf_simple_pull_u8(a5_71, out a1_75, out a2_417, out a5_418);
			Eq_2 s7_80 = *a2;
			word32 a1_419;
			word32 a3_420;
			word32 a4_421;
			word32 a5_422;
			Eq_2 a0_81 = bt_mesh_elem_find(a0_36, a1_75, out a1_419, out a3_420, out a4_421, out a5_422);
			if (a0_81 == 0x00)
			{
				a6_111.u0 = 0x01;
				bLoc31_289 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
			}
			else
			{
				Eq_2 a0_96;
				Eq_2 s8_108;
				word32 s1_442;
				word32 a3_443;
				word32 a4_444;
				s0_104 = get_model(a0_81, a2, fp + -49, out s1_442, out a0_96, out a3_443, out a4_444, out s2_106, out s4_107, out s8_108);
				a6_111.u0 = 0x02;
				if (a0_96 != 0x00)
				{
					Eq_2 a0_121;
					word32 s8_445;
					s0_104 = _mod_pub_set.isra.1(a0_96, a0_96, s4_107, (word32) (word12) s2_106, s2_106 >> 0x0C & 0x01, s8_108, a0_68, a0_74, s2_106, s4_107, mstatus, dwLoc3C, s4, s2, dwArg18, dwArg38, s9, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out a0_121, out s2_106, out s3_132, out s4_107, out s5_134, out s6_135, out s8_445);
					a6_111 = a0_121;
				}
			}
			send_mod_pub_status.isra.7(ra, s0_104, s5_134, s6_135, s3_132, s4_107, (word32) bLoc31_289, a6_111, s2_106, s4_107, s5_134, s6_135, s7_80, a0_68, s11, mstatus, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwArg18, dwArg28, dwArg2C, dwArg38, s9, s1, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgC4);
		}
	}
	0x00 = dwArg0198;
}

// 2303ECCC: void mod_pub_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register word32 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD4, Stack word32 dwArg0128)
void mod_pub_get(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, word32 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgD4, word32 dwArg0128)
{
	Eq_2 a1_25;
	word32 a5_297;
	word32 a2_295;
	word32 a4_296;
	Eq_2 a0_24 = net_buf_simple_pull_le16(a5, out a1_25, out a2_295, out a4_296, out a5_297);
	Eq_2 s2_58 = a0;
	byte bLoc21_187 = SLICE(s4, byte, 24);
	Eq_2 s0_22 = a2;
	if ((int32) (word16) a0_24 <= 0x00)
	{
		word32 s4_312;
		word32 s6_314;
		word32 s3_311;
		word32 s5_313;
		word32 s8_316;
		word32 s7_315;
		word32 a7_309;
		word32 s2_310;
		word32 a4_307;
		word32 a5_308;
		word32 a2_305;
		word32 a3_306;
		word32 a0_303;
		word32 a1_304;
		word32 s1_302;
		word32 s9_317;
		word32 s10_318;
		word32 s11_319;
		word32 t4_320;
		printf(ra, &g_t230B8560, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_302, out a0_303, out a1_304, out a2_305, out a3_306, out a4_307, out a5_308, out a7_309, out s2_310, out s3_311, out s4_312, out s5_313, out s6_314, out s7_315, out s8_316, out s9_317, out s10_318, out s11_319, out t4_320);
		goto l2303ECFC;
	}
	Eq_2 a6_100;
	Eq_2 a3_66;
	Eq_2 s4_32 = *a2;
	Eq_2 s1_31 = a0_24;
	word32 a5_301;
	word32 a3_299;
	word32 a4_300;
	word32 a1_298;
	Eq_2 a0_33 = bt_mesh_elem_find(a0_24, a1_25, out a1_298, out a3_299, out a4_300, out a5_301);
	if (a0_33 == 0x00)
	{
		a6_100.u0 = 0x01;
		bLoc21_187 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
	}
	else
	{
		word32 a0_48;
		struct Eq_206133 * a4_52;
		word32 a3_321;
		word32 s8_322;
		s0_22 = get_model(a0_33, a2, fp + -33, out s1_31, out a0_48, out a3_321, out a4_52, out s2_58, out s4_32, out s8_322);
		if (a0_48 != 0x00)
		{
			if (a4_52 != null)
			{
				a3_66 = (word32) a4_52->w0004;
				a6_100.u0 = 0x00;
				goto l2303ED46;
			}
			a6_100.u0 = 0x07;
		}
		else
			a6_100.u0 = 0x02;
	}
	a3_66.u0 = 0x00;
l2303ED46:
	send_mod_pub_status.isra.7(ra, s0_22, s2_58, a1, s1_31, a3_66, (word32) bLoc21_187, a6_100, s2_58, s4_32, s5, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgD4);
l2303ECFC:
	0x00 = dwArg0128;
}

// 2303ED62: void mod_sub_del(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register word32 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4, Stack word32 dwArg0128, Stack word32 dwArg0168)
void mod_sub_del(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, word32 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4, word32 dwArg0128, word32 dwArg0168)
{
	word32 a4_311;
	word32 a2_310;
	word32 a1_309;
	word32 a5_312;
	Eq_2 a0_24 = net_buf_simple_pull_le16(a5, out a1_309, out a2_310, out a4_311, out a5_312);
	Eq_2 s2_135 = a0;
	byte bLoc23_228 = SLICE(s4, byte, 8);
	byte bLoc24_250 = (byte) s4;
	Eq_2 s3_133 = a1;
	Eq_2 s0_137 = a2;
	Eq_2 a5_30 = (int32) (word16) a0_24;
	if (a5_30 <= 0x00)
	{
		word32 s1_320;
		word32 a0_321;
		word32 a1_322;
		word32 a2_323;
		word32 a3_324;
		word32 a4_325;
		word32 a5_326;
		word32 a7_327;
		word32 s2_328;
		word32 s3_329;
		word32 s4_330;
		word32 s5_331;
		word32 s6_332;
		word32 s7_333;
		word32 s8_334;
		word32 s9_335;
		word32 s10_336;
		word32 s11_337;
		word32 t4_338;
		printf(ra, &g_t230B8560, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_320, out a0_321, out a1_322, out a2_323, out a3_324, out a4_325, out a5_326, out a7_327, out s2_328, out s3_329, out s4_330, out s5_331, out s6_332, out s7_333, out s8_334, out s9_335, out s10_336, out s11_337, out t4_338);
	}
	else
	{
		Eq_2 a2_118;
		Eq_2 a1_34;
		word32 a2_313;
		word32 a4_314;
		word32 a5_315;
		word16 wLoc22_215 = (word16) net_buf_simple_pull_le16(a5_30, out a1_34, out a2_313, out a4_314, out a5_315);
		Eq_2 s4_129 = *a2;
		Eq_2 s1_131 = a0_24;
		word32 a1_316;
		word32 a3_317;
		word32 a4_318;
		word32 a5_319;
		Eq_2 a0_41 = bt_mesh_elem_find(a0_24, a1_34, out a1_316, out a3_317, out a4_318, out a5_319);
		if (a0_41 == 0x00)
		{
			a2_118.u0 = 0x01;
			bLoc23_228 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		}
		else
		{
			Eq_2 a0_55;
			Eq_2 a3_58;
			Eq_2 s8_67;
			word32 a4_339;
			get_model(a0_41, a2, fp + -35, out s1_131, out a0_55, out a3_58, out a4_339, out s2_135, out s4_129, out s8_67);
			s0_137 = a0_55;
			a2_118.u0 = 0x02;
			if (a0_55 != 0x00)
			{
				a2_118.u0 = 0x01;
				if ((word32) (word16) ((word32) wLoc22_215 + 0x04000000) <= 0x03FFFF00)
				{
					word32 a3_340;
					word32 s5_341;
					ra = bt_mesh_lpn_group_del(ra, s1_131, fp + -0x0022, 0x01, a3_58, 0x03FFFF00, s2_135, s6, s8_67, s9, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArg0168, out s0_137, out s1_131, out a3_340, out s2_135, out s3_133, out s4_129, out s5_341, out s6, out s7, out s9, out s11, out mstatus);
					word16 * a0_115 = bt_mesh_model_find_group(s0_137, (word32) wLoc22_215);
					a2_118.u0 = 0x00;
					if (a0_115 != null)
						*a0_115 = 0x00;
				}
			}
		}
		send_mod_sub_status(ra, s0_137, s1_131, s3_133, a2_118, s1_131, (word32) bLoc23_228, s2_135, s4_129, s6, s7, s9, s11, mstatus, dwLoc28, SEQ(wLoc22_215, bLoc23_228, bLoc24_250), dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg34, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4);
	}
	0x00 = dwArg0128;
}

// 2303EE26: void mod_sub_add(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register word32 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4, Stack word32 dwArg0128)
void mod_sub_add(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, word32 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4, word32 dwArg0128)
{
	word32 a5_362;
	word32 a4_361;
	word32 a1_359;
	word32 a2_360;
	Eq_2 a0_26 = net_buf_simple_pull_le16(a5, out a1_359, out a2_360, out a4_361, out a5_362);
	byte bLoc21_265 = SLICE(s4, byte, 24);
	word24 nLoc24_291 = (word24) s4;
	Eq_2 s4_113 = a1;
	Eq_2 s1_112 = a2;
	Eq_2 a5_32 = (int32) (word16) a0_26;
	if (a5_32 <= 0x00)
	{
		word32 t4_388;
		word32 s11_387;
		word32 s10_386;
		word32 s9_385;
		word32 s8_384;
		word32 s7_383;
		word32 s6_382;
		word32 s5_381;
		word32 s4_380;
		word32 s3_379;
		word32 s2_378;
		word32 a7_377;
		word32 a5_376;
		word32 a3_374;
		word32 a4_375;
		word32 a1_372;
		word32 a2_373;
		word32 s1_370;
		word32 a0_371;
		printf(ra, &g_t230B8560, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_370, out a0_371, out a1_372, out a2_373, out a3_374, out a4_375, out a5_376, out a7_377, out s2_378, out s3_379, out s4_380, out s5_381, out s6_382, out s7_383, out s8_384, out s9_385, out s10_386, out s11_387, out t4_388);
		goto l2303EE58;
	}
	Eq_2 a2_135;
	Eq_2 a1_36;
	word32 a5_365;
	word32 a4_364;
	word32 a2_363;
	Eq_2 s0_120 = net_buf_simple_pull_le16(a5_32, out a1_36, out a2_363, out a4_364, out a5_365);
	Eq_2 s2_123 = a0_26;
	word32 a4_368;
	word32 a5_369;
	word32 a1_366;
	word32 a3_367;
	Eq_2 a0_43 = bt_mesh_elem_find(a0_26, a1_36, out a1_366, out a3_367, out a4_368, out a5_369);
	if (a0_43 == 0x00)
	{
		a2_135.u0 = 0x01;
		bLoc21_265 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		goto l2303EE90;
	}
	Eq_2 a0_57;
	Eq_2 a3_60;
	Eq_2 s8_69;
	word32 a4_390;
	word32 s1_389;
	s0_120 = get_model(a0_43, a2, fp + -33, out s1_389, out a0_57, out a3_60, out a4_390, out s2_123, out s4_113, out s8_69);
	s1_112 = a0_57;
	a2_135.u0 = 0x02;
	if (a0_57 == 0x00)
		goto l2303EE90;
	a2_135.u0 = 0x01;
	if ((word32) (word16) ((word32) s0_120 + 0x04000000) <= 0x03FFFF00)
	{
		a2_135.u0 = 0x00;
		if (bt_mesh_model_find_group(a0_57, s0_120) != null)
			goto l2303EE90;
		if ((word32) *((word32) a0_57 + 16) != 0x00)
		{
			a2_135.u0 = 0x05;
			if ((word32) *((word32) a0_57 + 18) != 0x00)
				goto l2303EE90;
			((word32) a0_57 + 18)->u2 = (word16) s0_120;
		}
		else
			((word32) a0_57 + 16)->u2 = (word16) s0_120;
		word32 s3_391;
		ra = bt_mesh_lpn_group_add(ra, a0_57, s0_120, a3_60, s2_123, s4_113, s6, s8_69, s9, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, out s0_120, out s1_112, out s2_123, out s3_391, out s4_113, out s6, out s7, out s9, out s11, out mstatus);
		a2_135.u0 = 0x00;
	}
l2303EE90:
	send_mod_sub_status(ra, s0_120, s1_112, s4_113, a2_135, s2_123, (word32) bLoc21_265, s2_123, s4_113, s6, s7, s9, s11, mstatus, dwLoc28, SEQ(bLoc21_265, nLoc24_291), dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg34, dwArg38, dwArg48, dwArg4C, s5, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4);
l2303EE58:
	0x00 = dwArg0128;
}

