pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303EEF4: void mod_sub_va_del(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register word32 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4, Stack word32 dwArg0128, Stack word32 dwArg0168)
void mod_sub_va_del(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, word32 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4, word32 dwArg0128, word32 dwArg0168)
{
	word32 a5_333;
	word32 a4_332;
	word32 a2_331;
	word32 a1_330;
	Eq_2 a0_28 = net_buf_simple_pull_le16(a5, out a1_330, out a2_331, out a4_332, out a5_333);
	Eq_2 s2_106 = a0;
	byte bLoc23_250 = SLICE(s4, byte, 8);
	byte bLoc24_272 = (byte) s4;
	Eq_2 s3_107 = a1;
	Eq_2 s0_102 = a2;
	if ((int32) (word16) a0_28 <= 0x00)
	{
		word32 s1_340;
		word32 a0_341;
		word32 a1_342;
		word32 a2_343;
		word32 a3_344;
		word32 a4_345;
		word32 a5_346;
		word32 a7_347;
		word32 s2_348;
		word32 s3_349;
		word32 s4_350;
		word32 s5_351;
		word32 s6_352;
		word32 s7_353;
		word32 s8_354;
		word32 s9_355;
		word32 s10_356;
		word32 s11_357;
		word32 t4_358;
		printf(ra, &g_t230B8560, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_340, out a0_341, out a1_342, out a2_343, out a3_344, out a4_345, out a5_346, out a7_347, out s2_348, out s3_349, out s4_350, out s5_351, out s6_352, out s7_353, out s8_354, out s9_355, out s10_356, out s11_357, out t4_358);
	}
	else
	{
		word16 wLoc22_236;
		Eq_2 a2_129;
		Eq_2 a1_39;
		word32 a5_335;
		word32 a4_334;
		Eq_2 a0_38 = net_buf_simple_pull_mem(a2, 0x10, out a1_39, out a4_334, out a5_335);
		Eq_2 s4_108 = *a2;
		Eq_2 s1_103 = a0_28;
		Eq_2 s6_110 = a0_38;
		word32 a1_336;
		word32 a3_337;
		word32 a4_338;
		word32 a5_339;
		Eq_2 a0_45 = bt_mesh_elem_find(a0_28, a1_39, out a1_336, out a3_337, out a4_338, out a5_339);
		if (a0_45 == 0x00)
		{
			wLoc22_236 = 0x00;
			a2_129.u0 = 0x01;
			bLoc23_250 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		}
		else
		{
			word32 a0_59;
			Eq_2 s8_71;
			word32 a3_359;
			word32 a4_360;
			s0_102 = get_model(a0_45, a2, fp + -35, out s1_103, out a0_59, out a3_359, out a4_360, out s2_106, out s4_108, out s8_71);
			if (a0_59 == 0x00)
			{
				wLoc22_236 = 0x00;
				a2_129.u0 = 0x02;
			}
			else
			{
				s0_102.u0 = 1107379032;
				Eq_2 a3_81;
				word32 a1_361;
				word32 a2_362;
				word32 a4_363;
				word32 a5_364;
				if (memcmp(1107379036, a0_38, 0x10, out a1_361, out a2_362, out a3_81, out a4_363, out a5_364) != 0x00)
				{
					wLoc22_236 = 0x00;
					a2_129.u0 = 0x0C;
				}
				else
				{
					Eq_2 a4_86 = (word32) g_w4201435A;
					g_w42014358 = (word16) ((word32) g_w42014358 + ~0x00);
					a2_129.u0 = 0x00;
					wLoc22_236 = (word16) a4_86;
					if (a4_86 != 0x00)
					{
						Eq_2 s5_109;
						word32 a3_365;
						ra = bt_mesh_lpn_group_del(ra, s1_103, fp + -0x0022, 0x01, a3_81, a4_86, s2_106, a0_38, s8_71, s9, mstatus, dwLoc2C, s6, dwLoc18, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArg0168, out s0_102, out s1_103, out a3_365, out s2_106, out s3_107, out s4_108, out s5_109, out s6_110, out s7, out s9, out s11, out mstatus);
						word16 * a0_126 = bt_mesh_model_find_group(s5_109, (word32) wLoc22_236);
						a2_129.u0 = 0x0C;
						if (a0_126 != null)
						{
							*a0_126 = 0x00;
							a2_129.u0 = 0x00;
						}
					}
				}
			}
		}
		send_mod_sub_status(ra, s0_102, s1_103, s3_107, a2_129, s1_103, (word32) bLoc23_250, s2_106, s4_108, s6_110, s7, s9, s11, mstatus, s6, SEQ(wLoc22_236, bLoc23_250, bLoc24_272), dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg34, dwArg38, dwArg48, dwArg4C, s5, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4);
	}
	0x00 = dwArg0128;
}

// 2303EFE8: Register Eq_2 va_add(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 uint16) a1, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out (ptr32 uint16) s2Out, Register out ptr32 s3Out, Register out Eq_206840 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      mod_pub_va_set
//      mod_sub_va_add
//      mod_sub_va_overwrite
Eq_2 va_add(Eq_2 ra, Eq_2 a0, uint16 * a1, Eq_2 dwArg38, ptr32 & a0Out, ptr32 & a3Out, uint16 & s2Out, ptr32 & s3Out, union Eq_206840 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	ptr32 a3_104;
	ptr32 a5_40;
	Eq_2 s1_114 = a0;
	if ((word32) g_w42014358 != 0x00)
	{
		a5_40 = 0x05;
		word32 a1_155;
		word32 a2_156;
		word32 a4_157;
		word32 a5_158;
		if (memcmp(1107379036, a0, 0x10, out a1_155, out a2_156, out a3_104, out a4_157, out a5_158) != 0x00)
			goto l2303F028;
		*a1 = (word16) (word32) g_w4201435A;
		g_w42014358 = (word16) ((word32) g_w42014358 + 0x01);
	}
	else
	{
		int32 a0_19;
		Eq_2 s0_27 = bt_mesh_virtual_addr(ra, out s1_114, out a0_19, out a3_104, out s3, out s4, out s5, out s8);
		a5_40 = 0x10;
		if (a0_19 < 0x00)
			goto l2303F028;
		*s0_27 = 0x01;
		*((word32) s0_27 + 2) = (word16) (word32) *a1;
		word32 a1_159;
		word32 a2_160;
		word32 a4_161;
		word32 a5_162;
		word32 a6_163;
		word32 a7_164;
		memcpy((word32) s0_27 + 4, s1_114, 0x10, out a1_159, out a2_160, out a3_104, out a4_161, out a5_162, out a6_163, out a7_164);
	}
	a5_40 = 0x00;
l2303F028:
	0x00 = (int8) dwArg38;
	a0Out = a5_40;
	a3Out = a3_104;
	s2Out = a1;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s8Out = s8;
	return s1_114;
}

