pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303F05C: void mod_pub_va_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s4, Register word32 s8, Register Eq_2 s9, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack word32 dwArg0198)
void mod_pub_va_set(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s2, Eq_2 s4, word32 s8, Eq_2 s9, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgE8, word32 dwArg0198)
{
	word32 a5_443;
	word32 a4_442;
	word32 a2_441;
	word32 a1_440;
	Eq_2 a0_36 = net_buf_simple_pull_le16(a5, out a1_440, out a2_441, out a4_442, out a5_443);
	Eq_2 s4_107 = a0;
	uint16 wLoc32_329 = SLICE(s8, uint16, 16);
	byte bLoc33_345 = SLICE(s8, byte, 8);
	Eq_2 s5_125 = a1;
	Eq_2 s0_104 = a2;
	if ((int32) (word16) a0_36 <= 0x00)
	{
		word32 a2_455;
		word32 a1_454;
		word32 a0_453;
		word32 s1_452;
		word32 a3_456;
		word32 a4_457;
		word32 a5_458;
		word32 a7_459;
		word32 s2_460;
		word32 s3_461;
		word32 s4_462;
		word32 s5_463;
		word32 s6_464;
		word32 s7_465;
		word32 s8_466;
		word32 s9_467;
		word32 s10_468;
		word32 s11_469;
		word32 t4_470;
		printf(ra, &g_t230B8560, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_452, out a0_453, out a1_454, out a2_455, out a3_456, out a4_457, out a5_458, out a7_459, out s2_460, out s3_461, out s4_462, out s5_463, out s6_464, out s7_465, out s8_466, out s9_467, out s10_468, out s11_469, out t4_470);
	}
	else
	{
		Eq_2 a5_49;
		word32 a4_445;
		word32 a1_444;
		net_buf_simple_pull_mem(a2, 0x10, out a1_444, out a4_445, out a5_49);
		Eq_2 a5_56;
		word32 a4_448;
		word32 a2_447;
		word32 a1_446;
		Eq_2 s2_106 = net_buf_simple_pull_le16(a5_49, out a1_446, out a2_447, out a4_448, out a5_56);
		word32 a5_451;
		word32 a2_450;
		word32 a1_449;
		Eq_2 a0_59 = net_buf_simple_pull_u8(a5_56, out a1_449, out a2_450, out a5_451);
		Eq_2 s3_123 = a0_36;
		Eq_2 a5_64 = (word32) a0_59 - 0x0080 & 0x00FF;
		if (a5_64 <= 0x007E)
		{
			word32 s1_479;
			word32 a0_480;
			word32 a1_481;
			word32 a2_482;
			word32 a3_483;
			word32 a4_484;
			word32 a5_485;
			word32 a7_486;
			word32 s2_487;
			word32 s3_488;
			word32 s4_489;
			word32 s5_490;
			word32 s6_491;
			word32 s7_492;
			word32 s8_493;
			word32 s9_494;
			word32 s10_495;
			word32 s11_496;
			word32 t4_497;
			printf(ra, &g_t230B8544, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_479, out a0_480, out a1_481, out a2_482, out a3_483, out a4_484, out a5_485, out a7_486, out s2_487, out s3_488, out s4_489, out s5_490, out s6_491, out s7_492, out s8_493, out s9_494, out s10_495, out s11_496, out t4_497);
		}
		else
		{
			Eq_2 a0_144;
			Eq_2 a5_71;
			word32 a1_471;
			word32 a2_472;
			Eq_2 a0_68 = net_buf_simple_pull_u8(a5_64, out a1_471, out a2_472, out a5_71);
			Eq_2 a1_75;
			word32 a2_473;
			word32 a5_474;
			Eq_2 a0_74 = net_buf_simple_pull_u8(a5_71, out a1_75, out a2_473, out a5_474);
			Eq_2 s6_158 = *a2;
			word32 a1_475;
			word32 a3_476;
			word32 a4_477;
			word32 a5_478;
			Eq_2 a0_81 = bt_mesh_elem_find(a0_36, a1_75, out a1_475, out a3_476, out a4_477, out a5_478);
			if (a0_81 == 0x00)
			{
				wLoc32_329 = 0x00;
				a0_144.u0 = 0x01;
				bLoc33_345 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
			}
			else
			{
				word32 a0_96;
				word32 s1_498;
				word32 a3_499;
				word32 a4_500;
				word32 s8_501;
				s0_104 = get_model(a0_81, a2, fp + -0x0033, out s1_498, out a0_96, out a3_499, out a4_500, out s2_106, out s4_107, out s8_501);
				if (a0_96 == 0x00)
				{
					wLoc32_329 = 0x00;
					a0_144.u0 = 0x02;
				}
				else
				{
					int32 a0_113;
					Eq_2 s1_122;
					word32 a3_502;
					word32 s8_503;
					s0_104 = bt_mesh_virtual_addr(ra, out s1_122, out a0_113, out a3_502, out s3_123, out s4_107, out s5_125, out s8_503);
					if (a0_113 < 0x00)
					{
						wLoc32_329 = 0x00;
						a0_144.u0 = 0x10;
					}
					else
					{
						Eq_2 s8_159;
						s0_104 = _mod_pub_set.isra.1(s1_122, s1_122, (word32) wLoc32_329, (word32) (word12) s2_106, s2_106 >> 0x0C & 0x01, a0_59, a0_68, a0_74, s2_106, s4_107, mstatus, dwLoc3C, s4, s2, dwArg18, dwArg38, s9, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out a0_144, out s2_106, out s3_123, out s4_107, out s5_125, out s6_158, out s8_159);
						if (a0_144 == 0x00)
						{
							word32 a3_504;
							word32 s8_505;
							va_add(ra, s8_159, fp + -50, dwLoc08, out a0_144, out a3_504, out s2_106, out s3_123, out s4_107, out s5_125, out s8_505);
						}
					}
				}
			}
			send_mod_pub_status.isra.7(ra, s0_104, s4_107, s5_125, s3_123, (word32) wLoc32_329, (word32) bLoc33_345, a0_144, s2_106, s4_107, s5_125, s6_158, a0_59, a0_68, s11, mstatus, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwArg18, dwArg28, dwArg2C, dwArg38, s9, s1, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgC4);
		}
	}
	0x00 = dwArg0198;
}

// 2303F194: void mod_sub_va_add(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register word32 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4, Stack word32 dwArg0128)
void mod_sub_va_add(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, word32 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE4, word32 dwArg0128)
{
	word32 a5_390;
	word32 a4_389;
	word32 a1_387;
	word32 a2_388;
	Eq_2 a0_26 = net_buf_simple_pull_le16(a5, out a1_387, out a2_388, out a4_389, out a5_390);
	uint16 wLoc22_258 = SLICE(s4, uint16, 16);
	uint8 bLoc23_293 = SLICE(s4, byte, 8);
	uint8 bLoc24_319 = (byte) s4;
	Eq_2 s4_134 = a1;
	Eq_2 s0_141 = a2;
	if ((int32) (word16) a0_26 <= 0x00)
	{
		word32 t4_415;
		word32 s11_414;
		word32 s10_413;
		word32 s9_412;
		word32 s8_411;
		word32 s7_410;
		word32 s6_409;
		word32 s5_408;
		word32 s4_407;
		word32 s3_406;
		word32 s2_405;
		word32 a7_404;
		word32 a4_402;
		word32 a5_403;
		word32 a2_400;
		word32 a3_401;
		word32 a0_398;
		word32 a1_399;
		word32 s1_397;
		printf(ra, &g_t230B8560, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_397, out a0_398, out a1_399, out a2_400, out a3_401, out a4_402, out a5_403, out a7_404, out s2_405, out s3_406, out s4_407, out s5_408, out s6_409, out s7_410, out s8_411, out s9_412, out s10_413, out s11_414, out t4_415);
		goto l2303F1C6;
	}
	Eq_2 s1_104;
	Eq_2 a1_37;
	word32 a5_392;
	word32 a4_391;
	net_buf_simple_pull_mem(a2, 0x10, out a1_37, out a4_391, out a5_392);
	Eq_2 s2_144 = a0_26;
	word32 a5_396;
	word32 a3_394;
	word32 a4_395;
	word32 a1_393;
	Eq_2 a0_43 = bt_mesh_elem_find(a0_26, a1_37, out a1_393, out a3_394, out a4_395, out a5_396);
	if (a0_43 == 0x00)
	{
		wLoc22_258 = 0x00;
		s1_104.u0 = 0x01;
		bLoc23_293 = (byte) (word32) ((word32) *((word32) a2 + 4) < ~0x04);
		goto l2303F204;
	}
	Eq_2 a0_57;
	Eq_2 s1_66;
	word32 s8_418;
	word32 a4_417;
	word32 a3_416;
	get_model(a0_43, a2, fp + -35, out s1_66, out a0_57, out a3_416, out a4_417, out s2_144, out s4_134, out s8_418);
	s0_141 = a0_57;
	if (a0_57 == 0x00)
	{
		wLoc22_258 = 0x00;
		s1_104.u0 = 0x02;
		goto l2303F204;
	}
	Eq_2 a0_74;
	Eq_2 a3_77;
	Eq_2 s8_87;
	word32 s5_420;
	word32 s3_419;
	va_add(ra, s1_66, fp + -0x0022, dwArg08, out a0_74, out a3_77, out s2_144, out s3_419, out s4_134, out s5_420, out s8_87);
	s1_104 = a0_74;
	if (a0_74 != 0x00 || bt_mesh_model_find_group(a0_57, (word32) wLoc22_258) != null)
		goto l2303F204;
	word32 a5_102;
	if ((word32) *((word32) a0_57 + 16) != 0x00)
	{
		if ((word32) *((word32) a0_57 + 18) != 0x00)
		{
			s1_104.u0 = 0x05;
			goto l2303F204;
		}
		a5_102 = 0x01;
	}
	else
		a5_102 = 0x00;
	Eq_2 a0_108 = (word32) wLoc22_258;
	*((word32) a0_57 + (a5_102 + 0x08) * 0x02) = (word16) a0_108;
	word32 s3_421;
	ra = bt_mesh_lpn_group_add(ra, a0_74, a0_108, a3_77, s2_144, s4_134, s6, s8_87, s9, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg18, dwArg28, dwArg30, dwArg34, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, out s0_141, out s1_104, out s2_144, out s3_421, out s4_134, out s6, out s7, out s9, out s11, out mstatus);
l2303F204:
	send_mod_sub_status(ra, s0_141, s1_104, s4_134, s1_104, s2_144, (word32) bLoc23_293, s2_144, s4_134, s6, s7, s9, s11, mstatus, dwLoc28, SEQ(wLoc22_258, bLoc23_293, bLoc24_319), dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg34, dwArg38, dwArg48, dwArg4C, s5, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4);
l2303F1C6:
	0x00 = dwArg0128;
}

// 2303F276: void dev_comp_data_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC4)
void dev_comp_data_get(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgC4)
{
	Eq_2 s5_11 = a0;
	Eq_2 s6_230 = a1;
	word32 a1_553;
	word32 a2_554;
	Eq_2 a5_37;
	if (net_buf_simple_pull_u8(fp + -0x0078, out a1_553, out a2_554, out a5_37) != 0x00)
	{
		word32 s8_573;
		word32 s10_574;
		word32 t4_575;
		word32 a7_569;
		word32 s4_572;
		word32 s2_570;
		word32 s3_571;
		word32 a4_568;
		word32 a2_567;
		word32 a1_566;
		word32 a0_565;
		word32 s1_564;
		ra = printf(ra, &g_t230B81F0, a3, 0x00480000, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_564, out a0_565, out a1_566, out a2_567, out a3, out a4_568, out a5_37, out a7_569, out s2_570, out s3_571, out s4_572, out s5_11, out s6_230, out s7, out s8_573, out s9, out s10_574, out s11, out t4_575);
	}
	Eq_2 a5_72;
	word32 a1_555;
	word32 a4_557;
	word32 a2_556;
	bt_mesh_model_msg_init(0x02, a5_37, out a1_555, out a2_556, out a4_557, out a5_72);
	word32 a5_558;
	net_buf_simple_add_u8(fp + -0x0084, 0x00, a5_72, out a5_558);
	Eq_2 a5_81;
	struct Eq_189068 * a0_80 = bt_mesh_comp_get(out a5_81);
	Eq_2 a5_89;
	word32 a4_559;
	net_buf_simple_add_le16(fp + -0x0084, (word32) a0_80->w0000, a5_81, out a4_559, out a5_89);
	Eq_2 a5_96;
	word32 a4_560;
	net_buf_simple_add_le16(fp + -0x0084, (word32) a0_80->w0002, a5_89, out a4_560, out a5_96);
	Eq_2 a5_103;
	word32 a4_561;
	net_buf_simple_add_le16(fp + -0x0084, (word32) a0_80->w0004, a5_96, out a4_561, out a5_103);
	Eq_2 a5_109;
	word32 a4_562;
	net_buf_simple_add_le16(fp + -0x0084, 0x05, a5_103, out a4_562, out a5_109);
	word32 a4_563;
	Eq_2 a5_115;
	net_buf_simple_add_le16(fp + -0x0084, 0x0F, a5_109, out a4_563, out a5_115);
	Eq_2 s2_119 = 0x00;
	while (true)
	{
		struct Eq_274 * a0_225;
		Eq_2 a3_207;
		Eq_2 ra_210;
		Eq_2 s1_118 = *((word32) a5_115 + 8);
		if (s2_119 >= a5_115)
			break;
		s0 = (word32) a5_115 + (s2_119 << 0x04);
		word32 a4_576;
		Eq_2 a0_125 = net_buf_simple_tailroom(fp + -0x0084, out a4_576);
		word32 a5_132 = Mem33[s0 + 4:byte] + Mem33[s0 + 5:byte] + 0x02 << 1;
		if (a0_125 < a5_132)
		{
			word32 t4_621;
			word32 s8_617;
			word32 s11_620;
			word32 s9_618;
			word32 s10_619;
			word32 s4_613;
			word32 s7_616;
			word32 s5_614;
			word32 s6_615;
			word32 a5_609;
			word32 s3_612;
			word32 a7_610;
			word32 s2_611;
			word32 a0_605;
			word32 a4_608;
			word32 a1_606;
			word32 a2_607;
			word32 s1_604;
			ra_210 = printf(ra, &g_t230B8214, a3, 0x00480000, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_604, out a0_605, out a1_606, out a2_607, out a3_207, out a4_608, out a5_609, out a7_610, out s2_611, out s3_612, out s4_613, out s5_614, out s6_615, out s7_616, out s8_617, out s9_618, out s10_619, out s11_620, out t4_621);
			a0_225 = (struct Eq_274 *) &g_t230B8234;
			goto l2303F34E;
		}
		Eq_2 a5_139;
		word32 a4_602;
		net_buf_simple_add_le16(fp + -0x0084, (word32) *((word32) s0 + 2), a5_132, out a4_602, out a5_139);
		Eq_2 a5_144;
		net_buf_simple_add_u8(fp + -0x0084, (word32) *((word32) s0 + 4), a5_139, out a5_144);
		word32 a5_603;
		net_buf_simple_add_u8(fp + -0x0084, (word32) *((word32) s0 + 5), a5_144, out a5_603);
		struct Eq_207759 * s3_135 = (struct Eq_207759 *) 0x1C;
		while (true)
		{
			struct Eq_207759 * a5_152 = (word32) *((word32) s0 + 4);
			if (s3_135 >= a5_152)
				break;
			word32 a5_160 = a5_152 + (s3_135 + 0x00);
			s0 = a5_152->t0008;
			word32 a4_622;
			word32 a5_623;
			net_buf_simple_add_le16(fp + -0x0084, (word32) *a5_160, a5_160, out a4_622, out a5_623);
			s3_135 = (struct Eq_207759 *) ((char *) s3_135 + 1);
		}
		Eq_2 s3_166 = 0x1C;
		while (true)
		{
			a5_115 = (word32) *((word32) s0 + 5);
			if (s3_166 >= a5_115)
				break;
			Eq_2 a5_172 = s3_166;
			s7 = Mem33[s0 + 0x0C:int32] + a5_172;
			Eq_2 a5_182;
			word32 a4_624;
			net_buf_simple_add_le16(fp + -0x0084, (word32) *s7, a5_172, out a4_624, out a5_182);
			word32 a4_625;
			word32 a5_626;
			net_buf_simple_add_le16(fp + -0x0084, (word32) *((word32) s7 + 2), a5_182, out a4_625, out a5_626);
			s3_166 = (word32) s3_166 + 1;
		}
		s2_119 = (word32) s2_119 + 1;
	}
	word32 a0_261;
	word32 a5_581;
	word32 mstatus_582;
	word32 s0_577;
	word32 a4_580;
	word32 s1_578;
	word32 a2_579;
	ra_210 = bt_mesh_model_send(ra, s0, s1_118, s5_11, s6_230, fp + -0x0084, 0x00, s2_119, 0x1C, s6_230, s7, s9, s11, mstatus, dwLoc78, dwLoc74, dwLoc70, dwLoc6C, dwLoc68, dwLoc64, dwLoc5C, dwLoc48, dwLoc44, dwLoc28, dwLoc24, dwLoc1C, dwLoc18, fp + -0x0078, dwArg08, dwArg18, s5, dwArg38, dwArg48, dwArg58, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgC4, out s0_577, out s1_578, out a0_261, out a2_579, out a3_207, out a4_580, out a5_581, out mstatus_582);
	if (a0_261 != 0x00)
	{
		a0_225 = (struct Eq_274 *) &g_t230B8258;
l2303F34E:
		word32 t4_601;
		word32 s8_597;
		word32 s11_600;
		word32 s9_598;
		word32 s10_599;
		word32 s4_593;
		word32 s7_596;
		word32 s5_594;
		word32 s6_595;
		word32 a5_589;
		word32 s3_592;
		word32 a7_590;
		word32 s2_591;
		word32 a1_585;
		word32 a4_588;
		word32 a2_586;
		word32 a3_587;
		word32 a0_584;
		word32 s1_583;
		printf(ra_210, a0_225, a3_207, 0x00480000, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_583, out a0_584, out a1_585, out a2_586, out a3_587, out a4_588, out a5_589, out a7_590, out s2_591, out s3_592, out s4_593, out s5_594, out s6_595, out s7_596, out s8_597, out s9_598, out s10_599, out s11_600, out t4_601);
	}
}

