pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303F3D6: Register Eq_2 app_key_set(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register word32 a3, Register out ptr32 a0Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s4Out)
// Called from:
//      app_key_update
//      app_key_add
Eq_2 app_key_set(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, word32 a3, ptr32 & a0Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s4Out)
{
	ptr32 a0_121;
	Eq_2 s1_23 = a2;
	word32 a4_276;
	word32 a3_275;
	Eq_2 a5_109;
	Eq_2 a0_26 = bt_mesh_subnet_get(a0, out a3_275, out a4_276, out a5_109);
	if (a0_26 != 0x00)
	{
		word32 a4_278;
		word32 a3_277;
		Eq_2 a0_32 = bt_mesh_app_key_find(a1, out a3_277, out a4_278, out a5_109);
		Eq_2 s0_37 = a0_32;
		if (a3 != 0x00)
		{
			a0_121 = 0x03;
			if (a0_32 == 0x00)
				goto l2303F41C;
			a5_109 = (word32) *a0_32;
			a0_121 = 0x11;
			if (a5_109 == a0)
			{
				a5_109 = (word32) *((word32) a0_26 + 31);
				if (a5_109 != 0x01)
				{
l2303F41A:
					a0_121 = 11;
					goto l2303F41C;
				}
				if ((word32) *((word32) a0_32 + 4) != 0x00)
				{
					word32 a1_279;
					word32 a2_280;
					word32 a3_281;
					word32 a4_282;
					if (memcmp((word32) a0_32 + 23, a2, 0x10, out a1_279, out a2_280, out a3_281, out a4_282, out a5_109) != 0x00)
						goto l2303F41A;
					goto l2303F442;
				}
				*((word32) a0_32 + 4) = (byte) a5_109;
l2303F44E:
				word32 a0_80;
				word32 s3_90;
				word32 s4_91;
				word32 s5_92;
				struct Eq_207958 * s0_88 = bt_mesh_k4(ra, s0_37, out s1_23, out a0_80, out a5_109, out s3_90, out s4_91, out s5_92);
				if (a0_80 != 0x00)
				{
					a0_121 = 0x09;
					if (s4_91 != 0x00)
						s0_88->b0004 = 0x00;
					goto l2303F41C;
				}
				s0_88->w0000 = (word16) a0;
				s0_88->w0002 = (word16) s3_90;
				word32 a6_287;
				word32 a2_284;
				word32 a3_285;
				word32 a1_283;
				word32 a4_286;
				word32 a7_288;
				memcpy(s5_92 + 1, s1_23, 0x10, out a1_283, out a2_284, out a3_285, out a4_286, out a5_109, out a6_287, out a7_288);
l2303F442:
				a0_121 = 0x00;
				goto l2303F41C;
			}
			goto l2303F41C;
		}
		if (a0_32 == 0x00)
		{
			a5_109.u0 = 0x0FFFFFFF;
			if ((word32) g_w4200D870 != 0x0FFFFFFF)
			{
				a0_121 = 0x05;
				if ((word32) g_w4200D898 != 0x0FFFFFFF)
					goto l2303F41C;
				s0_37.u0 = 0x4200D898;
			}
			else
				s0_37.u0 = 0x4200D870;
			goto l2303F44E;
		}
		Eq_2 s3_38 = (word32) *a0_32;
		if (s3_38 == a0)
		{
			word32 a2_290;
			word32 a1_289;
			word32 a3_291;
			word32 a4_292;
			if (memcmp((word32) a0_32 + 6, a2, 0x10, out a1_289, out a2_290, out a3_291, out a4_292, out a5_109) == 0x00)
				goto l2303F442;
			a5_109 = (word32) *a0_32;
			a0_121 = 0x06;
			if (a5_109 == s3_38)
			{
l2303F41C:
				a0Out = a0_121;
				a5Out = a5_109;
				s2Out = a0;
				s4Out = dwArg04;
				return s1_23;
			}
		}
	}
	a0_121 = 0x04;
	goto l2303F41C;
}

// 2303F4D4: void app_key_update(Register Eq_2 ra, Register (ptr32 Eq_204258) a3, Register (ptr32 Eq_204259) a4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack word32 dwArg0128)
void app_key_update(Eq_2 ra, struct Eq_204258 * a3, struct Eq_204259 * a4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, word32 dwArg0128)
{
	Eq_2 a2_39;
	word32 a5_228;
	word32 a4_227;
	word32 a1_226;
	bt_mesh_model_msg_init(0x08000003, key_idx_unpack(fp + -44, fp + -42, a3, a4), out a1_226, out a2_39, out a4_227, out a5_228);
	Eq_2 a0_48;
	Eq_2 a5_52;
	Eq_2 s2_56;
	Eq_2 s4_58;
	Eq_2 s1_55 = app_key_set(ra, (word32) wLoc2C, (word32) wLoc2A, a2_39, 0x01, out a0_48, out a5_52, out s2_56, out s4_58);
	word32 a5_229;
	net_buf_simple_add_u8(fp + -28, a0_48, a5_52, out a5_229);
	word32 a0_96;
	Eq_2 a3_99;
	word32 s0_230;
	word32 s1_231;
	word32 a2_232;
	word32 a4_233;
	word32 a5_234;
	word32 mstatus_235;
	Eq_2 ra_105 = bt_mesh_model_send(ra, key_idx_pack(fp + -28, (word32) wLoc2C, (word32) wLoc2A), s1_55, s1_55, s2_56, fp + -28, 0x00, s2_56, s4_58, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -40, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_230, out s1_231, out a0_96, out a2_232, out a3_99, out a4_233, out a5_234, out mstatus_235);
	if (a0_96 != 0x00)
	{
		word32 s1_236;
		word32 a0_237;
		word32 a1_238;
		word32 a2_239;
		word32 a3_240;
		word32 a4_241;
		word32 a5_242;
		word32 a7_243;
		word32 s2_244;
		word32 s3_245;
		word32 s4_246;
		word32 s5_247;
		word32 s6_248;
		word32 s7_249;
		word32 s8_250;
		word32 s9_251;
		word32 s10_252;
		word32 s11_253;
		word32 t4_254;
		printf(ra_105, &g_t230B7DDC, a3_99, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_236, out a0_237, out a1_238, out a2_239, out a3_240, out a4_241, out a5_242, out a7_243, out s2_244, out s3_245, out s4_246, out s5_247, out s6_248, out s7_249, out s8_250, out s9_251, out s10_252, out s11_253, out t4_254);
	}
	0x00 = dwArg0128;
}

// 2303F556: void app_key_add(Register Eq_2 ra, Register (ptr32 Eq_204258) a3, Register (ptr32 Eq_204259) a4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack word32 dwArg0128)
void app_key_add(Eq_2 ra, struct Eq_204258 * a3, struct Eq_204259 * a4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, word32 dwArg0128)
{
	Eq_2 a2_39;
	word32 a5_228;
	word32 a4_227;
	word32 a1_226;
	bt_mesh_model_msg_init(0x08000003, key_idx_unpack(fp + -44, fp + -42, a3, a4), out a1_226, out a2_39, out a4_227, out a5_228);
	Eq_2 a0_48;
	Eq_2 a5_52;
	Eq_2 s2_56;
	Eq_2 s4_58;
	Eq_2 s1_55 = app_key_set(ra, (word32) wLoc2C, (word32) wLoc2A, a2_39, 0x00, out a0_48, out a5_52, out s2_56, out s4_58);
	word32 a5_229;
	net_buf_simple_add_u8(fp + -28, a0_48, a5_52, out a5_229);
	word32 a0_96;
	Eq_2 a3_99;
	word32 s0_230;
	word32 s1_231;
	word32 a2_232;
	word32 a4_233;
	word32 a5_234;
	word32 mstatus_235;
	Eq_2 ra_105 = bt_mesh_model_send(ra, key_idx_pack(fp + -28, (word32) wLoc2C, (word32) wLoc2A), s1_55, s1_55, s2_56, fp + -28, 0x00, s2_56, s4_58, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -40, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_230, out s1_231, out a0_96, out a2_232, out a3_99, out a4_233, out a5_234, out mstatus_235);
	if (a0_96 != 0x00)
	{
		word32 s1_236;
		word32 a0_237;
		word32 a1_238;
		word32 a2_239;
		word32 a3_240;
		word32 a4_241;
		word32 a5_242;
		word32 a7_243;
		word32 s2_244;
		word32 s3_245;
		word32 s4_246;
		word32 s5_247;
		word32 s6_248;
		word32 s7_249;
		word32 s8_250;
		word32 s9_251;
		word32 s10_252;
		word32 s11_253;
		word32 t4_254;
		printf(ra_105, &g_t230B7DDC, a3_99, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_236, out a0_237, out a1_238, out a2_239, out a3_240, out a4_241, out a5_242, out a7_243, out s2_244, out s3_245, out s4_246, out s5_247, out s6_248, out s7_249, out s8_250, out s9_251, out s10_252, out s11_253, out t4_254);
	}
	0x00 = dwArg0128;
}

