pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303F5D8: Register Eq_2 hb_pwr2.constprop.15(Register Eq_2 a0)
// Called from:
//      hb_publish
//      heartbeat_pub_set
//      heartbeat_sub_set
Eq_2 hb_pwr2.constprop.15(Eq_2 a0)
{
	if (a0 == 0x00)
		return 0x00;
	if (a0 == 0x00FF || a0 == 0x11)
		return 0x0FFFFFFF;
	return (word32) (word16) (0x01 << (word32) a0 - 1);
}

// 2303F602: void hb_publish(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_208379) a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void hb_publish(Eq_2 ra, Eq_2 s0, struct Eq_208379 * a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	Eq_2 a4_14;
	Eq_2 a3_16;
	word32 a5_229;
	if (bt_mesh_subnet_get((word32) a0->w002C, out a3_16, out a4_14, out a5_229) == 0x00)
	{
		word32 s1_230;
		word32 a0_231;
		word32 a1_232;
		word32 a2_233;
		word32 a3_234;
		word32 a4_235;
		word32 a5_236;
		word32 a7_237;
		word32 s2_238;
		word32 s3_239;
		word32 s4_240;
		word32 s5_241;
		word32 s6_242;
		word32 s7_243;
		word32 s8_244;
		word32 s9_245;
		word32 s10_246;
		word32 s11_247;
		word32 t4_248;
		printf(ra, &g_t230B832C, a3_16, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_230, out a0_231, out a1_232, out a2_233, out a3_234, out a4_235, out a5_236, out a7_237, out s2_238, out s3_239, out s4_240, out s5_241, out s6_242, out s7_243, out s8_244, out s9_245, out s10_246, out s11_247, out t4_248);
		a0->w0024 = 0x00;
	}
	else
	{
		up32 s1_17 = (word32) a0->w0026;
		if (s1_17 != 0x00)
		{
			uint32 a1_23 = hb_pwr2.constprop.15((word32) a0->b0028) + 1000 << 16;
			if (a1_23 >> 16 != 0x00 && s1_17 > 0x01)
			{
				word32 s1_263;
				word32 a0_264;
				word32 a1_265;
				word32 a2_266;
				word32 a3_267;
				word32 a4_268;
				word32 a5_269;
				k_delayed_work_submit(a1_23 >> 16, a3_16, a4_14, mstatus, s0, dwLoc08, dwArg14, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_263, out a0_264, out a1_265, out a2_266, out a3_267, out a4_268, out a5_269, out s2, out s3, out s4, out s5, out s6, out s8);
			}
			struct Eq_208495 * s0_76;
			word32 s1_249;
			word32 a3_250;
			word32 a4_251;
			word32 a5_252;
			word32 s2_253;
			word32 s3_254;
			word32 s4_255;
			word32 s5_256;
			word32 s6_257;
			word32 s7_258;
			word32 s8_259;
			word32 s9_260;
			word32 s11_261;
			word32 mstatus_262;
			bt_mesh_heartbeat_send(ra, s2, s3, s4, s5, s6, s7, s8, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_76, out s1_249, out a3_250, out a4_251, out a5_252, out s2_253, out s3_254, out s4_255, out s5_256, out s6_257, out s7_258, out s8_259, out s9_260, out s11_261, out mstatus_262);
			word32 a5_98 = (word32) s0_76->w0026;
			if (a5_98 != 0x0FFFFFFF)
				s0_76->w0026 = (word16) (a5_98 + ~0x00);
		}
	}
}

// 2303F674: void heartbeat_pub_set(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_208568) s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack word32 dwArg0128, Stack Eq_2 dwArg0148)
void heartbeat_pub_set(Eq_2 ra, Eq_2 s0, struct Eq_208568 * s1, Eq_2 a1, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgF8, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0108, word32 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_133;
	Eq_2 s5_124 = a1;
	Eq_2 s2_117 = (word32) *((word32) s0 + 1) << 8 | (word32) (*s0);
	if ((s2_117 ^ 0x08000000) >= 0x04000000)
	{
		if (((word32) *((word32) s0 + 2) + ~0x11 & 0x00FF) > 0x00EC && (word32) (*((word32) s0 + 3)) <= 0x10)
		{
			struct Eq_274 * a0_227;
			if (((word32) *((word32) s0 + 4) ^ 0x0080) <= 0x007E)
			{
				a0_227 = (struct Eq_274 *) &g_t230B8544;
				goto l2303F6D8;
			}
			Eq_2 a1_44 = (word32) *((word32) s0 + 8) << 8 | (word32) (*((word32) s0 + 7));
			if (a1_44 >= 0x01000000)
			{
				a0_227 = (struct Eq_274 *) &g_t230B83E8;
l2303F6D8:
				0x00 = dwArg0128;
				word32 t4_487;
				word32 s7_482;
				word32 s10_485;
				word32 s11_486;
				word32 s8_483;
				word32 s9_484;
				word32 s2_477;
				word32 s5_480;
				word32 s6_481;
				word32 s3_478;
				word32 s4_479;
				word32 a5_475;
				word32 a7_476;
				word32 a4_474;
				word32 a0_470;
				word32 s1_469;
				word32 a1_471;
				word32 a2_472;
				word32 a3_473;
				printf(ra, a0_227, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_469, out a0_470, out a1_471, out a2_472, out a3_473, out a4_474, out a5_475, out a7_476, out s2_477, out s3_478, out s4_479, out s5_480, out s6_481, out s7_482, out s8_483, out s9_484, out s10_485, out s11_486, out t4_487);
				return;
			}
			ui32 s3_51 = (word32) *((word32) s0 + 6) << 8 | (word32) (*((word32) s0 + 5));
			Eq_2 a4_54;
			Eq_2 a3_56;
			word32 a5_488;
			if (bt_mesh_subnet_get(a1_44, out a3_56, out a4_54, out a5_488) != 0x00)
			{
				s1->t0030 = (word16) s2_117;
				word32 a5_62 = (word32) *((word32) s0 + 3);
				s1->w0036 = (word16) (s3_51 & 0x0F);
				s1->t0034 = (byte) a5_62;
				s1->w0038 = (word16) a1_44;
				if (s2_117 == 0x00)
				{
					s1->t0030.u1 = 0x00;
					s1->t0034.u1 = 0x00;
				}
				else
				{
					s1->w0032 = (word16) hb_pwr2.constprop.15((word32) *((word32) s0 + 2));
					s1->b0035 = (byte) (word32) *((word32) s0 + 4);
					if ((word32) *((word32) s0 + 3) != 0x00 && (word32) (*((word32) s0 + 2)) != 0x00)
					{
						word32 s8_506;
						word32 a3_501;
						word32 s3_504;
						word32 s4_505;
						word32 a4_502;
						word32 a5_503;
						word32 a0_499;
						word32 a1_500;
						word32 s1_498;
						k_work_submit((char *) s1 + 0x0C, a3_56, a4_54, mstatus, dwLoc2C, a1_44, dwArgC8, dwArg0108, dwArg0148, out s1_498, out a0_499, out a1_500, out a3_501, out a4_502, out a5_503, out s2_117, out s3_504, out s4_505, out s5_124, out s6, out s8_506);
l2303F77A:
						a3_133.u0 = 0x00;
						goto l2303F77E;
					}
				}
				word32 s4_496;
				word32 s8_497;
				word32 a2_491;
				word32 a5_494;
				word32 s3_495;
				word32 a3_492;
				word32 a4_493;
				word32 a0_489;
				word32 a1_490;
				k_delayed_work_cancel((char *) s1 + 0x0C, a3_56, a4_54, mstatus, dwArg04, dwArg08, dwArg78, dwArg88, dwArgB8, dwArgF8, out a0_489, out a1_490, out a2_491, out a3_492, out a4_493, out a5_494, out s2_117, out s3_495, out s4_496, out s5_124, out s6, out s8_497);
				goto l2303F77A;
			}
		}
	}
	a3_133 = s0;
l2303F77E:
	0x00 = dwArg0128;
	hb_pub_send_status(ra, dwArgE4, s5_124, dwArg0100, a3_133, s2_117, dwArg78, s6, s7, s9, s11, mstatus, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg48, s5, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArg0104);
}

