pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303F7A4: void _mod_unbind(Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 uint16) a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
void _mod_unbind(Eq_2 s1, Eq_2 a0, uint16 * a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	Eq_2 a1_16;
	if (app_key_is_valid((word32) *a4, out a1_16) == 0x00)
		return;
	word32 s3_79;
	word32 s2_78;
	mod_unbind.isra.2.part.3(s1, a0, a1_16, s4, mstatus, dwArg38, dwArg58, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s2_78, out s3_79);
}

// 2303F7D0: Register Eq_2 hb_sub_send_status.constprop.14(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register int32 a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114, Register out ptr32 s1Out)
// Called from:
//      heartbeat_sub_get
//      heartbeat_sub_set
Eq_2 hb_sub_send_status.constprop.14(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, int32 a4, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114, ptr32 & s1Out)
{
	Eq_2 s3_31;
	int32 a1_25;
	Eq_2 a5_27;
	Eq_2 a0_24 = k_uptime_get(out a1_25, out a5_27);
	Eq_2 s0_30 = *((word32) a5_27 + 64);
	if (a4 >= a1_25 && (a1_25 != a4 || a5_27 >= a0_24))
	{
		Eq_2 a0_34 = a5_27 - a0_24;
		word32 a1_499;
		s3_31 = (word32) (word16) __divdi3(a0_34, a4 - a1_25 - (word32) (a5_27 < a0_34), 1000, 0x00, out a1_499, out a5_27);
	}
	else
		s3_31.u0 = 0x00;
	Eq_2 a5_69;
	word32 a1_501;
	word32 a4_503;
	word32 a2_502;
	Eq_2 s1_70 = bt_mesh_model_msg_init(0x0800003C, a5_27, out a1_501, out a2_502, out a4_503, out a5_69);
	Eq_2 a5_76;
	net_buf_simple_add_u8(fp + -60, 0x00, a5_69, out a5_76);
	Eq_2 a5_88;
	word32 a4_504;
	net_buf_simple_add_le16(fp + -60, (word32) *((word32) s0_30 + 72), a5_76, out a4_504, out a5_88);
	word32 a4_505;
	Eq_2 a5_103;
	net_buf_simple_add_le16(fp + -60, (word32) *((word32) s0_30 + 74), a5_88, out a4_505, out a5_103);
	Eq_2 a1_106 = 0x00;
	if (s3_31 != 0x00)
	{
		a5_103.u0 = 0x0FFFFFFF;
		a1_106.u0 = 0x00FF;
		if (s3_31 != 0x0FFFFFFF)
		{
			word32 a4_500;
			a1_106 = 32 - __clzsi2(s3_31, out a4_500, out a5_103) & 0x00FF;
		}
	}
	Eq_2 a5_113;
	net_buf_simple_add_u8(fp + -60, a1_106, a5_103, out a5_113);
	Eq_2 a0_116 = (word32) *((word32) s0_30 + 76);
	Eq_2 a1_117 = 0x00;
	if (a0_116 != 0x00)
	{
		a5_113.u0 = 0x0FFFFFFF;
		a1_117.u0 = 0x00FF;
		if (a0_116 != 0x0FFFFFFF)
		{
			word32 a4_511;
			a1_117 = 32 - __clzsi2(a0_116, out a4_511, out a5_113) & 0x00FF;
		}
	}
	Eq_2 a5_133;
	net_buf_simple_add_u8(fp + -60, a1_117, a5_113, out a5_133);
	Eq_2 a5_140;
	net_buf_simple_add_u8(fp + -60, (word32) *((word32) s0_30 + 78), a5_133, out a5_140);
	word32 a5_506;
	net_buf_simple_add_u8(fp + -60, (word32) *((word32) s0_30 + 79), a5_140, out a5_506);
	word32 a0_199;
	Eq_2 a3_202;
	Eq_2 s0_209;
	word32 mstatus_510;
	word32 a2_507;
	word32 a5_509;
	word32 a4_508;
	ptr32 s1_210;
	Eq_2 ra_208 = bt_mesh_model_send(ra, s0_30, s1_70, s1_70, a1, fp + -60, 0x00, a1, s4, s6, s7, s9, s11, mstatus, s2, s0, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s0_209, out s1_210, out a0_199, out a2_507, out a3_202, out a4_508, out a5_509, out mstatus_510);
	if (a0_199 != 0x00)
	{
		word32 s8_525;
		word32 s9_526;
		word32 s10_527;
		word32 t4_529;
		word32 s11_528;
		word32 s3_520;
		word32 s4_521;
		word32 s5_522;
		word32 s7_524;
		word32 s6_523;
		word32 a3_515;
		word32 a4_516;
		word32 a5_517;
		word32 s2_519;
		word32 a7_518;
		word32 a0_512;
		word32 a2_514;
		word32 a1_513;
		printf(ra_208, &g_t230B8350, a3_202, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_210, out a0_512, out a1_513, out a2_514, out a3_515, out a4_516, out a5_517, out a7_518, out s2_519, out s3_520, out s4_521, out s5_522, out s6_523, out s7_524, out s8_525, out s9_526, out s10_527, out s11_528, out t4_529);
	}
	s1Out = s1_210;
	return s0_209;
}

// 2303F8DE: void heartbeat_sub_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register (ptr32 Eq_209140) a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0114)
void heartbeat_sub_get(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, struct Eq_209140 * a5, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArg0114)
{
	int32 a4_26 = (word32) a5->t0048;
	if (a4_26 != 0x00)
	{
		a4_26 = (word32) a5->w004A;
		if (a4_26 != 0x00)
		{
l2303F8F4:
			word32 s1_141;
			hb_sub_send_status.constprop.14(ra, s0, s1, a1, a4_26, s2, s4, s6, s7, s9, s11, mstatus, dwArg08, dwArg0C, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF4, dwArg0114, out s1_141);
			return;
		}
	}
	a5->t0048.u1 = 0x00;
	a5->dw004C = 0x00;
	goto l2303F8F4;
}

// 2303F8F8: void heartbeat_sub_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE4, Stack word32 dwArg0128)
void heartbeat_sub_set(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a5, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC4, Eq_2 dwArgE4, word32 dwArg0128)
{
	struct Eq_274 * a0_227;
	Eq_2 a0_18 = *((word32) s0 + 24);
	Eq_2 a5_30;
	word32 a1_507;
	word32 a4_509;
	word32 a2_508;
	Eq_2 a0_26 = net_buf_simple_pull_le16(a5, out a1_507, out a2_508, out a4_509, out a5_30);
	Eq_2 a5_37;
	word32 a1_510;
	word32 a4_512;
	word32 a2_511;
	Eq_2 a0_33 = net_buf_simple_pull_le16(a5_30, out a1_510, out a2_511, out a4_512, out a5_37);
	word32 a2_514;
	word32 a5_515;
	word32 a1_513;
	Eq_2 a0_40 = net_buf_simple_pull_u8(a5_37, out a1_513, out a2_514, out a5_515);
	if (a0_26 << 0x10 < 0x00)
	{
		a0_227 = (struct Eq_274 *) &g_t230B8380;
		goto l2303F936;
	}
	if ((word32) (word16) ((word32) a0_33 - 0x08000000) >= 0x04000000)
	{
		int32 a4_116 = 0x00FB;
		if ((word32) (word16) ((word32) a0_33 + 0x0100) <= 0x00FB)
			goto l2303F958;
		if ((int32) (word16) a0_33 > 0x00)
		{
			word32 a5_535;
			if (bt_mesh_primary_addr(out a5_535) != a0_33)
				goto l2303F958;
		}
		if (a0_40 <= 0x11)
		{
			Eq_2 s1_74;
			if (a0_26 != 0x00 && (a0_33 != 0x00 && a0_40 != 0x00))
			{
				*((word32) s0 + 74) = (word16) a0_33;
				*((word32) s0 + 72) = (word16) a0_26;
				*(union Eq_2 *) 0x007F004C = s0;
				s1_74 = hb_pwr2.constprop.15(a0_40) + 1000;
			}
			else
			{
				((word32) s0 + 72)->u0 = 0x00;
				*((word32) s0 + 78) = 0x7F;
				s1_74.u0 = 0x00;
			}
			bt_mesh_set_hb_sub_dst((word32) *((word32) s0 + 74));
			if (s1_74 != 0x00)
			{
				Eq_209414 a1_90;
				word32 a5_555;
				word32 a0_93 = k_uptime_get(out a1_90, out a5_555) + s1_74;
				*((word32) a0_93 + 64) = s0;
				a4_116 = (word32) (a0_93 < s1_74);
				Mem99[(s1_74 >> 0x1F) + a1_90 + a4_116 + 0x0044:word32] = s0;
			}
			else
			{
				*(union Eq_2 *) 64 = s0;
				((word32) s0 + 0x0044)->u0 = 0x00;
			}
			word32 s1_164;
			struct Eq_209194 * s0_163 = hb_sub_send_status.constprop.14(ra, s0, s1_74, a1, a4_116, a0_18, a0_26, s6, s7, s9, s11, mstatus, dwLoc28, s4, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg18, dwArg38, dwArg48, dwArg4C, s5, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgE4, out s1_164);
			if (s1_164 == 0x00)
				s0_163->b004E = 0x00;
			0x00 = dwArg0128;
		}
		else
		{
			0x00 = dwArg0128;
			word32 t4_554;
			word32 s8_550;
			word32 s9_551;
			word32 s10_552;
			word32 s11_553;
			word32 s4_546;
			word32 s5_547;
			word32 s6_548;
			word32 s7_549;
			word32 s2_544;
			word32 s3_545;
			word32 a1_538;
			word32 s1_536;
			word32 a0_537;
			word32 a2_539;
			word32 a3_540;
			word32 a4_541;
			word32 a5_542;
			word32 a7_543;
			printf(ra, &g_t230B83C0, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_536, out a0_537, out a1_538, out a2_539, out a3_540, out a4_541, out a5_542, out a7_543, out s2_544, out s3_545, out s4_546, out s5_547, out s6_548, out s7_549, out s8_550, out s9_551, out s10_552, out s11_553, out t4_554);
		}
	}
	else
	{
l2303F958:
		a0_227 = (struct Eq_274 *) &g_t230B839C;
l2303F936:
		0x00 = dwArg0128;
		word32 a0_517;
		word32 s1_516;
		word32 a1_518;
		word32 a2_519;
		word32 a4_521;
		word32 a3_520;
		word32 s2_524;
		word32 a7_523;
		word32 a5_522;
		word32 s4_526;
		word32 s3_525;
		word32 s5_527;
		word32 s6_528;
		word32 s7_529;
		word32 s8_530;
		word32 s9_531;
		word32 s10_532;
		word32 s11_533;
		word32 t4_534;
		printf(ra, a0_227, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_516, out a0_517, out a1_518, out a2_519, out a3_520, out a4_521, out a5_522, out a7_523, out s2_524, out s3_525, out s4_526, out s5_527, out s6_528, out s7_529, out s8_530, out s9_531, out s10_532, out s11_533, out t4_534);
	}
}

// 2303FA2C: Register Eq_2 bt_mesh_app_key_del(Register Eq_2 ra, Register Eq_2 a4, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_209462) s0Out, Register out (ptr32 Eq_209463) s1Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      app_key_del
//      bt_mesh_subnet_del
Eq_2 bt_mesh_app_key_del(Eq_2 ra, Eq_2 a4, Eq_2 dwArg0108, struct Eq_209462 & s0Out, struct Eq_209463 & s1Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out)
{
	struct Eq_209462 * s0_29;
	struct Eq_209463 * s1_30;
	ptr32 s2_31;
	ptr32 s6_35;
	ptr32 s7_36;
	word32 a3_75;
	word32 a4_76;
	Eq_2 ra_28 = bt_mesh_model_foreach(ra, &g_t2303F7A4, fp + ~0x13, a4, dwArg0108, out s0_29, out s1_30, out a3_75, out a4_76, out s2_31, out s6_35, out s7_36);
	s0_29->w0000 = (word16) s1_30;
	ptr32 a5_49;
	word32 t1_77;
	word32 a0_78;
	word32 a1_79;
	word32 a2_80;
	word32 a3_81;
	word32 a4_82;
	Eq_2 ra_50 = memset(ra_28, &s0_29->b0004 + 1, 0x00, 0x0022, out t1_77, out a0_78, out a1_79, out a2_80, out a3_81, out a4_82, out a5_49);
	s0_29->w0002 = (word16) s1_30;
	s0_29->b0004 = 0x00;
	s0Out = s0_29;
	s1Out = s1_30;
	a5Out = a5_49;
	s2Out = s2_31;
	s4Out = dwArg04;
	s6Out = s6_35;
	s7Out = s7_36;
	return ra_50;
}

// 2303FA76: void app_key_del(Register Eq_2 ra, Register Eq_2 a1, Register (ptr32 Eq_204258) a3, Register (ptr32 Eq_204259) a4, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124, Stack word32 dwArg0128)
void app_key_del(Eq_2 ra, Eq_2 a1, struct Eq_204258 * a3, struct Eq_204259 * a4, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124, word32 dwArg0128)
{
	key_idx_unpack(fp + -44, fp + -42, a3, a4);
	Eq_2 s2_105 = a1;
	Eq_2 s0_34 = 0x04;
	word32 a3_286;
	word32 a4_287;
	Eq_2 a5_37;
	if (bt_mesh_subnet_get((word32) wLoc2C, out a3_286, out a4_287, out a5_37) != 0x00)
	{
		s0_34.u0 = 0x00;
		word32 a4_299;
		word32 a3_298;
		Eq_2 a0_41 = bt_mesh_app_key_find((word32) wLoc2A, out a3_298, out a4_299, out a5_37);
		if (a0_41 != 0x00)
		{
			Eq_2 a4_46 = (word32) *a0_41;
			a5_37 = (word32) wLoc2C;
			s0_34.u0 = 0x11;
			if (a4_46 == a5_37)
			{
				word32 s1_301;
				word32 s0_300;
				ra = bt_mesh_app_key_del(ra, a4_46, dwArgD8, out s0_300, out s1_301, out a5_37, out s2_105, out s4, out s6, out s7);
				s0_34.u0 = 0x00;
			}
		}
	}
	Eq_2 a5_81;
	word32 a1_288;
	word32 a2_289;
	word32 a4_290;
	Eq_2 s1_82 = bt_mesh_model_msg_init(0x08000003, a5_37, out a1_288, out a2_289, out a4_290, out a5_81);
	word32 a5_291;
	net_buf_simple_add_u8(fp + -28, s0_34, a5_81, out a5_291);
	word32 a0_121;
	Eq_2 a3_124;
	word32 mstatus_297;
	word32 a5_296;
	word32 a4_295;
	word32 a2_294;
	word32 s1_293;
	word32 s0_292;
	Eq_2 ra_130 = bt_mesh_model_send(ra, key_idx_pack(fp + -28, (word32) wLoc2C, (word32) wLoc2A), s1_82, s1_82, s2_105, fp + -28, 0x00, s2_105, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -40, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_292, out s1_293, out a0_121, out a2_294, out a3_124, out a4_295, out a5_296, out mstatus_297);
	if (a0_121 != 0x00)
	{
		word32 a0_303;
		word32 s1_302;
		word32 a1_304;
		word32 a2_305;
		word32 a3_306;
		word32 a4_307;
		word32 a5_308;
		word32 a7_309;
		word32 s2_310;
		word32 s3_311;
		word32 s4_312;
		word32 s5_313;
		word32 s6_314;
		word32 s7_315;
		word32 s8_316;
		word32 s9_317;
		word32 s10_318;
		word32 s11_319;
		word32 t4_320;
		printf(ra_130, &g_t230B7DDC, a3_124, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_302, out a0_303, out a1_304, out a2_305, out a3_306, out a4_307, out a5_308, out a7_309, out s2_310, out s3_311, out s4_312, out s5_313, out s6_314, out s7_315, out s8_316, out s9_317, out s10_318, out s11_319, out t4_320);
	}
	0x00 = dwArg0128;
}

// 2303FB14: Register Eq_2 bt_mesh_cfg_srv_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      mod_init
Eq_2 bt_mesh_cfg_srv_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArg0118, ptr32 & a3Out, ptr32 & s2Out)
{
	ptr32 a3_129;
	ptr32 s2_144;
	struct Eq_274 * a0_17;
	struct Eq_209715 * a0_10 = *((word32) s0 + 24);
	if (s0 == 0x00)
		a0_17 = (struct Eq_274 *) &g_t230B7E60;
	else
	{
		if ((word32) *((word32) s0 + 5) <= 0x02)
		{
			Eq_2 a4_13 = (word32) *((word32) s0 + 7);
			if (a4_13 <= 0x01 && (int32) (*((word32) s0 + 0x0A)) >= 0x00)
			{
				a0_10->w000C = ~0x01;
				word32 a0_162;
				word32 a4_163;
				word32 a5_164;
				word32 s3_165;
				word32 s4_166;
				word32 s5_167;
				Eq_2 s1_33 = k_delayed_work_init(ra, s0, (word32) s0 + 0x0C, a3, a4_13, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_162, out a3_129, out a4_163, out a5_164, out s2_144, out s3_165, out s4_166, out s5_167);
				((word32) s0 + 56)->u0 = ~0x00;
				*(union Eq_2 *) 64 = s0;
				((word32) s0 + 0x0044)->u0 = 0x00;
				*s1_33 = s0;
				g_t4200F42C = s0;
				goto l2303FB80;
			}
		}
		a0_17 = (struct Eq_274 *) &g_t230B7E8C;
	}
	word32 s1_168;
	word32 a0_169;
	word32 a1_170;
	word32 a2_171;
	word32 a4_172;
	word32 a5_173;
	word32 a7_174;
	word32 s3_175;
	word32 s4_176;
	word32 s5_177;
	word32 s6_178;
	word32 s7_179;
	word32 s8_180;
	word32 s9_181;
	word32 s10_182;
	word32 s11_183;
	word32 t4_184;
	ra = printf(ra, a0_17, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_168, out a0_169, out a1_170, out a2_171, out a3_129, out a4_172, out a5_173, out a7_174, out s2_144, out s3_175, out s4_176, out s5_177, out s6_178, out s7_179, out s8_180, out s9_181, out s10_182, out s11_183, out t4_184);
l2303FB80:
	a3Out = a3_129;
	s2Out = s2_144;
	return ra;
}

// 2303FB94: Register Eq_2 bt_mesh_heartbeat(Register Eq_2 ra, Register word32 a0, Register word32 a1, Register ui32 a2, Register Eq_2 a3, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_209835 a4Out, Register out Eq_209836 s3Out, Register out ptr32 s7Out, Register out ptr32 s9Out)
// Called from:
//      ctl_recv
Eq_2 bt_mesh_heartbeat(Eq_2 ra, word32 a0, word32 a1, ui32 a2, Eq_2 a3, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgBC, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_209835 & a4Out, union Eq_209836 & s3Out, ptr32 & s7Out, ptr32 & s9Out)
{
	struct Eq_274 * a0_105;
	Eq_2 s0_7 = g_t4200F42C;
	if (s0_7 == 0x00)
	{
		a0_105 = (struct Eq_274 *) &g_t230B80F0;
		goto l2303FBB0;
	}
	if ((word32) *((word32) s0_7 + 72) != a0 || (word32) (*((word32) s0_7 + 74)) != a1)
	{
		a0_105 = (struct Eq_274 *) &g_t230B8120;
		goto l2303FBB0;
	}
	Eq_2 a1_25;
	Eq_2 a5_27;
	Eq_2 a0_24 = k_uptime_get(out a1_25, out a5_27);
	if (a5_27 < a1_25)
	{
l2303FBF8:
		a0_105 = (struct Eq_274 *) &g_t230B814C;
l2303FBB0:
		Eq_2 a1_131;
		Eq_2 a3_133;
		Eq_209835 a4_134;
		Eq_209836 s3_141;
		ptr32 s7_145;
		ptr32 s9_147;
		word32 a0_344;
		word32 s2_348;
		word32 s1_343;
		word32 s8_352;
		word32 a2_345;
		word32 a5_346;
		word32 a7_347;
		word32 s4_349;
		word32 s6_351;
		word32 s5_350;
		word32 s10_353;
		word32 s11_354;
		word32 t4_355;
		Eq_2 ra_136 = printf(ra, a0_105, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_343, out a0_344, out a1_131, out a2_345, out a3_133, out a4_134, out a5_346, out a7_347, out s2_348, out s3_141, out s4_349, out s5_350, out s6_351, out s7_145, out s8_352, out s9_147, out s10_353, out s11_354, out t4_355);
		a1Out = a1_131;
		a3Out = a3_133;
		a4Out = a4_134;
		s3Out = s3_141;
		s7Out = s7_145;
		s9Out = s9_147;
		return ra_136;
	}
	else
	{
		Eq_2 s0_29 = a3;
		if (a5_27 == a1_25)
		{
			s0_29 = *((word32) a5_27 + 64);
			if (a5_27 < a0_24)
				goto l2303FBF8;
		}
		Eq_2 a5_34 = (word32) *((word32) s0_29 + 78);
		if (dwArg84 < a5_34)
			a5_34 = dwArg84;
		*((word32) s0_29 + 78) = (byte) a5_34;
		Eq_2 a5_40 = (word32) *((word32) s0_29 + 79);
		if (a5_40 < dwArg84)
			a5_40 = dwArg84;
		*((word32) s0_29 + 79) = (byte) a5_40;
		word32 a5_46 = (word32) *((word32) s0_29 + 76);
		if (a5_46 != 0x0FFFFFFF)
			*((word32) s0_29 + 76) = (word16) (a5_46 + 0x01);
		Eq_2 t1_53 = *((word32) s0_29 + 80);
		if (t1_53 == 0x00)
		{
			a1Out = a1_25;
			a3Out = a3;
			a4Out.u0 = 0x0FFFFFFF;
			s3Out = s3;
			s7Out = s7;
			s9Out = s9;
			return ra;
		}
		else
		{
			word32 t0_188;
			ptr32 s9_187;
			ptr32 s7_186;
			word32 s6_185;
			word32 s5_184;
			Eq_209836 s3_183;
			word32 a7_180;
			word32 s10_181;
			word32 s11_182;
			Eq_2 ra_91;
			Eq_2 a1_99;
			Eq_2 a3_100;
			Eq_209835 a4_102;
			word32 t1_103;
			word32 t4_189;
			t1_53();
			a1Out = a1_99;
			a3Out = a3_100;
			a4Out = a4_102;
			s3Out = s3_183;
			s7Out = s7_186;
			s9Out = s9_187;
			return ra_91;
		}
	}
}

// 2303FC54: Register word32 bt_mesh_net_transmit_get(Register out Eq_2 a5Out)
// Called from:
//      blemesh_seg_send
//      blemesh_net_send
//      clear_friendship
//      bt_mesh_model_send
//      bt_mesh_model_publish
//      mod_publish
//      net_transmit_set
//      net_transmit_get
//      bt_mesh_net_recv
//      send_ack
//      bt_mesh_heartbeat_send
//      send_friend_clear
//      bt_mesh_friend_clear
word32 bt_mesh_net_transmit_get(union Eq_2 & a5Out)
{
	Eq_2 a5_5 = g_t4200F42C;
	word32 a0_6 = 0x00;
	if (a5_5 != 0x00)
		a0_6 = (word32) *((word32) a5_5 + 4);
	a5Out = a5_5;
	return a0_6;
}

