pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303FC66: void net_transmit_set(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void net_transmit_set(Eq_2 ra, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	Eq_2 a5_14 = fp + -36;
	if (fp == ~0x23)
	{
		word32 t4_259;
		word32 s10_258;
		word32 s8_257;
		word32 s5_256;
		word32 s3_255;
		word32 a7_254;
		word32 a4_253;
		word32 s1_248;
		word32 a0_249;
		word32 a1_250;
		word32 a2_251;
		word32 a3_252;
		ra = printf(ra, &g_t230B82AC, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_248, out a0_249, out a1_250, out a2_251, out a3_252, out a4_253, out a5_14, out a7_254, out s2, out s3_255, out s4, out s5_256, out s6, out s7, out s8_257, out s9, out s10_258, out s11, out t4_259);
	}
	word32 a1_279;
	word32 a2_280;
	word32 a4_281;
	word32 a5_282;
	Eq_2 s1_59 = bt_mesh_model_msg_init(0x08000025, a5_14, out a1_279, out a2_280, out a4_281, out a5_282);
	Eq_2 a5_62;
	word32 a5_283;
	net_buf_simple_add_u8(fp + -28, bt_mesh_net_transmit_get(out a5_62), a5_62, out a5_283);
	word32 a0_90;
	Eq_2 a3_93;
	word32 s0_284;
	word32 s1_285;
	word32 a2_286;
	word32 a4_287;
	word32 a5_288;
	word32 mstatus_289;
	Eq_2 ra_99 = bt_mesh_model_send(ra, dwLoc0C, s1_59, dwLoc0C, s1_59, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_284, out s1_285, out a0_90, out a2_286, out a3_93, out a4_287, out a5_288, out mstatus_289);
	if (a0_90 != 0x00)
	{
		word32 a0_261;
		word32 s1_260;
		word32 a1_262;
		word32 a2_263;
		word32 a3_264;
		word32 a4_265;
		word32 a5_266;
		word32 a7_267;
		word32 s2_268;
		word32 s3_269;
		word32 s4_270;
		word32 s5_271;
		word32 s6_272;
		word32 s7_273;
		word32 s8_274;
		word32 s9_275;
		word32 s10_276;
		word32 s11_277;
		word32 t4_278;
		printf(ra_99, &g_t230B8644, a3_93, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out a7_267, out s2_268, out s3_269, out s4_270, out s5_271, out s6_272, out s7_273, out s8_274, out s9_275, out s10_276, out s11_277, out t4_278);
	}
}

// 2303FCDA: void net_transmit_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void net_transmit_get(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	word32 a5_177;
	word32 a4_176;
	word32 a2_175;
	word32 a1_174;
	Eq_2 s1_28 = bt_mesh_model_msg_init(0x08000025, fp + -36, out a1_174, out a2_175, out a4_176, out a5_177);
	Eq_2 a5_31;
	word32 a5_178;
	net_buf_simple_add_u8(fp + -28, bt_mesh_net_transmit_get(out a5_31), a5_31, out a5_178);
	word32 a0_49;
	Eq_2 a3_52;
	word32 s0_179;
	word32 s1_180;
	word32 a2_181;
	word32 a4_182;
	word32 a5_183;
	word32 mstatus_184;
	Eq_2 ra_58 = bt_mesh_model_send(ra, a0, s1_28, a0, s1_28, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_179, out s1_180, out a0_49, out a2_181, out a3_52, out a4_182, out a5_183, out mstatus_184);
	if (a0_49 != 0x00)
	{
		word32 s1_185;
		word32 a0_186;
		word32 a1_187;
		word32 a2_188;
		word32 a3_189;
		word32 a4_190;
		word32 a5_191;
		word32 a7_192;
		word32 s2_193;
		word32 s3_194;
		word32 s4_195;
		word32 s5_196;
		word32 s6_197;
		word32 s7_198;
		word32 s8_199;
		word32 s9_200;
		word32 s10_201;
		word32 s11_202;
		word32 t4_203;
		printf(ra_58, &g_t230B8614, a3_52, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_185, out a0_186, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191, out a7_192, out s2_193, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202, out t4_203);
	}
}

// 2303FD32: Register word32 bt_mesh_relay_get(Register out Eq_2 a5Out)
// Called from:
//      bt_mesh_fixed_group_match
//      relay_set
//      relay_get
//      bt_mesh_net_recv
//      bt_mesh_heartbeat_send
word32 bt_mesh_relay_get(union Eq_2 & a5Out)
{
	Eq_2 a5_5 = g_t4200F42C;
	word32 a0_6 = 0x02;
	if (a5_5 != 0x00)
		a0_6 = (word32) *((word32) a5_5 + 5);
	a5Out = a5_5;
	return a0_6;
}

// 2303FD44: Register word32 bt_mesh_friend_get(Register out Eq_2 a5Out)
// Called from:
//      bt_mesh_fixed_group_match
//      bt_mesh_heartbeat_send
//      bt_mesh_friend_enqueue_rx
//      bt_mesh_friend_enqueue_tx
word32 bt_mesh_friend_get(union Eq_2 & a5Out)
{
	Eq_2 a5_5 = g_t4200F42C;
	word32 a0_6 = 0x02;
	if (a5_5 != 0x00)
		a0_6 = (word32) *((word32) a5_5 + 9);
	a5Out = a5_5;
	return a0_6;
}

// 2303FD56: Register word32 bt_mesh_relay_retransmit_get(Register out Eq_2 a5Out)
// Called from:
//      relay_set
//      relay_get
//      bt_mesh_net_recv
word32 bt_mesh_relay_retransmit_get(union Eq_2 & a5Out)
{
	Eq_2 a5_5 = g_t4200F42C;
	word32 a0_6 = 0x00;
	if (a5_5 != 0x00)
		a0_6 = (word32) *((word32) a5_5 + 6);
	a5Out = a5_5;
	return a0_6;
}

// 2303FD68: void relay_set(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 byte) a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack uint16 wArg12, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void relay_set(Eq_2 ra, Eq_2 a3, byte * a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, uint16 wArg12, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	Eq_2 a5_113;
	Eq_2 s0_164 = dwLoc0C;
	if (fp == ~0x23)
	{
		word32 t4_399;
		word32 s10_398;
		word32 s8_397;
		word32 s5_396;
		word32 a7_394;
		word32 s3_395;
		word32 a4_393;
		word32 a3_392;
		word32 a2_391;
		word32 a0_389;
		word32 a1_390;
		word32 s1_388;
		ra = printf(ra, &g_t230B82AC, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_388, out a0_389, out a1_390, out a2_391, out a3_392, out a4_393, out a5_113, out a7_394, out s2, out s3_395, out s4, out s5_396, out s6, out s7, out s8_397, out s9, out s10_398, out s11, out t4_399);
	}
	else
	{
		up32 a1_22 = (word32) *a4;
		if (a1_22 > 0x01)
		{
			word32 s5_430;
			word32 s4_429;
			word32 s3_428;
			word32 s2_427;
			word32 a7_426;
			word32 a5_425;
			word32 a4_424;
			word32 a3_423;
			word32 a2_422;
			word32 a1_421;
			word32 a0_420;
			word32 s1_419;
			word32 s6_431;
			word32 s7_432;
			word32 s8_433;
			word32 s9_434;
			word32 s10_435;
			word32 s11_436;
			word32 t4_437;
			printf(ra, &g_t230B870C, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_419, out a0_420, out a1_421, out a2_422, out a3_423, out a4_424, out a5_425, out a7_426, out s2_427, out s3_428, out s4_429, out s5_430, out s6_431, out s7_432, out s8_433, out s9_434, out s10_435, out s11_436, out t4_437);
			return;
		}
		up32 a4_49 = (word32) bLoc1F;
		word32 a3_51 = 0x00;
		if (a4_49 != 0x02)
			a3_51 = (word32) (a1_22 - a4_49 != 0x00);
		ui32 a5_60 = (word32) wArg12;
		a5_113 = a5_60 & 0x01;
		if ((a5_60 & 0x01) != 0x00 && a3_51 != 0x00)
		{
			word32 s1_450;
			word32 a3_451;
			word32 a4_452;
			word32 s3_453;
			word32 s5_454;
			word32 s8_455;
			ra = bt_mesh_heartbeat_send(ra, s2, s3, s4, s5, s6, s7, s8, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg1C, dwArg28, dwArg38, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_164, out s1_450, out a3_451, out a4_452, out a5_113, out s2, out s3_453, out s4, out s5_454, out s6, out s7, out s8_455, out s9, out s11, out mstatus);
		}
	}
	word32 a1_438;
	word32 a2_439;
	word32 a4_440;
	word32 a5_441;
	Eq_2 s1_144 = bt_mesh_model_msg_init(0x08000028, a5_113, out a1_438, out a2_439, out a4_440, out a5_441);
	Eq_2 a5_147;
	word32 a5_442;
	net_buf_simple_add_u8(fp + -28, bt_mesh_relay_get(out a5_147), a5_147, out a5_442);
	Eq_2 a5_154;
	word32 a5_443;
	net_buf_simple_add_u8(fp + -28, bt_mesh_relay_retransmit_get(out a5_154), a5_154, out a5_443);
	word32 a0_180;
	Eq_2 a3_183;
	word32 s0_444;
	word32 s1_445;
	word32 a2_446;
	word32 a4_447;
	word32 a5_448;
	word32 mstatus_449;
	Eq_2 ra_189 = bt_mesh_model_send(ra, s0_164, s1_144, s0_164, s1_144, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_444, out s1_445, out a0_180, out a2_446, out a3_183, out a4_447, out a5_448, out mstatus_449);
	if (a0_180 != 0x00)
	{
		word32 t4_418;
		word32 s11_417;
		word32 s10_416;
		word32 s9_415;
		word32 s8_414;
		word32 s7_413;
		word32 s6_412;
		word32 s5_411;
		word32 s4_410;
		word32 s3_409;
		word32 s2_408;
		word32 a5_406;
		word32 a7_407;
		word32 a3_404;
		word32 a4_405;
		word32 a1_402;
		word32 a2_403;
		word32 s1_400;
		word32 a0_401;
		printf(ra_189, &g_t230B872C, a3_183, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_400, out a0_401, out a1_402, out a2_403, out a3_404, out a4_405, out a5_406, out a7_407, out s2_408, out s3_409, out s4_410, out s5_411, out s6_412, out s7_413, out s8_414, out s9_415, out s10_416, out s11_417, out t4_418);
	}
}

