pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303FE28: void relay_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void relay_get(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	word32 a5_184;
	word32 a4_183;
	word32 a2_182;
	word32 a1_181;
	Eq_2 s1_28 = bt_mesh_model_msg_init(0x08000028, fp + -36, out a1_181, out a2_182, out a4_183, out a5_184);
	Eq_2 a5_31;
	word32 a5_185;
	net_buf_simple_add_u8(fp + -28, bt_mesh_relay_get(out a5_31), a5_31, out a5_185);
	Eq_2 a5_38;
	word32 a5_186;
	net_buf_simple_add_u8(fp + -28, bt_mesh_relay_retransmit_get(out a5_38), a5_38, out a5_186);
	word32 a0_56;
	Eq_2 a3_59;
	word32 s0_187;
	word32 s1_188;
	word32 a2_189;
	word32 a4_190;
	word32 a5_191;
	word32 mstatus_192;
	Eq_2 ra_65 = bt_mesh_model_send(ra, a0, s1_28, a0, s1_28, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_187, out s1_188, out a0_56, out a2_189, out a3_59, out a4_190, out a5_191, out mstatus_192);
	if (a0_56 != 0x00)
	{
		word32 s1_193;
		word32 a0_194;
		word32 a1_195;
		word32 a2_196;
		word32 a3_197;
		word32 a4_198;
		word32 a5_199;
		word32 a7_200;
		word32 s2_201;
		word32 s3_202;
		word32 s4_203;
		word32 s5_204;
		word32 s6_205;
		word32 s7_206;
		word32 s8_207;
		word32 s9_208;
		word32 s10_209;
		word32 s11_210;
		word32 t4_211;
		printf(ra_65, &g_t230B86DC, a3_59, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_193, out a0_194, out a1_195, out a2_196, out a3_197, out a4_198, out a5_199, out a7_200, out s2_201, out s3_202, out s4_203, out s5_204, out s6_205, out s7_206, out s8_207, out s9_208, out s10_209, out s11_210, out t4_211);
	}
}

// 2303FE8C: Register word32 bt_mesh_beacon_get(Register out Eq_2 a5Out)
// Called from:
//      beacon_send
//      bt_mesh_beacon_ivu_initiator
//      bt_mesh_beacon_recv
//      beacon_set
//      beacon_get
//      bt_mesh_net_start
word32 bt_mesh_beacon_get(union Eq_2 & a5Out)
{
	Eq_2 a5_5 = g_t4200F42C;
	word32 a0_6 = 0x00;
	if (a5_5 != 0x00)
		a0_6 = (word32) *((word32) a5_5 + 7);
	a5Out = a5_5;
	return a0_6;
}

// 2303FE9E: void beacon_set(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 byte) a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0148)
void beacon_set(Eq_2 ra, Eq_2 a3, byte * a4, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0124, Eq_2 dwArg0148)
{
	Eq_2 a5_100 = fp + -36;
	Eq_2 s0_144 = dwLoc0C;
	if (fp == ~0x23)
	{
		word32 a3_333;
		word32 a2_332;
		word32 a1_331;
		word32 a0_330;
		word32 s1_329;
		word32 a4_334;
		word32 a7_335;
		word32 s3_336;
		word32 s5_337;
		word32 s8_338;
		word32 s10_339;
		word32 t4_340;
		ra = printf(ra, &g_t230B82AC, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_329, out a0_330, out a1_331, out a2_332, out a3_333, out a4_334, out a5_100, out a7_335, out s2, out s3_336, out s4, out s5_337, out s6, out s7, out s8_338, out s9, out s10_339, out s11, out t4_340);
	}
	else
	{
		Eq_2 a1_22 = (word32) *a4;
		if (a1_22 > 0x01)
		{
			word32 s1_360;
			word32 a0_361;
			word32 a1_362;
			word32 a2_363;
			word32 a3_364;
			word32 a4_365;
			word32 a5_366;
			word32 a7_367;
			word32 s2_368;
			word32 s3_369;
			word32 s4_370;
			word32 s5_371;
			word32 s6_372;
			word32 s7_373;
			word32 s8_374;
			word32 s9_375;
			word32 s10_376;
			word32 s11_377;
			word32 t4_378;
			printf(ra, &g_t230B7E08, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_360, out a0_361, out a1_362, out a2_363, out a3_364, out a4_365, out a5_366, out a7_367, out s2_368, out s3_369, out s4_370, out s5_371, out s6_372, out s7_373, out s8_374, out s9_375, out s10_376, out s11_377, out t4_378);
			return;
		}
		Eq_2 a4_49 = (word32) bLoc1D;
		if (a4_49 != a1_22)
		{
			if (a1_22 != 0x00)
			{
				word32 a3_393;
				word32 a4_394;
				word32 s5_395;
				s0_144 = bt_mesh_beacon_enable(ra, a3, a4_49, mstatus, dwLoc2C, dwArg54, dwArgC8, dwArg0108, dwArg0148, out a3_393, out a4_394, out a5_100, out s2, out s4, out s5_395, out s6);
			}
			else
			{
				word32 a4_390;
				word32 s3_391;
				word32 s5_392;
				bt_mesh_beacon_disable(a3, a4_49, mstatus, dwArg04, dwArg08, dwArg78, dwArg88, dwArgB8, dwArgF8, out a4_390, out a5_100, out s2, out s3_391, out s4, out s5_392, out s6);
			}
		}
	}
	word32 a1_379;
	word32 a2_380;
	word32 a4_381;
	word32 a5_382;
	Eq_2 s1_131 = bt_mesh_model_msg_init(0x0800000B, a5_100, out a1_379, out a2_380, out a4_381, out a5_382);
	Eq_2 a5_134;
	word32 a5_383;
	net_buf_simple_add_u8(fp + -28, bt_mesh_beacon_get(out a5_134), a5_134, out a5_383);
	word32 a0_161;
	Eq_2 a3_164;
	word32 s0_384;
	word32 s1_385;
	word32 a2_386;
	word32 a4_387;
	word32 a5_388;
	word32 mstatus_389;
	Eq_2 ra_170 = bt_mesh_model_send(ra, s0_144, s1_131, s0_144, s1_131, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_384, out s1_385, out a0_161, out a2_386, out a3_164, out a4_387, out a5_388, out mstatus_389);
	if (a0_161 != 0x00)
	{
		word32 s1_341;
		word32 a0_342;
		word32 a1_343;
		word32 a2_344;
		word32 a3_345;
		word32 a4_346;
		word32 a5_347;
		word32 a7_348;
		word32 s2_349;
		word32 s3_350;
		word32 s4_351;
		word32 s5_352;
		word32 s6_353;
		word32 s7_354;
		word32 s8_355;
		word32 s9_356;
		word32 s10_357;
		word32 s11_358;
		word32 t4_359;
		printf(ra_170, &g_t230B7E30, a3_164, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_341, out a0_342, out a1_343, out a2_344, out a3_345, out a4_346, out a5_347, out a7_348, out s2_349, out s3_350, out s4_351, out s5_352, out s6_353, out s7_354, out s8_355, out s9_356, out s10_357, out s11_358, out t4_359);
	}
}

