pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 2303FF38: void beacon_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void beacon_get(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	word32 a5_177;
	word32 a4_176;
	word32 a2_175;
	word32 a1_174;
	Eq_2 s1_28 = bt_mesh_model_msg_init(0x0800000B, fp + -36, out a1_174, out a2_175, out a4_176, out a5_177);
	Eq_2 a5_31;
	word32 a5_178;
	net_buf_simple_add_u8(fp + -28, bt_mesh_beacon_get(out a5_31), a5_31, out a5_178);
	word32 a0_49;
	Eq_2 a3_52;
	word32 s0_179;
	word32 s1_180;
	word32 a2_181;
	word32 a4_182;
	word32 a5_183;
	word32 mstatus_184;
	Eq_2 ra_58 = bt_mesh_model_send(ra, a0, s1_28, a0, s1_28, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_179, out s1_180, out a0_49, out a2_181, out a3_52, out a4_182, out a5_183, out mstatus_184);
	if (a0_49 != 0x00)
	{
		word32 s1_185;
		word32 a0_186;
		word32 a1_187;
		word32 a2_188;
		word32 a3_189;
		word32 a4_190;
		word32 a5_191;
		word32 a7_192;
		word32 s2_193;
		word32 s3_194;
		word32 s4_195;
		word32 s5_196;
		word32 s6_197;
		word32 s7_198;
		word32 s8_199;
		word32 s9_200;
		word32 s10_201;
		word32 s11_202;
		word32 t4_203;
		printf(ra_58, &g_t230B7E30, a3_52, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_185, out a0_186, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191, out a7_192, out s2_193, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202, out t4_203);
	}
}

// 2303FF8E: Register word32 bt_mesh_gatt_proxy_get(Register out Eq_2 a5Out)
// Called from:
//      node_identity_set
//      gatt_proxy_set
//      bt_mesh_net_sec_update
//      bt_mesh_net_recv
//      bt_mesh_net_start
//      next_sub.part.6
//      bt_mesh_proxy_adv_start
//      bt_mesh_heartbeat_send
word32 bt_mesh_gatt_proxy_get(union Eq_2 & a5Out)
{
	Eq_2 a5_5 = g_t4200F42C;
	word32 a0_6 = 0x02;
	if (a5_5 != 0x00)
		a0_6 = (word32) *((word32) a5_5 + 8);
	a5Out = a5_5;
	return a0_6;
}

// 2303FFA0: void node_identity_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0118)
void node_identity_set(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArg0104, Eq_2 dwArg0118)
{
	struct Eq_274 * a0_226;
	word32 a1_473;
	word32 a2_474;
	word32 a4_475;
	word32 a5_476;
	Eq_2 a0_31 = net_buf_simple_pull_le16(fp + -56, out a1_473, out a2_474, out a4_475, out a5_476);
	Eq_2 s4_103 = a0;
	Eq_2 s5_104 = a1;
	Eq_2 s0_151 = a0_31;
	if (a0_31 >= 0x01000000)
		a0_226 = (struct Eq_274 *) &g_t230B83E8;
	else
	{
		Eq_2 a5_43;
		word32 a2_478;
		word32 a1_477;
		Eq_2 a0_40 = net_buf_simple_pull_u8(0x01000000, out a1_477, out a2_478, out a5_43);
		Eq_2 s2_101 = a0_40;
		if (a0_40 <= 0x01)
		{
			Eq_2 a1_118;
			Eq_2 a5_129;
			word32 a4_481;
			word32 a5_482;
			word32 a2_480;
			word32 a1_479;
			bt_mesh_model_msg_init(0x08000048, a5_43, out a1_479, out a2_480, out a4_481, out a5_482);
			Eq_2 a5_59;
			word32 a4_484;
			word32 a3_483;
			Eq_2 a0_57 = bt_mesh_subnet_get(a0_31, out a3_483, out a4_484, out a5_59);
			Eq_2 s1_116 = a0_57;
			if (a0_57 == 0x00)
			{
				Eq_2 a5_123;
				net_buf_simple_add_u8(fp + -44, 0x04, a5_59, out a5_123);
				word32 a4_506;
				net_buf_simple_add_le16(fp + -44, a0_31, a5_123, out a4_506, out a5_129);
				a1_118 = a0_40;
			}
			else
			{
				Eq_2 a5_66;
				net_buf_simple_add_u8(fp + -44, 0x00, a5_59, out a5_66);
				word32 a4_504;
				word32 a5_505;
				net_buf_simple_add_le16(fp + -44, a0_31, a5_66, out a4_504, out a5_505);
				if (bt_mesh_gatt_proxy_get(out a5_129) == 0x01)
				{
					if (a0_40 != 0x00)
						a5_129 = bt_mesh_proxy_identity_start(a0_57);
					else
						bt_mesh_proxy_identity_stop(a0_57);
					word32 s8_537;
					word32 a3_534;
					word32 a4_535;
					word32 s3_536;
					word32 a0_533;
					ra = bt_mesh_adv_update(ra, a5_129, a1, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg2C, dwArg38, dwArg78, dwArg98, dwArgC8, dwArgD8, dwArg0118, out s0_151, out s1_116, out a0_533, out a3_534, out a4_535, out a5_129, out s2_101, out s3_536, out s4_103, out s5_104, out s6, out s7, out s8_537, out s9, out s11, out mstatus);
				}
				a1_118 = (word32) *((word32) s1_116 + 32);
			}
			word32 a5_526;
			net_buf_simple_add_u8(fp + -44, a1_118, a5_129, out a5_526);
			word32 a0_171;
			Eq_2 a3_174;
			word32 a5_531;
			word32 mstatus_532;
			word32 s1_528;
			word32 a2_529;
			word32 a4_530;
			word32 s0_527;
			Eq_2 ra_180 = bt_mesh_model_send(ra, s0_151, s1_116, s4_103, s5_104, fp + -44, 0x00, s2_101, s4_103, s6, s7, s9, s11, mstatus, dwLoc38, s4, s2, s0, dwLoc28, dwLoc24, dwLoc1C, dwLoc08, dwLoc04, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE4, dwArg0104, out s0_527, out s1_528, out a0_171, out a2_529, out a3_174, out a4_530, out a5_531, out mstatus_532);
			if (a0_171 != 0x00)
			{
				word32 t4_525;
				word32 s9_522;
				word32 s10_523;
				word32 s11_524;
				word32 s6_519;
				word32 s7_520;
				word32 s8_521;
				word32 s3_516;
				word32 s4_517;
				word32 s5_518;
				word32 a5_513;
				word32 a7_514;
				word32 s2_515;
				word32 a2_510;
				word32 a3_511;
				word32 a4_512;
				word32 a0_508;
				word32 a1_509;
				word32 s1_507;
				printf(ra_180, &g_t230B8670, a3_174, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_507, out a0_508, out a1_509, out a2_510, out a3_511, out a4_512, out a5_513, out a7_514, out s2_515, out s3_516, out s4_517, out s5_518, out s6_519, out s7_520, out s8_521, out s9_522, out s10_523, out s11_524, out t4_525);
			}
			return;
		}
		a0_226 = (struct Eq_274 *) &g_t230B8698;
	}
	word32 s10_501;
	word32 s11_502;
	word32 t4_503;
	word32 s8_499;
	word32 s9_500;
	word32 s5_496;
	word32 s6_497;
	word32 s7_498;
	word32 s2_493;
	word32 s3_494;
	word32 s4_495;
	word32 a4_490;
	word32 a5_491;
	word32 a7_492;
	word32 a1_487;
	word32 a2_488;
	word32 a3_489;
	word32 s1_485;
	word32 a0_486;
	printf(ra, a0_226, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_485, out a0_486, out a1_487, out a2_488, out a3_489, out a4_490, out a5_491, out a7_492, out s2_493, out s3_494, out s4_495, out s5_496, out s6_497, out s7_498, out s8_499, out s9_500, out s10_501, out s11_502, out t4_503);
}

// 2304008C: void send_gatt_proxy_status(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
// Called from:
//      gatt_proxy_get
//      gatt_proxy_set
void send_gatt_proxy_status(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	word32 a5_177;
	word32 a4_176;
	word32 a2_175;
	word32 a1_174;
	Eq_2 s1_28 = bt_mesh_model_msg_init(0x08000014, fp + -36, out a1_174, out a2_175, out a4_176, out a5_177);
	Eq_2 a5_31;
	word32 a5_178;
	net_buf_simple_add_u8(fp + -28, bt_mesh_gatt_proxy_get(out a5_31), a5_31, out a5_178);
	word32 a0_49;
	Eq_2 a3_52;
	word32 s0_179;
	word32 s1_180;
	word32 a2_181;
	word32 a4_182;
	word32 a5_183;
	word32 mstatus_184;
	Eq_2 ra_58 = bt_mesh_model_send(ra, a0, s1_28, a0, s1_28, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_179, out s1_180, out a0_49, out a2_181, out a3_52, out a4_182, out a5_183, out mstatus_184);
	if (a0_49 != 0x00)
	{
		word32 s1_185;
		word32 a0_186;
		word32 a1_187;
		word32 a2_188;
		word32 a3_189;
		word32 a4_190;
		word32 a5_191;
		word32 a7_192;
		word32 s2_193;
		word32 s3_194;
		word32 s4_195;
		word32 s5_196;
		word32 s6_197;
		word32 s7_198;
		word32 s8_199;
		word32 s9_200;
		word32 s10_201;
		word32 s11_202;
		word32 t4_203;
		printf(ra_58, &g_t230B8774, a3_52, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_185, out a0_186, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191, out a7_192, out s2_193, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202, out t4_203);
	}
}

// 230400E2: void gatt_proxy_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void gatt_proxy_get(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	send_gatt_proxy_status(ra, a0, s2, s4, s6, s7, s9, s11, mstatus, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124);
}

