pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230400E6: void gatt_proxy_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register (ptr32 byte) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void gatt_proxy_set(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, byte * a5, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 s0_17 = (word32) *a5;
	if (s0_17 <= 0x01)
	{
		Eq_2 s1_108 = a0;
		word32 a5_526;
		if (bt_mesh_gatt_proxy_get(out a5_526) != 0x02)
		{
			s2 = *((word32) a0 + 24);
			if (s2 == 0x00)
			{
				word32 t4_558;
				word32 s10_557;
				word32 s8_556;
				word32 s5_555;
				word32 s4_554;
				word32 s3_553;
				word32 a7_552;
				word32 a5_551;
				word32 a4_550;
				word32 a3_549;
				word32 a2_548;
				word32 a1_547;
				word32 a0_546;
				ra = printf(ra, &g_t230B82AC, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_108, out a0_546, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551, out a7_552, out s2, out s3_553, out s4_554, out s5_555, out s6, out s7, out s8_556, out s9, out s10_557, out s11, out t4_558);
			}
			else
			{
				Eq_2 a5_27 = (word32) *((word32) s2 + 8);
				if (a5_27 != s0_17)
				{
					*((word32) s2 + 8) = (byte) s0_17;
					if (s0_17 == 0x00)
					{
						Eq_2 a3_31 = (word32) g_w4200D8DC;
						if (a3_31 != 0x0FFFFFFF)
							bt_mesh_proxy_identity_stop(0x4200D8C0);
						if ((word32) g_w4200D9C0 != 0x0FFFFFFF)
							bt_mesh_proxy_identity_stop(0x4200D9A4);
						word32 s2_566;
						word32 s0_564;
						word32 s1_565;
						ra = bt_mesh_proxy_gatt_disconnect(ra, 0x4200D6BC, a0, a3_31, s2, a1, mstatus, dwLoc20, dwLoc1C, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, s3, s1, ra, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_564, out s1_565, out a5_27, out s2_566, out s5, out mstatus);
					}
					Eq_2 s3_112;
					Eq_2 s4_113;
					Eq_2 s5_114;
					Eq_2 s8_117;
					word32 a4_562;
					word32 a5_563;
					word32 a0_560;
					word32 a3_561;
					word32 s0_559;
					ra = bt_mesh_adv_update(ra, a5_27, s5, mstatus, dwArg10, dwArg14, dwArg38, dwArg5C, s1, dwArgA8, dwArgC8, dwArgF8, dwArg0108, dwArg0148, out s0_559, out s1_108, out a0_560, out a3_561, out a4_562, out a5_563, out s2, out s3_112, out s4_113, out s5_114, out s6, out s7, out s8_117, out s9, out s11, out mstatus);
					if (((word32) *((word32) s2 + 54) & 0x02) != 0x00)
					{
						word32 s8_574;
						word32 s4_572;
						word32 s5_573;
						word32 a5_570;
						word32 s3_571;
						word32 a3_568;
						word32 a4_569;
						word32 s0_567;
						ra = bt_mesh_heartbeat_send(ra, s2, s3_112, s4_113, s5_114, s6, s7, s8_117, mstatus, dwLoc20, dwLoc1C, s2, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg2C, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_567, out s1_108, out a3_568, out a4_569, out a5_570, out s2, out s3_571, out s4_572, out s5_573, out s6, out s7, out s8_574, out s9, out s11, out mstatus);
					}
				}
			}
		}
		send_gatt_proxy_status(ra, s1_108, s2, dwArg04, s6, s7, s9, s11, mstatus, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124);
	}
	else
	{
		word32 t4_545;
		word32 s11_544;
		word32 s10_543;
		word32 s9_542;
		word32 s8_541;
		word32 s7_540;
		word32 s6_539;
		word32 s5_538;
		word32 s4_537;
		word32 s3_536;
		word32 s2_535;
		word32 a7_534;
		word32 a5_533;
		word32 a4_532;
		word32 a2_530;
		word32 a3_531;
		word32 a0_528;
		word32 a1_529;
		word32 s1_527;
		printf(ra, &g_t230B82D8, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_527, out a0_528, out a1_529, out a2_530, out a3_531, out a4_532, out a5_533, out a7_534, out s2_535, out s3_536, out s4_537, out s5_538, out s6_539, out s7_540, out s8_541, out s9_542, out s10_543, out s11_544, out t4_545);
	}
}

