pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0003.c
// 230401AE: Register word32 bt_mesh_default_ttl_get(Register out Eq_2 a5Out)
// Called from:
//      default_ttl_set
//      default_ttl_get
//      ack_timeout
//      bt_mesh_trans_send
//      bt_mesh_ctl_send
word32 bt_mesh_default_ttl_get(union Eq_2 & a5Out)
{
	Eq_2 a5_5 = g_t4200F42C;
	word32 a0_6 = 0x07;
	if (a5_5 != 0x00)
		a0_6 = (word32) *((word32) a5_5 + 0x0A);
	a5Out = a5_5;
	return a0_6;
}

// 230401C0: void default_ttl_set(Register Eq_2 ra, Register word32 s0, Register Eq_2 a3, Register (ptr32 byte) a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void default_ttl_set(Eq_2 ra, word32 s0, Eq_2 a3, byte * a4, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	byte bLoc1A_200 = SLICE(s0, byte, 16);
	Eq_2 a5_14 = fp + -36;
	if (fp == ~0x23)
	{
		word32 t4_310;
		word32 s10_309;
		word32 s8_308;
		word32 s5_307;
		word32 s3_306;
		word32 a7_305;
		word32 a4_304;
		word32 s1_299;
		word32 a0_300;
		word32 a1_301;
		word32 a2_302;
		word32 a3_303;
		ra = printf(ra, &g_t230B82AC, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_299, out a0_300, out a1_301, out a2_302, out a3_303, out a4_304, out a5_14, out a7_305, out s2, out s3_306, out s4, out s5_307, out s6, out s7, out s8_308, out s9, out s10_309, out s11, out t4_310);
	}
	else
	{
		word32 a1_22 = (word32) *a4;
		if ((int32) (byte) a1_22 < 0x00 || a1_22 == 0x01)
		{
			word32 s1_330;
			word32 a0_331;
			word32 a1_332;
			word32 a2_333;
			word32 a3_334;
			word32 a4_335;
			word32 a5_336;
			word32 a7_337;
			word32 s2_338;
			word32 s3_339;
			word32 s4_340;
			word32 s5_341;
			word32 s6_342;
			word32 s7_343;
			word32 s8_344;
			word32 s9_345;
			word32 s10_346;
			word32 s11_347;
			word32 t4_348;
			printf(ra, &g_t230B8198, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_330, out a0_331, out a1_332, out a2_333, out a3_334, out a4_335, out a5_336, out a7_337, out s2_338, out s3_339, out s4_340, out s5_341, out s6_342, out s7_343, out s8_344, out s9_345, out s10_346, out s11_347, out t4_348);
			return;
		}
	}
	word32 a1_349;
	word32 a2_350;
	word32 a4_351;
	word32 a5_352;
	Eq_2 s1_91 = bt_mesh_model_msg_init(0x0800000E, a5_14, out a1_349, out a2_350, out a4_351, out a5_352);
	Eq_2 a5_94;
	word32 a5_353;
	net_buf_simple_add_u8(fp + -28, bt_mesh_default_ttl_get(out a5_94), a5_94, out a5_353);
	word32 a0_122;
	Eq_2 a3_125;
	word32 s0_354;
	word32 s1_355;
	word32 a2_356;
	word32 a4_357;
	word32 a5_358;
	word32 mstatus_359;
	Eq_2 ra_131 = bt_mesh_model_send(ra, dwLoc0C, s1_91, dwLoc0C, s1_91, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_354, out s1_355, out a0_122, out a2_356, out a3_125, out a4_357, out a5_358, out mstatus_359);
	if (a0_122 != 0x00)
	{
		word32 a0_312;
		word32 s1_311;
		word32 a1_313;
		word32 a2_314;
		word32 a3_315;
		word32 a4_316;
		word32 a5_317;
		word32 a7_318;
		word32 s2_319;
		word32 s3_320;
		word32 s4_321;
		word32 s5_322;
		word32 s6_323;
		word32 s7_324;
		word32 s8_325;
		word32 s9_326;
		word32 s10_327;
		word32 s11_328;
		word32 t4_329;
		printf(ra_131, &g_t230B81C0, a3_125, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_311, out a0_312, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317, out a7_318, out s2_319, out s3_320, out s4_321, out s5_322, out s6_323, out s7_324, out s8_325, out s9_326, out s10_327, out s11_328, out t4_329);
	}
}

// 23040258: void default_ttl_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0124)
void default_ttl_get(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0124)
{
	word32 a5_177;
	word32 a4_176;
	word32 a2_175;
	word32 a1_174;
	Eq_2 s1_28 = bt_mesh_model_msg_init(0x0800000E, fp + -36, out a1_174, out a2_175, out a4_176, out a5_177);
	Eq_2 a5_31;
	word32 a5_178;
	net_buf_simple_add_u8(fp + -28, bt_mesh_default_ttl_get(out a5_31), a5_31, out a5_178);
	word32 a0_49;
	Eq_2 a3_52;
	word32 s0_179;
	word32 s1_180;
	word32 a2_181;
	word32 a4_182;
	word32 a5_183;
	word32 mstatus_184;
	Eq_2 ra_58 = bt_mesh_model_send(ra, a0, s1_28, a0, s1_28, fp + -28, 0x00, s2, s4, s6, s7, s9, s11, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg18, dwArg1C, dwArg38, dwArg3C, dwArg44, dwArg48, fp + -36, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0124, out s0_179, out s1_180, out a0_49, out a2_181, out a3_52, out a4_182, out a5_183, out mstatus_184);
	if (a0_49 != 0x00)
	{
		word32 s1_185;
		word32 a0_186;
		word32 a1_187;
		word32 a2_188;
		word32 a3_189;
		word32 a4_190;
		word32 a5_191;
		word32 a7_192;
		word32 s2_193;
		word32 s3_194;
		word32 s4_195;
		word32 s5_196;
		word32 s6_197;
		word32 s7_198;
		word32 s8_199;
		word32 s9_200;
		word32 s10_201;
		word32 s11_202;
		word32 t4_203;
		printf(ra_58, &g_t230B81C0, a3_52, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_185, out a0_186, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191, out a7_192, out s2_193, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202, out t4_203);
	}
}

// 230402AE: Register Eq_2 bt_mesh_label_uuid_get(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out (ptr32 Eq_212308) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out (ptr32 Eq_212314) s10Out, Register out ptr32 s11Out)
// Called from:
//      mod_reset
//      sdu_recv
//      bt_mesh_trans_send
Eq_2 bt_mesh_label_uuid_get(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s2Out, struct Eq_212308 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, struct Eq_212314 & s10Out, ptr32 & s11Out)
{
	if ((word32) g_w4201435A == a0)
	{
		s1Out = s1;
		a0Out = 1107379036;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	else
	{
		Eq_2 a3_21;
		ptr32 s1_25;
		struct Eq_212314 * s10_26;
		ptr32 s11_27;
		ptr32 s2_28;
		struct Eq_212308 * s3_29;
		ptr32 s4_30;
		ptr32 s5_31;
		ptr32 s6_32;
		ptr32 s7_33;
		ptr32 s9_35;
		word32 a0_101;
		word32 a1_102;
		word32 a2_103;
		word32 a4_104;
		word32 a5_105;
		word32 a7_106;
		word32 s8_107;
		word32 t4_108;
		Eq_2 ra_24 = printf(ra, &g_t230B8174, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_25, out a0_101, out a1_102, out a2_103, out a3_21, out a4_104, out a5_105, out a7_106, out s2_28, out s3_29, out s4_30, out s5_31, out s6_32, out s7_33, out s8_107, out s9_35, out s10_26, out s11_27, out t4_108);
		s1Out = s1_25;
		a0Out = 0x00;
		a3Out = a3_21;
		s2Out = s2_28;
		s3Out = s3_29;
		s4Out = s4_30;
		s5Out = s5_31;
		s6Out = s6_32;
		s7Out = s7_33;
		s9Out = s9_35;
		s10Out = s10_26;
		s11Out = s11_27;
		return ra_24;
	}
}

// 230402DE: Register Eq_2 mod_sub_list_clear(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out (ptr32 uint16) s2Out, Register out (ptr32 uint16) s3Out, Register out Eq_212393 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 s11Out)
// Called from:
//      mod_sub_del_all
//      mod_sub_va_overwrite
//      mod_sub_overwrite
//      mod_reset
Eq_2 mod_sub_list_clear(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, word32 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a3Out, uint16 & s2Out, uint16 & s3Out, union Eq_212393 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & s11Out)
{
	uint16 * s2_207 = &g_w42014358;
	uint16 * s0_106 = a0 + 16;
	uint16 * s3_107 = a0 + 20;
	ptr32 s1_103 = 0x00;
	word32 s4_122 = 0xF8000000;
	ptr32 s5_123 = 0x04000000;
	ptr32 s6_209 = 0x230B8000;
	Eq_2 s7_211 = 1107379036;
	do
	{
		word32 a0_34 = (word32) *s0_106;
		if ((word32) (word16) (a0_34 + s4_122) >= s5_123)
		{
			if (a0_34 != 0x00)
			{
				*s0_106 = 0x00;
				++s1_103;
			}
		}
		else
		{
			Eq_2 a0_43;
			Eq_2 a3_48;
			word32 s1_51;
			word32 s10_234;
			ra = bt_mesh_label_uuid_get(ra, a0_34, a3, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out s1_51, out a0_43, out a3_48, out s2_207, out s3_107, out s4_122, out s5_123, out s6_209, out s7_211, out s9, out s10_234, out s11);
			*s0_106 = 0x00;
			s1_103 = s1_51 + 0x01;
			if (a0_43 == 0x00)
			{
				word32 a0_235;
				word32 a1_236;
				word32 a2_237;
				word32 a4_238;
				word32 a5_239;
				word32 a7_240;
				word32 s8_241;
				word32 s10_242;
				word32 t4_243;
				ra = printf(ra, s6_209 + 1500, a3_48, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_103, out a0_235, out a1_236, out a2_237, out a3, out a4_238, out a5_239, out a7_240, out s2_207, out s3_107, out s4_122, out s5_123, out s6_209, out s7_211, out s8_241, out s9, out s10_242, out s11, out t4_243);
			}
			else
			{
				word32 a1_244;
				word32 a2_245;
				word32 a4_246;
				word32 a5_247;
				if (memcmp(s7_211, a0_43, 0x10, out a1_244, out a2_245, out a3, out a4_246, out a5_247) == 0x00)
					*s2_207 = (word16) ((word32) *s2_207 + ~0x00);
			}
		}
		++s0_106;
	} while (s3_107 != s0_106);
	0x00 = dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_103;
	a3Out = a3;
	s2Out = s2_207;
	s3Out = s3_107;
	s4Out = dwArg78;
	s5Out = s5_123;
	s6Out = s6_209;
	s7Out = s7_211;
	s8Out = s5;
	s9Out = s9;
	s11Out = s11;
	return ra;
}

